// AnimBlueprintGeneratedClass A_Nurr_AnimBP.A_Nurr_AnimBP_C
// Size: 0x217d (Inherited: 0x330)
struct UA_Nurr_AnimBP_C : UMistPhysicalMobAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x330(0x08)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x338(0x30)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x368(0xc8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x430(0x78)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x4a8(0x48)
	struct FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_4; // 0x4f0(0x58)
	struct FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_3; // 0x548(0x58)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x5a0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_CustomTransitionResult_2; // 0x618(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x648(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x670(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x698(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x6c0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x6e8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x710(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x738(0x28)
	struct FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator_2; // 0x760(0x58)
	struct FAnimNode_TransitionPoseEvaluator AnimGraphNode_TransitionPoseEvaluator; // 0x7b8(0x58)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x810(0x78)
	struct FAnimNode_StateResult AnimGraphNode_CustomTransitionResult; // 0x888(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x8b8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x8e0(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x958(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x988(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0xa00(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0xa30(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0xaa8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0xad8(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0xb50(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0xb80(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0xc20(0xf0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0xd10(0xf0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0xe00(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0xe30(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0xee0(0xb8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0xf98(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0x1058(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x1080(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x1120(0x48)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x1168(0x48)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0x11b0(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x11d8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1278(0x78)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x12f0(0x108)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x13f8(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x1418(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x1438(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x14f0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x1518(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x1540(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x1568(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x1620(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x1648(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x1708(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x1730(0x20)
	struct FAnimNode_RigidBody AnimGraphNode_RigidBody; // 0x1750(0x590)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x1ce0(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x1d00(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x1db8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x1de0(0x28)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x1e08(0x198)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x1fa0(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x2060(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x2118(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x2140(0x28)
	bool IsLaying; // 0x2168(0x01)
	bool IsAttackingWalker; // 0x2169(0x01)
	bool IsAttacking; // 0x216a(0x01)
	char pad_216B[0x5]; // 0x216b(0x05)
	struct UAnimMontage* AttackMontage; // 0x2170(0x08)
	int32_t AttackType; // 0x2178(0x04)
	bool TakingDamage; // 0x217c(0x01)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function A_Nurr_AnimBP.A_Nurr_AnimBP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_A_Nurr_AnimBP_AnimGraphNode_BlendListByBool_1B1C7A8743DA2A460AA22AB87A20CA37(); // Function A_Nurr_AnimBP.A_Nurr_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_A_Nurr_AnimBP_AnimGraphNode_BlendListByBool_1B1C7A8743DA2A460AA22AB87A20CA37 // (BlueprintEvent) // @ game+0x163f1c0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_A_Nurr_AnimBP_AnimGraphNode_TransitionResult_1F17424E42061F5184FAB9AA8C4E1883(); // Function A_Nurr_AnimBP.A_Nurr_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_A_Nurr_AnimBP_AnimGraphNode_TransitionResult_1F17424E42061F5184FAB9AA8C4E1883 // (BlueprintEvent) // @ game+0x163f1c0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_A_Nurr_AnimBP_AnimGraphNode_TransitionResult_1585051C45429D420CE3C998EA439495(); // Function A_Nurr_AnimBP.A_Nurr_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_A_Nurr_AnimBP_AnimGraphNode_TransitionResult_1585051C45429D420CE3C998EA439495 // (BlueprintEvent) // @ game+0x163f1c0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_A_Nurr_AnimBP_AnimGraphNode_BlendListByBool_5D3ADEBA40A5DD0BFC4FCA8E71CE04FF(); // Function A_Nurr_AnimBP.A_Nurr_AnimBP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_A_Nurr_AnimBP_AnimGraphNode_BlendListByBool_5D3ADEBA40A5DD0BFC4FCA8E71CE04FF // (BlueprintEvent) // @ game+0x163f1c0
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function A_Nurr_AnimBP.A_Nurr_AnimBP_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void ExecuteUbergraph_A_Nurr_AnimBP(int32_t EntryPoint); // Function A_Nurr_AnimBP.A_Nurr_AnimBP_C.ExecuteUbergraph_A_Nurr_AnimBP // (Final|UbergraphFunction) // @ game+0x163f1c0
};

