// BlueprintGeneratedClass AbandonedTradingStation.AbandonedTradingStation_C
// Size: 0xb30 (Inherited: 0x3f0)
struct AAbandonedTradingStation_C : AMistBasePersistentActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3f0(0x08)
	struct ULootableBreakableWoodenBoxComponent_C* LootableBreakableOldChestComponent9; // 0x3f8(0x08)
	struct UStaticMeshComponent* SM_Heavylegs_02; // 0x400(0x08)
	struct UStaticMeshComponent* SM_Barrel_041; // 0x408(0x08)
	struct UStaticMeshComponent* SM_Barrel_040; // 0x410(0x08)
	struct UStaticMeshComponent* SM_Barrel_039; // 0x418(0x08)
	struct UStaticMeshComponent* SM_Barrel_038; // 0x420(0x08)
	struct UStaticMeshComponent* SM_Barrel_037; // 0x428(0x08)
	struct UStaticMeshComponent* SM_Barrel_035; // 0x430(0x08)
	struct UStaticMeshComponent* SM_Barrel_034; // 0x438(0x08)
	struct UStaticMeshComponent* SM_Barrel_033; // 0x440(0x08)
	struct UStaticMeshComponent* SM_Barrel_032; // 0x448(0x08)
	struct UStaticMeshComponent* SM_Barrel_031; // 0x450(0x08)
	struct UStaticMeshComponent* SM_Barrel_024; // 0x458(0x08)
	struct UStaticMeshComponent* SM_Barrel_011; // 0x460(0x08)
	struct UStaticMeshComponent* SM_Barrel_022; // 0x468(0x08)
	struct UStaticMeshComponent* SM_Barrel_021; // 0x470(0x08)
	struct UStaticMeshComponent* SM_Barrel_020; // 0x478(0x08)
	struct UStaticMeshComponent* SM_Barrel_019; // 0x480(0x08)
	struct UStaticMeshComponent* SM_Barrel_018; // 0x488(0x08)
	struct UStaticMeshComponent* SM_Barrel_017; // 0x490(0x08)
	struct UStaticMeshComponent* SM_Barrel_016; // 0x498(0x08)
	struct UStaticMeshComponent* SM_Barrel_015; // 0x4a0(0x08)
	struct UStaticMeshComponent* SM_Barrel_09; // 0x4a8(0x08)
	struct UStaticMeshComponent* SM_Barrel_030; // 0x4b0(0x08)
	struct USkeletalMeshComponent* SK_Wing_NC_Mountain_01; // 0x4b8(0x08)
	struct ULootableBreakableWoodenBoxComponent_C* LootableBreakableOldChestComponent_08; // 0x4c0(0x08)
	struct ULootableBackpackComponent_C* LootableBagComponent_02; // 0x4c8(0x08)
	struct ULootableBrokenBarrelComponent_C* LootableBrokenBarrelComponent9; // 0x4d0(0x08)
	struct UStaticMeshComponent* SM_ShufflerWalker_01; // 0x4d8(0x08)
	struct UStaticMeshComponent* SM_TradingStationScaffoldingBig_15; // 0x4e0(0x08)
	struct UStaticMeshComponent* SM_Heavylegs_01; // 0x4e8(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleTopFloor_04; // 0x4f0(0x08)
	struct UStaticMeshComponent* SM_AbandonedTradingStation_Proxy; // 0x4f8(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_033; // 0x500(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_034; // 0x508(0x08)
	struct ULootableBackpackComponent_C* LootableBagComponent_01; // 0x510(0x08)
	struct ULootableBrokenBarrelComponent_C* LootablePackageComponent_08; // 0x518(0x08)
	struct ULootableBreakableWoodenBoxComponent_C* LootableBreakableOldChestComponent_07; // 0x520(0x08)
	struct ULootableBrokenBarrelComponent_C* LootablePackageComponent_07; // 0x528(0x08)
	struct ULootableBrokenBarrelComponent_C* LootablePackageComponent_06; // 0x530(0x08)
	struct ULootableBreakableWoodenBoxComponent_C* LootableBreakableOldChestComponent_06; // 0x538(0x08)
	struct ULootableBrokenBarrelComponent_C* LootablePackageComponent_05; // 0x540(0x08)
	struct ULootableBrokenBarrelComponent_C* LootablePackageComponent_01; // 0x548(0x08)
	struct ULootableBreakableWoodenBoxComponent_C* LootableBreakableOldChestComponent_05; // 0x550(0x08)
	struct ULootableBrokenBarrelComponent_C* LootablePackageComponent_03; // 0x558(0x08)
	struct ULootableBreakableWoodenBoxComponent_C* LootableBreakableOldChestComponent3; // 0x560(0x08)
	struct ULootableBreakableWoodenBoxComponent_C* LootableBreakableOldChestComponent_02; // 0x568(0x08)
	struct ULootableBrokenBarrelComponent_C* LootablePackageComponent_02; // 0x570(0x08)
	struct ULootableBreakableWoodenBoxComponent_C* LootableBreakableOldChestComponent_01; // 0x578(0x08)
	struct ULootableBrokenBarrelComponent_C* LootablePackageComponent_04; // 0x580(0x08)
	struct UStaticMeshComponent* SM_ClaimingWalker; // 0x588(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleFloorPart_14; // 0x590(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleFloorPart_17; // 0x598(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleFloorPart_18; // 0x5a0(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_032; // 0x5a8(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_031; // 0x5b0(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_030; // 0x5b8(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_029; // 0x5c0(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_028; // 0x5c8(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_027; // 0x5d0(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_026; // 0x5d8(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_025; // 0x5e0(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_024; // 0x5e8(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_023; // 0x5f0(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_022; // 0x5f8(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_020; // 0x600(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_019; // 0x608(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_018; // 0x610(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_017; // 0x618(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_016; // 0x620(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_015; // 0x628(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_014; // 0x630(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_013; // 0x638(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_021; // 0x640(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_012; // 0x648(0x08)
	struct UStaticMeshComponent* SM_HotspotKitbashElement_Rope_01; // 0x650(0x08)
	struct UStaticMeshComponent* SM_HotspotKitbashElement_Rope_04; // 0x658(0x08)
	struct UStaticMeshComponent* SM_HotspotKitbashElement_Rope_03; // 0x660(0x08)
	struct UStaticMeshComponent* SM_HotspotKitbashElement_Rope_02; // 0x668(0x08)
	struct UStaticMeshComponent* SM_HotspotKitbashElement_Rope_11; // 0x670(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleFloorBig_13; // 0x678(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleTopFloor_01; // 0x680(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleTopFloor_02; // 0x688(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleTopFloor_03; // 0x690(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_010; // 0x698(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_01; // 0x6a0(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_07; // 0x6a8(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_05; // 0x6b0(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_06; // 0x6b8(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_011; // 0x6c0(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_09; // 0x6c8(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_08; // 0x6d0(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_02; // 0x6d8(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_11; // 0x6e0(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_04; // 0x6e8(0x08)
	struct UStaticMeshComponent* SM_TradingStationConstructionUp_04; // 0x6f0(0x08)
	struct UStaticMeshComponent* SM_TradingStationScaffoldingBig_05; // 0x6f8(0x08)
	struct UStaticMeshComponent* SM_TradingStationConstructionUp_03; // 0x700(0x08)
	struct UStaticMeshComponent* SM_TradingStationConstructionUp_01; // 0x708(0x08)
	struct UStaticMeshComponent* SM_TradingStationConstructionUp_02; // 0x710(0x08)
	struct UStaticMeshComponent* SM_TradingStationConstructionUpTotem_04; // 0x718(0x08)
	struct UStaticMeshComponent* SM_TradingStationConstructionUpTotem_03; // 0x720(0x08)
	struct UStaticMeshComponent* SM_TradingStationScaffoldingBig_08; // 0x728(0x08)
	struct UStaticMeshComponent* SM_TradingStationConstructionUp_13; // 0x730(0x08)
	struct UStaticMeshComponent* SM_TradingStationConstructionUp_12; // 0x738(0x08)
	struct UStaticMeshComponent* SM_TradingStationConstructionUp_15; // 0x740(0x08)
	struct UStaticMeshComponent* SM_TradingStationConstructionUp_14; // 0x748(0x08)
	struct UStaticMeshComponent* SM_TradingStationConstructionUp_11; // 0x750(0x08)
	struct UStaticMeshComponent* SM_TradingStationConstructionUp_07; // 0x758(0x08)
	struct UStaticMeshComponent* SM_TradingStationConstructionUpTotem_02; // 0x760(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleFloorPartBig_02; // 0x768(0x08)
	struct UStaticMeshComponent* SM_TradingStationConstructionUp_16; // 0x770(0x08)
	struct UStaticMeshComponent* SM_TradingStationConstructionUp_19; // 0x778(0x08)
	struct UStaticMeshComponent* SM_TradingStationConstructionUp_18; // 0x780(0x08)
	struct UStaticMeshComponent* SM_TradingStationConstructionUp_17; // 0x788(0x08)
	struct UStaticMeshComponent* SM_TradingStationConstructionUp_06; // 0x790(0x08)
	struct UStaticMeshComponent* SM_TradingStationConstructionUp_08; // 0x798(0x08)
	struct UStaticMeshComponent* SM_TradingStationStairs_02; // 0x7a0(0x08)
	struct UStaticMeshComponent* SM_TradingStationStairs_01; // 0x7a8(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleFloorSmall_04; // 0x7b0(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleFloorSmall_03; // 0x7b8(0x08)
	struct UStaticMeshComponent* SM_TradingStationDockArmDown_06; // 0x7c0(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleFloorPartBig_04; // 0x7c8(0x08)
	struct UStaticMeshComponent* SM_HotspotKitbashElement_Rope_07; // 0x7d0(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleFloorPartBig_06; // 0x7d8(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleFloorPartBig_01; // 0x7e0(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleFloorPartBig_07; // 0x7e8(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleFloorSmall_06; // 0x7f0(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleFloorSmall_05; // 0x7f8(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleFloorBig_17; // 0x800(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleFloorBig_15; // 0x808(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleFloorBig_14; // 0x810(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleFloorPartBig_05; // 0x818(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleFloorSmall_01; // 0x820(0x08)
	struct UStaticMeshComponent* SM_TradingStationDockArmDown_08; // 0x828(0x08)
	struct UStaticMeshComponent* SM_TradingStationScaffoldingBig_14; // 0x830(0x08)
	struct UStaticMeshComponent* SM_TradingStationScaffoldingBig_02; // 0x838(0x08)
	struct UStaticMeshComponent* SM_TradingStationDockArmDown_02; // 0x840(0x08)
	struct UStaticMeshComponent* SM_TradingStationScaffoldingBig_06; // 0x848(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleFloorBig_19; // 0x850(0x08)
	struct UStaticMeshComponent* SM_TradingStationScaffoldingBig_01; // 0x858(0x08)
	struct UStaticMeshComponent* SM_TradingStationScaffoldingBig_07; // 0x860(0x08)
	struct UStaticMeshComponent* SM_HotspotKitbashElement_Rope_06; // 0x868(0x08)
	struct UStaticMeshComponent* SM_HotspotKitbashElement_Rope_05; // 0x870(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleFloorBig_22; // 0x878(0x08)
	struct UStaticMeshComponent* SM_HotspotKitbashElement_Rope_08; // 0x880(0x08)
	struct UStaticMeshComponent* SM_HotspotKitbashElement_Rope_09; // 0x888(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleFloorBig_18; // 0x890(0x08)
	struct UStaticMeshComponent* SM_TradingStationConstructionUp_05; // 0x898(0x08)
	struct UStaticMeshComponent* SM_TradingStationDockArmDown_07; // 0x8a0(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleFloorPart_16; // 0x8a8(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleFloorPart_15; // 0x8b0(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleFloorPart_13; // 0x8b8(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleFloorPart_11; // 0x8c0(0x08)
	struct UStaticMeshComponent* SM_TradingStationScaffoldingBig_03; // 0x8c8(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleFloorBig_03; // 0x8d0(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleFloorPart_02; // 0x8d8(0x08)
	struct UStaticMeshComponent* SM_TradingStationScaffoldingBig_12; // 0x8e0(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleFloorPart_09; // 0x8e8(0x08)
	struct UStaticMeshComponent* SM_TradingStationDockArmDown_05; // 0x8f0(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleFloorPart_12; // 0x8f8(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleFloorBig_02; // 0x900(0x08)
	struct UStaticMeshComponent* SM_TradingStationScaffoldingBig_04; // 0x908(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleFloorBig_04; // 0x910(0x08)
	struct UStaticMeshComponent* SM_TradingStationCircleFloorBig_05; // 0x918(0x08)
	struct UStaticMeshComponent* SM_TradingStationDockArmDown_03; // 0x920(0x08)
	struct UStaticMeshComponent* SM_TradingStationConstructionUp_09; // 0x928(0x08)
	struct UHideComponent_C* HideComponent; // 0x930(0x08)
	struct UAudioComponent* WingFlapsPosition; // 0x938(0x08)
	struct USphereComponent* SoundTrigger; // 0x940(0x08)
	struct UAudioComponent* WingMechPosition; // 0x948(0x08)
	struct ULootableBreakableWoodenBoxComponent_C* LootableBreakableOldChestComponent_04; // 0x950(0x08)
	struct ULootableBrokenBarrelComponent_C* LootablePackageComponent_09; // 0x958(0x08)
	struct UStaticMeshComponent* SM_Barrel_04; // 0x960(0x08)
	struct UStaticMeshComponent* SM_Barrel_042; // 0x968(0x08)
	struct UStaticMeshComponent* SM_Barrel_025; // 0x970(0x08)
	struct UStaticMeshComponent* SM_Barrel_026; // 0x978(0x08)
	struct UStaticMeshComponent* SM_Barrel_010; // 0x980(0x08)
	struct UStaticMeshComponent* SM_Barrel_012; // 0x988(0x08)
	struct UStaticMeshComponent* SM_Barrel_08; // 0x990(0x08)
	struct UStaticMeshComponent* SM_Barrel_013; // 0x998(0x08)
	struct UStaticMeshComponent* SM_Barrel_023; // 0x9a0(0x08)
	struct UStaticMeshComponent* SM_Barrel_029; // 0x9a8(0x08)
	struct UStaticMeshComponent* SM_Barrel_027; // 0x9b0(0x08)
	struct UStaticMeshComponent* SM_Barrel_028; // 0x9b8(0x08)
	struct UStaticMeshComponent* SM_Barrel_043; // 0x9c0(0x08)
	struct UStaticMeshComponent* SM_Barrel_045; // 0x9c8(0x08)
	struct UStaticMeshComponent* SM_Barrel_044; // 0x9d0(0x08)
	struct UStaticMeshComponent* SM_Barrel_046; // 0x9d8(0x08)
	struct UStaticMeshComponent* SM_Barrel_047; // 0x9e0(0x08)
	struct UStaticMeshComponent* SM_Barrel_01; // 0x9e8(0x08)
	struct UStaticMeshComponent* SM_Barrel_03; // 0x9f0(0x08)
	struct UStaticMeshComponent* SM_Barrel_02; // 0x9f8(0x08)
	struct UStaticMeshComponent* SM_Barrel_06; // 0xa00(0x08)
	struct UStaticMeshComponent* SM_Barrel_05; // 0xa08(0x08)
	struct UMistMapIconProviderComponent* MistMapIconProvider; // 0xa10(0x08)
	struct UBoxComponent* AbandonedTradingStation; // 0xa18(0x08)
	struct UAudioComponent* Audio24; // 0xa20(0x08)
	struct UAudioComponent* Audio23; // 0xa28(0x08)
	struct UAudioComponent* Audio22; // 0xa30(0x08)
	struct UAudioComponent* Audio21; // 0xa38(0x08)
	struct UAudioComponent* Audio20; // 0xa40(0x08)
	struct UAudioComponent* Audio19; // 0xa48(0x08)
	struct UAudioComponent* Audio18; // 0xa50(0x08)
	struct UAudioComponent* Audio17; // 0xa58(0x08)
	struct UAudioComponent* Audio16; // 0xa60(0x08)
	struct UAudioComponent* Audio15; // 0xa68(0x08)
	struct UAudioComponent* Audio14; // 0xa70(0x08)
	struct UAudioComponent* Audio29Stairs; // 0xa78(0x08)
	struct UAudioComponent* Audio28Stairs; // 0xa80(0x08)
	struct UAudioComponent* Audio27Stairs; // 0xa88(0x08)
	struct UAudioComponent* Audio25; // 0xa90(0x08)
	struct UAudioComponent* Audio9; // 0xa98(0x08)
	struct UAudioComponent* Audio8; // 0xaa0(0x08)
	struct UAudioComponent* Audio7; // 0xaa8(0x08)
	struct UAudioComponent* Audio6; // 0xab0(0x08)
	struct UAudioComponent* Audio5; // 0xab8(0x08)
	struct UAudioComponent* Audio4; // 0xac0(0x08)
	struct UAudioComponent* Audio3; // 0xac8(0x08)
	struct UAudioComponent* Audio11; // 0xad0(0x08)
	struct UAudioComponent* Audio2; // 0xad8(0x08)
	struct UAudioComponent* Audio1; // 0xae0(0x08)
	struct UAudioComponent* Audio26; // 0xae8(0x08)
	struct UAudioComponent* Audio13; // 0xaf0(0x08)
	struct UAudioComponent* Audio12; // 0xaf8(0x08)
	struct UAudioComponent* Audio10; // 0xb00(0x08)
	struct UAudioComponent* Audio0; // 0xb08(0x08)
	struct UMistWorldObjectAdjustmentsComponent* MistWorldObjectAdjustments; // 0xb10(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0xb18(0x08)
	struct UAudioComponent* WingFlaps; // 0xb20(0x08)
	struct UAudioComponent* WingMech; // 0xb28(0x08)

	void UserConstructionScript(); // Function AbandonedTradingStation.AbandonedTradingStation_C.UserConstructionScript // (Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void ReceiveBeginPlay(); // Function AbandonedTradingStation.AbandonedTradingStation_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x163f1c0
	void AudioCreakTrigger(); // Function AbandonedTradingStation.AbandonedTradingStation_C.AudioCreakTrigger // (BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__SoundTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginActorTriggerSignature__DelegateSignature(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function AbandonedTradingStation.AbandonedTradingStation_C.BndEvt__SoundTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginActorTriggerSignature__DelegateSignature // (BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__SoundTrigger_K2Node_ComponentBoundEvent_4_ComponentEndActorTriggerSignature__DelegateSignature(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function AbandonedTradingStation.AbandonedTradingStation_C.BndEvt__SoundTrigger_K2Node_ComponentBoundEvent_4_ComponentEndActorTriggerSignature__DelegateSignature // (BlueprintEvent) // @ game+0x163f1c0
	void ExecuteUbergraph_AbandonedTradingStation(int32_t EntryPoint); // Function AbandonedTradingStation.AbandonedTradingStation_C.ExecuteUbergraph_AbandonedTradingStation // (Final|UbergraphFunction|HasDefaults) // @ game+0x163f1c0
};

