// BlueprintGeneratedClass AncientStation.AncientStation_C
// Size: 0x452 (Inherited: 0x3f0)
struct AAncientStation_C : AMistBasePersistentActor {
	struct UBoxComponent* AncientCraftingSite; // 0x3f0(0x08)
	struct UBoxComponent* Box; // 0x3f8(0x08)
	struct UBoxComponent* bLock; // 0x400(0x08)
	struct UMistMapIconProviderComponent* MistMapIconProvider; // 0x408(0x08)
	struct UTorqueContainerComponent_C* TorqueContainerComponent; // 0x410(0x08)
	struct UMistToggleAutoCraftingStationComponent* TorqueConsumption; // 0x418(0x08)
	struct UMistContainerComponent* OutputContainer; // 0x420(0x08)
	struct UMistContainerComponent* InputContainer; // 0x428(0x08)
	struct UMistAlternativeFurnaceComponent* AncientCraftingFurnace; // 0x430(0x08)
	struct UStaticMeshComponent* SM_AncientCraftingStation1; // 0x438(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x440(0x08)
	struct UAudioComponent* FiberstationWorking; // 0x448(0x08)
	bool Finished; // 0x450(0x01)
	bool FiberActive; // 0x451(0x01)
};

