// BlueprintGeneratedClass AncientStructure_Blueprint.AncientStructure_Blueprint_C
// Size: 0x718 (Inherited: 0x3f0)
struct AAncientStructure_Blueprint_C : AMistBasePersistentActor {
	struct UMistMapIconProviderComponent* MistMapIconProvider; // 0x3f0(0x08)
	struct UBoxComponent* AncientRuins; // 0x3f8(0x08)
	struct UStaticMeshComponent* SM_Ancient1_addictional2; // 0x400(0x08)
	struct UStaticMeshComponent* SM_Ancient1_addictional_Object135; // 0x408(0x08)
	struct UStaticMeshComponent* SM_Ancient1_addictional_Object129; // 0x410(0x08)
	struct UStaticMeshComponent* SM_Ancient1_addictional_Object134; // 0x418(0x08)
	struct UStaticMeshComponent* SM_Ancient1_addictional_Object131; // 0x420(0x08)
	struct UStaticMeshComponent* SM_Ancient1_addictional_Object130; // 0x428(0x08)
	struct ULootableSkeletonComponent_C* LootableSkeletonComponent5; // 0x430(0x08)
	struct ULootableSkeletonComponent_C* LootableSkeletonComponent4; // 0x438(0x08)
	struct ULootableBreakableWoodenBoxComponent_C* LootableBreakableWoodenBoxComponent5; // 0x440(0x08)
	struct ULootableAttackableUrnComponent_C* LootableAttackableUrnComponent6; // 0x448(0x08)
	struct ULootableBreakableWoodenBoxComponent_C* LootableBreakableWoodenBoxComponent4; // 0x450(0x08)
	struct ULootableAttackableUrnComponent_C* LootableAttackableUrnComponent5; // 0x458(0x08)
	struct ULootableAttackableUrnComponent_C* LootableAttackableUrnComponent4; // 0x460(0x08)
	struct ULootableBreakableWoodenBoxComponent_C* LootableBreakableWoodenBoxComponent3; // 0x468(0x08)
	struct ULootableSiegeCrateComponent_C* LootableSiegeCrateComponent; // 0x470(0x08)
	struct ULootableSkeletonComponent_C* LootableSkeletonComponent3; // 0x478(0x08)
	struct ULootableBreakableWoodenBoxComponent_C* LootableBreakableWoodenBoxComponent2; // 0x480(0x08)
	struct ULootableSkeletonComponent_C* LootableSkeletonComponent2; // 0x488(0x08)
	struct ULootableAttackableUrnComponent_C* LootableAttackableUrnComponent3; // 0x490(0x08)
	struct ULootableSkeletonComponent_C* LootableSkeletonComponent1; // 0x498(0x08)
	struct ULootableBreakableWoodenBoxComponent_C* LootableBreakableWoodenBoxComponent1; // 0x4a0(0x08)
	struct ULootableAttackableUrnComponent_C* LootableAttackableUrnComponent2; // 0x4a8(0x08)
	struct ULootableBrokenBarrelComponent_C* LootableBrokenBarrelComponent3; // 0x4b0(0x08)
	struct ULootableBrokenBarrelComponent_C* LootableBrokenBarrelComponent2; // 0x4b8(0x08)
	struct ULootableAttackableUrnComponent_C* LootableAttackableUrnComponent1; // 0x4c0(0x08)
	struct ULootableBrokenBarrelComponent_C* LootableBrokenBarrelComponent1; // 0x4c8(0x08)
	struct ULootableSkeletonComponent_C* LootableSkeletonComponent; // 0x4d0(0x08)
	struct ULootableBreakableWoodenBoxComponent_C* LootableBreakableWoodenBoxComponent; // 0x4d8(0x08)
	struct ULootableAttackableUrnComponent_C* LootableAttackableUrnComponent; // 0x4e0(0x08)
	struct ULootableBrokenBarrelComponent_C* LootableBrokenBarrelComponent; // 0x4e8(0x08)
	struct UMistWorldObjectAdjustmentsComponent* MistWorldObjectAdjustments; // 0x4f0(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object119; // 0x4f8(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object123; // 0x500(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object121; // 0x508(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object120; // 0x510(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object116; // 0x518(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object114; // 0x520(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object112; // 0x528(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object043; // 0x530(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object032; // 0x538(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object008; // 0x540(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object006; // 0x548(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object003; // 0x550(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Component_TowerE_WallLg001; // 0x558(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object126; // 0x560(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object122; // 0x568(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object117; // 0x570(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object040; // 0x578(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object035; // 0x580(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object015; // 0x588(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Component_TowerA_BricksM001; // 0x590(0x08)
	struct USceneComponent* AncientStructure01_018; // 0x598(0x08)
	struct USceneComponent* AncientStructure01_017; // 0x5a0(0x08)
	struct USceneComponent* AncientStructure01_016; // 0x5a8(0x08)
	struct USceneComponent* AncientStructure01_014; // 0x5b0(0x08)
	struct USceneComponent* AncientStructure01_013; // 0x5b8(0x08)
	struct USceneComponent* AncientStructure01_012; // 0x5c0(0x08)
	struct USceneComponent* AncientStructure01_011; // 0x5c8(0x08)
	struct USceneComponent* AncientStructure01_010; // 0x5d0(0x08)
	struct USceneComponent* AncientStructure01_09; // 0x5d8(0x08)
	struct USceneComponent* AncientStructure01_08; // 0x5e0(0x08)
	struct USceneComponent* AncientStructure01_07; // 0x5e8(0x08)
	struct USceneComponent* AncientStructure01_06; // 0x5f0(0x08)
	struct USceneComponent* AncientStructure01_05; // 0x5f8(0x08)
	struct USceneComponent* AncientStructure01_04; // 0x600(0x08)
	struct USceneComponent* AncientStructure01_03; // 0x608(0x08)
	struct USceneComponent* AncientStructure01_02; // 0x610(0x08)
	struct USceneComponent* AncientStructure01_01; // 0x618(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object042; // 0x620(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object125; // 0x628(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object041; // 0x630(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object039; // 0x638(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object124; // 0x640(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object007; // 0x648(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object004; // 0x650(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object014; // 0x658(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object012; // 0x660(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object002; // 0x668(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object016; // 0x670(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object001; // 0x678(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object010; // 0x680(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object037; // 0x688(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object038; // 0x690(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object068; // 0x698(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object069; // 0x6a0(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object044; // 0x6a8(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object115; // 0x6b0(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Object113; // 0x6b8(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Inside__Object008; // 0x6c0(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Inside__Object007; // 0x6c8(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Inside__Object006; // 0x6d0(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Inside__Object004; // 0x6d8(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Inside__Object003; // 0x6e0(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Inside__Object002; // 0x6e8(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Inside__Object001; // 0x6f0(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Inside__Plane004; // 0x6f8(0x08)
	struct UStaticMeshComponent* SM_Ancient1_Inside__Object005; // 0x700(0x08)
	struct USceneComponent* ancient; // 0x708(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x710(0x08)
};

