// BlueprintGeneratedClass BallistaSmallWalker_OK.BallistaSmallWalker_OK_C
// Size: 0x4b8 (Inherited: 0x3f0)
struct ABallistaSmallWalker_OK_C : AMistBasePersistentActor {
	struct UMistSkeletalMeshComponent* SK_SmallWalkerBallista_Pedals; // 0x3f0(0x08)
	struct UAudioComponent* TetherTakingDamage; // 0x3f8(0x08)
	struct UMistItemMeshComponent* Missile; // 0x400(0x08)
	struct UAudioComponent* TetherTension; // 0x408(0x08)
	struct UAudioComponent* ReelingSpeed; // 0x410(0x08)
	struct UMistSkeletalMeshComponent* SK_SmallWalkerBallista; // 0x418(0x08)
	struct UBallistaAmmoContainer_C* AmmoContainer; // 0x420(0x08)
	struct UMistCollisionGroupComponent* MistCollisionGroup; // 0x428(0x08)
	struct UStaticMeshComponent* SM_SWalkerBallistaBase; // 0x430(0x08)
	struct UMistInteractableComponent* UseInteractable; // 0x438(0x08)
	struct UBallistaControlComponent_C* BallistaControlComponent; // 0x440(0x08)
	struct UBallistaTetherComponent_C* Tether; // 0x448(0x08)
	struct USceneComponent* Detach; // 0x450(0x08)
	struct USceneComponent* Attach; // 0x458(0x08)
	struct UMistSoundNotifyListenerComponent* MistSoundNotifyListener; // 0x460(0x08)
	struct USpringArmComponent* SpringArm; // 0x468(0x08)
	struct USceneComponent* Yaw; // 0x470(0x08)
	struct UCameraComponent* Camera; // 0x478(0x08)
	struct USceneComponent* Slider; // 0x480(0x08)
	struct USceneComponent* Pitch; // 0x488(0x08)
	struct UStaticMeshComponent* Base; // 0x490(0x08)
	struct UAudioComponent* ProjectilePush; // 0x498(0x08)
	struct UAudioComponent* ProjectilePull; // 0x4a0(0x08)
	struct UAudioComponent* LRMove; // 0x4a8(0x08)
	struct UAudioComponent* UpDownMove; // 0x4b0(0x08)
};

