// BlueprintGeneratedClass BaseBallista.BaseBallista_C
// Size: 0x6e8 (Inherited: 0x5c1)
struct ABaseBallista_C : AStructurePart_C {
	char pad_5C1[0x7]; // 0x5c1(0x07)
	struct UAudioComponent* TetherTakingDamage; // 0x5c8(0x08)
	struct UMistItemMeshComponent* Missile; // 0x5d0(0x08)
	struct UAudioComponent* TetherTension; // 0x5d8(0x08)
	struct UAudioComponent* ReelingSpeed; // 0x5e0(0x08)
	struct UMistSkeletalMeshComponent* SkeletalMesh; // 0x5e8(0x08)
	struct USphereComponent* WalkerCollision; // 0x5f0(0x08)
	struct UIgnitableComponent_C* IgnitableComponent; // 0x5f8(0x08)
	struct USpringArmComponent* SpringArm; // 0x600(0x08)
	struct USceneComponent* Yaw; // 0x608(0x08)
	struct UMistInteractableComponent* UseInteractable; // 0x610(0x08)
	struct UBallistaAmmoContainer_C* AmmoContainer; // 0x618(0x08)
	struct UBallistaControlComponent_C* BallistaControlComponent; // 0x620(0x08)
	struct UBallistaTetherComponent_C* Tether; // 0x628(0x08)
	struct UMistMapIconProviderComponent* MistMapIconProvider; // 0x630(0x08)
	struct UBoxComponent* Placement4; // 0x638(0x08)
	struct UBoxComponent* Placement3; // 0x640(0x08)
	struct UBoxComponent* Placement2; // 0x648(0x08)
	struct UBoxComponent* Placement1; // 0x650(0x08)
	struct UMistSoundNotifyListenerComponent* MistSoundNotifyListener; // 0x658(0x08)
	struct UMistContainerSlotMeshComponent* MistContainerSlotMesh1; // 0x660(0x08)
	struct UMistContainerSlotMeshComponent* MistContainerSlotMesh4; // 0x668(0x08)
	struct UMistContainerSlotMeshComponent* MistContainerSlotMesh3; // 0x670(0x08)
	struct UMistContainerSlotMeshComponent* MistContainerSlotMesh2; // 0x678(0x08)
	struct UMistContainerSlotMeshComponent* MistContainerSlotMesh; // 0x680(0x08)
	struct UStaticMeshComponent* rack; // 0x688(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x690(0x08)
	struct UCameraComponent* Camera; // 0x698(0x08)
	struct USceneComponent* Slider; // 0x6a0(0x08)
	struct USceneComponent* Attach; // 0x6a8(0x08)
	struct USceneComponent* Pitch; // 0x6b0(0x08)
	struct UAudioComponent* ProjectilePush; // 0x6b8(0x08)
	struct UAudioComponent* ProjectilePull; // 0x6c0(0x08)
	struct UAudioComponent* LRMove; // 0x6c8(0x08)
	struct UAudioComponent* UpDownMove; // 0x6d0(0x08)
	bool ReelingOut; // 0x6d8(0x01)
	char pad_6D9[0x7]; // 0x6d9(0x07)
	struct UAudioComponent* StringPull; // 0x6e0(0x08)
};

