// BlueprintGeneratedClass BP_ACS_Final.BP_ACS_Final_C
// Size: 0x1040 (Inherited: 0x3f0)
struct ABP_ACS_Final_C : AMistBasePersistentActor {
	struct UChildActorComponent* FragmentMachine1; // 0x3f0(0x08)
	struct UChildActorComponent* BP_ACS_SplineVine_NorthEast; // 0x3f8(0x08)
	struct UChildActorComponent* BP_ACS_SplineVine_SouthWest; // 0x400(0x08)
	struct UChildActorComponent* BP_ACS_SplineVine_NorthTower; // 0x408(0x08)
	struct UStaticMeshComponent* SM_urn_big_piece_big_top; // 0x410(0x08)
	struct UStaticMeshComponent* SM_ACS_21; // 0x418(0x08)
	struct UStaticMeshComponent* barrel_c_lp1; // 0x420(0x08)
	struct UStaticMeshComponent* SM_crate_2_cover; // 0x428(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_045; // 0x430(0x08)
	struct UStaticMeshComponent* SM_ACS_029_16; // 0x438(0x08)
	struct UStaticMeshComponent* SM_ACS_028_005_01; // 0x440(0x08)
	struct UStaticMeshComponent* SM_ACS_028_002_02; // 0x448(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_027; // 0x450(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_028; // 0x458(0x08)
	struct UStaticMeshComponent* SM_ACS_028_002_01; // 0x460(0x08)
	struct UStaticMeshComponent* SM_ACS_025_04; // 0x468(0x08)
	struct UStaticMeshComponent* SM_ACS_029_15; // 0x470(0x08)
	struct UStaticMeshComponent* SM_ACS_029_14; // 0x478(0x08)
	struct UStaticMeshComponent* SM_ACS_01_01; // 0x480(0x08)
	struct UStaticMeshComponent* SM_ACS_029_13; // 0x488(0x08)
	struct UStaticMeshComponent* SM_ACS_029_12; // 0x490(0x08)
	struct UStaticMeshComponent* SM_ACS_029_11; // 0x498(0x08)
	struct UStaticMeshComponent* SM_ACS_025_03; // 0x4a0(0x08)
	struct UStaticMeshComponent* SM_ACS_025_02; // 0x4a8(0x08)
	struct UStaticMeshComponent* SM_ACS_026_07; // 0x4b0(0x08)
	struct UStaticMeshComponent* SM_AncientCraftingStationMesh_011_01; // 0x4b8(0x08)
	struct UStaticMeshComponent* SM_ACS_029_08; // 0x4c0(0x08)
	struct UStaticMeshComponent* SM_ACS_026_03; // 0x4c8(0x08)
	struct UStaticMeshComponent* SM_ACS_029_09; // 0x4d0(0x08)
	struct UStaticMeshComponent* SM_ACS_029_17; // 0x4d8(0x08)
	struct UStaticMeshComponent* SM_ACS_029_18; // 0x4e0(0x08)
	struct UStaticMeshComponent* SM_ACS_01_04; // 0x4e8(0x08)
	struct UMistHarvestableMeshComponent* SM_Roots_big_04_02_Harv; // 0x4f0(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping13; // 0x4f8(0x08)
	struct UStaticMeshComponent* SM_ACS_026_17; // 0x500(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_061; // 0x508(0x08)
	struct UStaticMeshComponent* SM_ACS_025_01; // 0x510(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping20; // 0x518(0x08)
	struct UMistHarvestableMeshComponent* SM_Roots_big_03_02_Harv; // 0x520(0x08)
	struct UMistHarvestableMeshComponent* SM_Hickory_Pignut_01_Harv; // 0x528(0x08)
	struct UStaticMeshComponent* SM_ACS_026_05; // 0x530(0x08)
	struct UStaticMeshComponent* SM_ACS_026_04; // 0x538(0x08)
	struct UStaticMeshComponent* SM_ACS_17_01; // 0x540(0x08)
	struct UStaticMeshComponent* SM_ACS_026_12; // 0x548(0x08)
	struct UStaticMeshComponent* SM_ACS_026_02; // 0x550(0x08)
	struct UStaticMeshComponent* SM_ACS_026_01; // 0x558(0x08)
	struct UStaticMeshComponent* SM_Roots_medium_02; // 0x560(0x08)
	struct UMistHarvestableMeshComponent* HarvestableRootsLarge; // 0x568(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping7; // 0x570(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping4; // 0x578(0x08)
	struct UStaticMeshComponent* SM_Skeleton_Pile_06; // 0x580(0x08)
	struct UStaticMeshComponent* crate_c; // 0x588(0x08)
	struct UStaticMeshComponent* SM_Skeleton_Pile_05; // 0x590(0x08)
	struct UMistHarvestableMeshComponent* HarvestableMushroomCluster_00_01; // 0x598(0x08)
	struct UMistHarvestableMeshComponent* HarvestableMushroom_00_02; // 0x5a0(0x08)
	struct UMistHarvestableMeshComponent* HarvestableMushroom_00_01; // 0x5a8(0x08)
	struct UStaticMeshComponent* barrel_c_lp; // 0x5b0(0x08)
	struct UStaticMeshComponent* dw_base_01_lp; // 0x5b8(0x08)
	struct UStaticMeshComponent* barrel_k_lp; // 0x5c0(0x08)
	struct UMistHarvestableMeshComponent* HarvestableMushroomCluster_00_02; // 0x5c8(0x08)
	struct UMistHarvestableMeshComponent* SM_Roots_big_04_03_Harv1; // 0x5d0(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_023; // 0x5d8(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_018; // 0x5e0(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_022; // 0x5e8(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_019; // 0x5f0(0x08)
	struct UMistHarvestableMeshComponent* SM_Roots_big_03_01_Harv; // 0x5f8(0x08)
	struct UStaticMeshComponent* SM_ACS_028_002_08; // 0x600(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_025; // 0x608(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_026; // 0x610(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_034; // 0x618(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_025; // 0x620(0x08)
	struct UStaticMeshComponent* SM_ACS_028_002_04; // 0x628(0x08)
	struct UStaticMeshComponent* SM_ACS_028_002_09; // 0x630(0x08)
	struct UStaticMeshComponent* SM_ACS_028_002_011; // 0x638(0x08)
	struct UStaticMeshComponent* SM_ACS_028_002_010; // 0x640(0x08)
	struct UStaticMeshComponent* SM_ACS_028_005_02; // 0x648(0x08)
	struct UStaticMeshComponent* SM_ACS_22; // 0x650(0x08)
	struct UStaticMeshComponent* SM_ACS_06; // 0x658(0x08)
	struct UStaticMeshComponent* SM_ACS_028_02; // 0x660(0x08)
	struct UStaticMeshComponent* SM_ACS_028_005_03; // 0x668(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_024; // 0x670(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_020; // 0x678(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_017; // 0x680(0x08)
	struct UStaticMeshComponent* SM_ACS_026_06; // 0x688(0x08)
	struct UStaticMeshComponent* SM_ACS_029_03; // 0x690(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_023; // 0x698(0x08)
	struct UStaticMeshComponent* SM_ACS_16_01; // 0x6a0(0x08)
	struct UStaticMeshComponent* SM_ACS_20_01; // 0x6a8(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping39; // 0x6b0(0x08)
	struct UStaticMeshComponent* SM_ACS_028_005_13; // 0x6b8(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping9; // 0x6c0(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping23; // 0x6c8(0x08)
	struct UStaticMeshComponent* SM_ACS_019_01; // 0x6d0(0x08)
	struct UStaticMeshComponent* SM_ACS_16_03; // 0x6d8(0x08)
	struct UMistHarvestableMeshComponent* SM_Fol_TreeB_3_01_Harv; // 0x6e0(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping5; // 0x6e8(0x08)
	struct UStaticMeshComponent* SM_ACS_026_15; // 0x6f0(0x08)
	struct UStaticMeshComponent* SM_ACS_23_02; // 0x6f8(0x08)
	struct UStaticMeshComponent* SM_ACS_Stairs_01; // 0x700(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_026; // 0x708(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_024; // 0x710(0x08)
	struct UStaticMeshComponent* SM_ACS_22_01; // 0x718(0x08)
	struct UStaticMeshComponent* SM_ACS_24_01; // 0x720(0x08)
	struct UStaticMeshComponent* SM_ACS_03_02; // 0x728(0x08)
	struct UStaticMeshComponent* SM_ACS_018_03; // 0x730(0x08)
	struct UStaticMeshComponent* SM_ACS_16_02; // 0x738(0x08)
	struct UMistHarvestableMeshComponent* SM_Roots_big_04_03_Harv; // 0x740(0x08)
	struct UStaticMeshComponent* SM_ACS_028_001_03; // 0x748(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_032; // 0x750(0x08)
	struct UStaticMeshComponent* SM_ACS_029_07; // 0x758(0x08)
	struct UStaticMeshComponent* SM_ACS_029_04; // 0x760(0x08)
	struct UStaticMeshComponent* SM_ACS_029_05; // 0x768(0x08)
	struct UStaticMeshComponent* SM_ACS_029_06; // 0x770(0x08)
	struct UStaticMeshComponent* SM_ACS_028_001_02; // 0x778(0x08)
	struct UStaticMeshComponent* SM_ACS_029_02; // 0x780(0x08)
	struct UStaticMeshComponent* SM_ACS_029_01; // 0x788(0x08)
	struct UStaticMeshComponent* SM_ACS_026_16; // 0x790(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_015; // 0x798(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_060; // 0x7a0(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_059; // 0x7a8(0x08)
	struct UStaticMeshComponent* SM_ACS_026_08; // 0x7b0(0x08)
	struct UStaticMeshComponent* SM_ACS_026_18; // 0x7b8(0x08)
	struct UStaticMeshComponent* SM_ACS_028_002_07; // 0x7c0(0x08)
	struct UStaticMeshComponent* SM_ACS_026_19; // 0x7c8(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping24; // 0x7d0(0x08)
	struct UStaticMeshComponent* SM_ACS_028_003_01; // 0x7d8(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping31; // 0x7e0(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping32; // 0x7e8(0x08)
	struct UStaticMeshComponent* SM_ACS_025_08; // 0x7f0(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping33; // 0x7f8(0x08)
	struct UStaticMeshComponent* SM_ACS_Stairs_03; // 0x800(0x08)
	struct UStaticMeshComponent* SM_ACS_026_21; // 0x808(0x08)
	struct UStaticMeshComponent* SM_ACS_02; // 0x810(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping55; // 0x818(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_016; // 0x820(0x08)
	struct UStaticMeshComponent* SM_ForestC_OldWood11_04; // 0x828(0x08)
	struct UStaticMeshComponent* SM_ACS_24_03; // 0x830(0x08)
	struct UStaticMeshComponent* SM_ACS_019_04; // 0x838(0x08)
	struct UStaticMeshComponent* SM_ACS_22_03; // 0x840(0x08)
	struct UStaticMeshComponent* SM_ACS_025_11; // 0x848(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping21; // 0x850(0x08)
	struct UStaticMeshComponent* SM_ACS_16_07; // 0x858(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_031; // 0x860(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping25; // 0x868(0x08)
	struct UStaticMeshComponent* SM_ACS_16_06; // 0x870(0x08)
	struct UStaticMeshComponent* SM_ACS_24_02; // 0x878(0x08)
	struct UStaticMeshComponent* SM_ACS_04; // 0x880(0x08)
	struct UStaticMeshComponent* SM_ACS_03_03; // 0x888(0x08)
	struct UStaticMeshComponent* SM_ACS_018_02; // 0x890(0x08)
	struct UStaticMeshComponent* SM_ACS_16_05; // 0x898(0x08)
	struct UStaticMeshComponent* SM_ACS_16_04; // 0x8a0(0x08)
	struct UStaticMeshComponent* SM_ForestC_OldWood11_03; // 0x8a8(0x08)
	struct UStaticMeshComponent* SM_ACS_025_07; // 0x8b0(0x08)
	struct UStaticMeshComponent* SM_ACS_028_001_01; // 0x8b8(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_051; // 0x8c0(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_029; // 0x8c8(0x08)
	struct UStaticMeshComponent* SM_ACS_007_15; // 0x8d0(0x08)
	struct UStaticMeshComponent* SM_ACS_007_11; // 0x8d8(0x08)
	struct UStaticMeshComponent* SM_ACS_028_001_05; // 0x8e0(0x08)
	struct UStaticMeshComponent* SM_ACS_028_001_04; // 0x8e8(0x08)
	struct UStaticMeshComponent* SM_ACS_028_001_06; // 0x8f0(0x08)
	struct UStaticMeshComponent* SM_ACS_025_12; // 0x8f8(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_010; // 0x900(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping45; // 0x908(0x08)
	struct UStaticMeshComponent* SM_ACS_025_13; // 0x910(0x08)
	struct UStaticMeshComponent* SM_ACS_16_08; // 0x918(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_011; // 0x920(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping51; // 0x928(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_012; // 0x930(0x08)
	struct UStaticMeshComponent* SM_ACS_007_13; // 0x938(0x08)
	struct UStaticMeshComponent* SM_ACS_23_01; // 0x940(0x08)
	struct UStaticMeshComponent* SM_ACS_010_06; // 0x948(0x08)
	struct UStaticMeshComponent* SM_ACS_028_002_06; // 0x950(0x08)
	struct UStaticMeshComponent* SM_ACS_026_11; // 0x958(0x08)
	struct UStaticMeshComponent* SM_ACS_026_20; // 0x960(0x08)
	struct UStaticMeshComponent* SM_ACS_028_002_05; // 0x968(0x08)
	struct UStaticMeshComponent* SM_Dead_Tree_01_LOD0_02; // 0x970(0x08)
	struct UStaticMeshComponent* SM_ACS_03_01; // 0x978(0x08)
	struct UStaticMeshComponent* SM_DryRock_011; // 0x980(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_034; // 0x988(0x08)
	struct UStaticMeshComponent* SM_ACS_007_12; // 0x990(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_08; // 0x998(0x08)
	struct UStaticMeshComponent* SM_ACS_16_11; // 0x9a0(0x08)
	struct UStaticMeshComponent* SM_ACS_22_05; // 0x9a8(0x08)
	struct UStaticMeshComponent* SM_ACS_16_09; // 0x9b0(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping11; // 0x9b8(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_033; // 0x9c0(0x08)
	struct UStaticMeshComponent* SM_ACS_019_05; // 0x9c8(0x08)
	struct UStaticMeshComponent* SM_ACS_018_05; // 0x9d0(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping2; // 0x9d8(0x08)
	struct UStaticMeshComponent* SM_ACS_026_09; // 0x9e0(0x08)
	struct UStaticMeshComponent* SM_ForestC_OldWood10_02; // 0x9e8(0x08)
	struct UStaticMeshComponent* SM_ACS_025_09; // 0x9f0(0x08)
	struct UStaticMeshComponent* SM_ACS_026_23; // 0x9f8(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_055; // 0xa00(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping3; // 0xa08(0x08)
	struct UStaticMeshComponent* SM_ACS_03; // 0xa10(0x08)
	struct UStaticMeshComponent* SM_ACS_22_04; // 0xa18(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping6; // 0xa20(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping52; // 0xa28(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_014; // 0xa30(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_013; // 0xa38(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_053; // 0xa40(0x08)
	struct UStaticMeshComponent* SM_ACS_24_06; // 0xa48(0x08)
	struct UStaticMeshComponent* SM_ACS_019_03; // 0xa50(0x08)
	struct UStaticMeshComponent* SM_ACS_01; // 0xa58(0x08)
	struct UStaticMeshComponent* SM_ForestC_OldWood11_05; // 0xa60(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_054; // 0xa68(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_040; // 0xa70(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping41; // 0xa78(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_036; // 0xa80(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_047; // 0xa88(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_048; // 0xa90(0x08)
	struct UStaticMeshComponent* SM_ACS_028_005_05; // 0xa98(0x08)
	struct UStaticMeshComponent* SM_ACS_028_005_04; // 0xaa0(0x08)
	struct UStaticMeshComponent* SM_ACS_Stairs_02; // 0xaa8(0x08)
	struct UStaticMeshComponent* SM_ACS_028_005_06; // 0xab0(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping42; // 0xab8(0x08)
	struct UStaticMeshComponent* SM_ACS_026_22; // 0xac0(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping43; // 0xac8(0x08)
	struct UStaticMeshComponent* SM_ACS_007_08; // 0xad0(0x08)
	struct UStaticMeshComponent* SM_ACS_010_04; // 0xad8(0x08)
	struct UStaticMeshComponent* SM_ACS_016_12; // 0xae0(0x08)
	struct UStaticMeshComponent* SM_ACS_03_04; // 0xae8(0x08)
	struct UStaticMeshComponent* SM_ACS_16_13; // 0xaf0(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_08; // 0xaf8(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_07; // 0xb00(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping49; // 0xb08(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping10; // 0xb10(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_035; // 0xb18(0x08)
	struct UStaticMeshComponent* SM_ACS_22_06; // 0xb20(0x08)
	struct UStaticMeshComponent* SM_ACS_24_05; // 0xb28(0x08)
	struct UStaticMeshComponent* SM_ACS_028_003_02; // 0xb30(0x08)
	struct UStaticMeshComponent* SM_ACS_16_14; // 0xb38(0x08)
	struct UStaticMeshComponent* SM_ACS_025_05; // 0xb40(0x08)
	struct UStaticMeshComponent* SM_ACS_24_04; // 0xb48(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_09; // 0xb50(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping50; // 0xb58(0x08)
	struct UStaticMeshComponent* SM_ACS_007_14; // 0xb60(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_06; // 0xb68(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_05; // 0xb70(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping47; // 0xb78(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_04; // 0xb80(0x08)
	struct UStaticMeshComponent* SM_ForestC_OldWood11_02; // 0xb88(0x08)
	struct UStaticMeshComponent* SM_ACS_22_07; // 0xb90(0x08)
	struct UStaticMeshComponent* SM_ACS_018_04; // 0xb98(0x08)
	struct UStaticMeshComponent* SM_ACS_026_13; // 0xba0(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping8; // 0xba8(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping40; // 0xbb0(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_037; // 0xbb8(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping14; // 0xbc0(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_03; // 0xbc8(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_030; // 0xbd0(0x08)
	struct UStaticMeshComponent* SM_ACS_019_02; // 0xbd8(0x08)
	struct UStaticMeshComponent* SM_ACS_01_02; // 0xbe0(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_010; // 0xbe8(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_041; // 0xbf0(0x08)
	struct UStaticMeshComponent* SM_ACS_028_002_03; // 0xbf8(0x08)
	struct UStaticMeshComponent* SM_ACS_028_005_09; // 0xc00(0x08)
	struct UStaticMeshComponent* SM_ACS_028_005_08; // 0xc08(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_031; // 0xc10(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_01; // 0xc18(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping1; // 0xc20(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_02; // 0xc28(0x08)
	struct UStaticMeshComponent* SM_ACS_010_08; // 0xc30(0x08)
	struct USceneComponent* BlockS_AdjustToGround; // 0xc38(0x08)
	struct USceneComponent* BlockN_AdjustToGround; // 0xc40(0x08)
	struct USceneComponent* BlockSW_AdjustToGround; // 0xc48(0x08)
	struct USceneComponent* BlockNW_AdjustToGround; // 0xc50(0x08)
	struct USceneComponent* BlockSE_AdjustToGround; // 0xc58(0x08)
	struct USceneComponent* BlockNE_AdjustToGround; // 0xc60(0x08)
	struct UChildActorComponent* BP_ACS_SplineVine_WesternGate; // 0xc68(0x08)
	struct UStaticMeshComponent* SM_ACS_06_03; // 0xc70(0x08)
	struct UStaticMeshComponent* SM_ACS_04_06; // 0xc78(0x08)
	struct UStaticMeshComponent* SM_ACS_04_05; // 0xc80(0x08)
	struct UStaticMeshComponent* SM_ACS_010_02; // 0xc88(0x08)
	struct UMistHarvestableMeshComponent* SM_Fol_TreeB_01_Harv; // 0xc90(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_019; // 0xc98(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_018; // 0xca0(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_020; // 0xca8(0x08)
	struct UMistHarvestableMeshComponent* SM_Roots_big_02_01_Harv; // 0xcb0(0x08)
	struct UMistHarvestableMeshComponent* SM_Roots_big_02_02_Harv; // 0xcb8(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_050; // 0xcc0(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_049; // 0xcc8(0x08)
	struct UStaticMeshComponent* SM_ACS_012_02; // 0xcd0(0x08)
	struct UStaticMeshComponent* SM_ACS_014_02; // 0xcd8(0x08)
	struct UStaticMeshComponent* SM_ACS_04_04; // 0xce0(0x08)
	struct UStaticMeshComponent* SM_ACS_007_16; // 0xce8(0x08)
	struct UStaticMeshComponent* SM_ACS_04_03; // 0xcf0(0x08)
	struct UMistHarvestableMeshComponent* SM_Roots_big_04_01_Harv; // 0xcf8(0x08)
	struct UStaticMeshComponent* SM_ACS_013_02; // 0xd00(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_021; // 0xd08(0x08)
	struct UMistHarvestableMeshComponent* SM_Roots_big_04_04_Harv; // 0xd10(0x08)
	struct UStaticMeshComponent* SM_ACS_015_02; // 0xd18(0x08)
	struct UStaticMeshComponent* SM_ACS_04_07; // 0xd20(0x08)
	struct UChildActorComponent* BP_ACS_SplineVine_EasternGate; // 0xd28(0x08)
	struct UStaticMeshComponent* SM_ACS_06_01; // 0xd30(0x08)
	struct UStaticMeshComponent* SM_ACS_012_01; // 0xd38(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping26; // 0xd40(0x08)
	struct UStaticMeshComponent* SM_ACS_04_02; // 0xd48(0x08)
	struct UStaticMeshComponent* SM_ACS_007_01; // 0xd50(0x08)
	struct UStaticMeshComponent* SM_ACS_010_01; // 0xd58(0x08)
	struct UStaticMeshComponent* SM_ACS_06_04; // 0xd60(0x08)
	struct UStaticMeshComponent* SM_ACS_05_01; // 0xd68(0x08)
	struct UStaticMeshComponent* SM_ACS_06_02; // 0xd70(0x08)
	struct UStaticMeshComponent* SM_ACS_04_01; // 0xd78(0x08)
	struct UStaticMeshComponent* SM_ACS_010_03; // 0xd80(0x08)
	struct UMistHarvestableMeshComponent* SM_Roots_big_04_05_Harv; // 0xd88(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_073; // 0xd90(0x08)
	struct UStaticMeshComponent* SM_ACS_007_02; // 0xd98(0x08)
	struct UStaticMeshComponent* SM_ACS_05_02; // 0xda0(0x08)
	struct UStaticMeshComponent* SM_ACS_014_01; // 0xda8(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_070; // 0xdb0(0x08)
	struct UStaticMeshComponent* SM_ACS_007_03; // 0xdb8(0x08)
	struct UStaticMeshComponent* SM_ACS_010_05; // 0xdc0(0x08)
	struct UStaticMeshComponent* SM_ACS_015_01; // 0xdc8(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_071; // 0xdd0(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_072; // 0xdd8(0x08)
	struct UStaticMeshComponent* SM_ACS_013_01; // 0xde0(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_029; // 0xde8(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping34; // 0xdf0(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_030; // 0xdf8(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_038; // 0xe00(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_033; // 0xe08(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_064; // 0xe10(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_074; // 0xe18(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_063; // 0xe20(0x08)
	struct UStaticMeshComponent* SM_ACS_010_08_AdjustToGround; // 0xe28(0x08)
	struct UStaticMeshComponent* SM_ACS_007_07_AdjustToGround; // 0xe30(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping36_AdjustToGround; // 0xe38(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping18_AdjustToGround; // 0xe40(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_043_AdjustToGround; // 0xe48(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_038_AdjustToGround; // 0xe50(0x08)
	struct USceneComponent* EasternGateScene_AdjustToGround; // 0xe58(0x08)
	struct USceneComponent* WesternGateScene_AdjustToGround; // 0xe60(0x08)
	struct UStaticMeshComponent* SM_ACS_028_002; // 0xe68(0x08)
	struct UStaticMeshComponent* SM_ACS_028_001; // 0xe70(0x08)
	struct UStaticMeshComponent* SM_ACS_22_02; // 0xe78(0x08)
	struct USceneComponent* SecretEntrancePillarScene_AdjustToGround; // 0xe80(0x08)
	struct UMistHarvestableMeshComponent* SM_Fol_TreeB_3_03_Harv_AdjustToGround; // 0xe88(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping23_AdjustToGround; // 0xe90(0x08)
	struct UStaticMeshComponent* GroundLevel; // 0xe98(0x08)
	struct UBoxComponent* ForbidBuilding; // 0xea0(0x08)
	struct UMistMapIconProviderComponent* MistMapIconProvider; // 0xea8(0x08)
	struct UAudioComponent* UndergroundMachinery; // 0xeb0(0x08)
	struct UBoxComponent* ReverbTrigger; // 0xeb8(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_017; // 0xec0(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_042_AdjustToGround; // 0xec8(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_041_AdjustToGround; // 0xed0(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_040_AdjustToGround; // 0xed8(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_039_AdjustToGround; // 0xee0(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_037_AdjustToGround; // 0xee8(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_036_AdjustToGround; // 0xef0(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_044_AdjustToGround; // 0xef8(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_045_AdjustToGround; // 0xf00(0x08)
	struct UMistHarvestableMeshComponent* SM_Roots_big_04_06_Harv; // 0xf08(0x08)
	struct UMistHarvestableMeshComponent* SM_Roots_big_02_04_Harv; // 0xf10(0x08)
	struct UMistHarvestableMeshComponent* SM_Roots_big_02_03_Harv; // 0xf18(0x08)
	struct UStaticMeshComponent* SM_ACS_01_03_AdjustToGround; // 0xf20(0x08)
	struct UStaticMeshComponent* SM_Roots_big_013; // 0xf28(0x08)
	struct UStaticMeshComponent* SM_ACS_010_07; // 0xf30(0x08)
	struct UStaticMeshComponent* SM_ACS_007_06_AdjustToGround; // 0xf38(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping38_AdjustToGround; // 0xf40(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping4_AdjustToGround; // 0xf48(0x08)
	struct UStaticMeshComponent* SM_ForestC_OldWood11_01; // 0xf50(0x08)
	struct UStaticMeshComponent* SM_Dead_Tree_01_LOD0_01_AdjustToGround; // 0xf58(0x08)
	struct UStaticMeshComponent* SM_ACS_028_005_11; // 0xf60(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_06; // 0xf68(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_05; // 0xf70(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_03; // 0xf78(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_04; // 0xf80(0x08)
	struct UMistWorldObjectAdjustmentsComponent* MistWorldObjectAdjustments; // 0xf88(0x08)
	struct UStaticMeshComponent* SM_ACS_20_03_AdjustToGround; // 0xf90(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_069; // 0xf98(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_068; // 0xfa0(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_067; // 0xfa8(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_066; // 0xfb0(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_065; // 0xfb8(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_062; // 0xfc0(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_052; // 0xfc8(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_046; // 0xfd0(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_044; // 0xfd8(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_035; // 0xfe0(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_022; // 0xfe8(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping37_AdjustToGround; // 0xff0(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping22_AdjustToGround; // 0xff8(0x08)
	struct UStaticMeshComponent* SM_ACS_20_02_AdjustToGround; // 0x1000(0x08)
	struct UStaticMeshComponent* SM_ACS_17_02_AdjustToGround; // 0x1008(0x08)
	struct UStaticMeshComponent* SM_ACS_026_13_AdjustToGround; // 0x1010(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping16_AdjustToGround; // 0x1018(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping15_AdjustToGround; // 0x1020(0x08)
	struct UStaticMeshComponent* SM_AncientSiteRubbleGrouping7_AdjustToGround; // 0x1028(0x08)
	struct USceneComponent* Scene_AdjustToGround; // 0x1030(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x1038(0x08)
};

