// BlueprintGeneratedClass BP_ACS_SplineVine_NorthTower.BP_ACS_SplineVine_NorthTower_C
// Size: 0x440 (Inherited: 0x3c0)
struct ABP_ACS_SplineVine_NorthTower_C : AActor {
	struct USplineComponent* NODE_AddSplineComponent-0_48; // 0x3c0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* NODE_AddHierarchicalInstancedStaticMeshComponent-0_29; // 0x3c8(0x08)
	struct USplineMeshComponent* NODE_AddSplineMeshComponent-0_49; // 0x3d0(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* NODE_AddHierarchicalInstancedStaticMeshComponent-1_22; // 0x3d8(0x08)
	struct USplineMeshComponent* NODE_AddSplineMeshComponent-0_48; // 0x3e0(0x08)
	struct UTextRenderComponent* TextRender17; // 0x3e8(0x08)
	struct UTextRenderComponent* TextRender18; // 0x3f0(0x08)
	struct USplineComponent* NODE_AddSplineComponent-0_49; // 0x3f8(0x08)
	struct USplineComponent* NODE_AddSplineComponent-0_47; // 0x400(0x08)
	struct USplineMeshComponent* NODE_AddSplineMeshComponent-0_47; // 0x408(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* NODE_AddHierarchicalInstancedStaticMeshComponent-0_28; // 0x410(0x08)
	struct USplineComponent* NODE_AddSplineComponent-0_46; // 0x418(0x08)
	struct USplineMeshComponent* NODE_AddSplineMeshComponent-0_46; // 0x420(0x08)
	struct UTextRenderComponent* TextRender16; // 0x428(0x08)
	struct UTextRenderComponent* TextRender15; // 0x430(0x08)
	struct USceneComponent* SharedRoot; // 0x438(0x08)
};

