// BlueprintGeneratedClass BP_ACS_SplineVine_EasternGate.BP_ACS_SplineVine_EasternGate_C
// Size: 0x438 (Inherited: 0x3c0)
struct ABP_ACS_SplineVine_EasternGate_C : AActor {
	struct UTextRenderComponent* TextRender12; // 0x3c0(0x08)
	struct UTextRenderComponent* TextRender11; // 0x3c8(0x08)
	struct UTextRenderComponent* TextRender10; // 0x3d0(0x08)
	struct UTextRenderComponent* TextRender9; // 0x3d8(0x08)
	struct UTextRenderComponent* TextRender8; // 0x3e0(0x08)
	struct USplineMeshComponent* NODE_AddSplineMeshComponent-0_91; // 0x3e8(0x08)
	struct USplineMeshComponent* NODE_AddSplineMeshComponent-0_90; // 0x3f0(0x08)
	struct USplineComponent* NODE_AddSplineComponent-0_88; // 0x3f8(0x08)
	struct USplineMeshComponent* NODE_AddSplineMeshComponent-0_89; // 0x400(0x08)
	struct USplineMeshComponent* NODE_AddSplineMeshComponent-0_88; // 0x408(0x08)
	struct USplineComponent* NODE_AddSplineComponent-0_91; // 0x410(0x08)
	struct USplineComponent* NODE_AddSplineComponent-0_90; // 0x418(0x08)
	struct USplineComponent* NODE_AddSplineComponent-0_89; // 0x420(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* NODE_AddHierarchicalInstancedStaticMeshComponent-0_26; // 0x428(0x08)
	struct USceneComponent* SharedRoot; // 0x430(0x08)
};

