// BlueprintGeneratedClass BP_ACS_SplineVine_SouthWest.BP_ACS_SplineVine_SouthWest_C
// Size: 0x408 (Inherited: 0x3c0)
struct ABP_ACS_SplineVine_SouthWest_C : AActor {
	struct UHierarchicalInstancedStaticMeshComponent* NODE_AddHierarchicalInstancedStaticMeshComponent-0_30; // 0x3c0(0x08)
	struct USplineComponent* NODE_AddSplineComponent-0_50; // 0x3c8(0x08)
	struct USplineMeshComponent* NODE_AddSplineMeshComponent-0_50; // 0x3d0(0x08)
	struct UTextRenderComponent* TextRender21; // 0x3d8(0x08)
	struct UTextRenderComponent* TextRender20; // 0x3e0(0x08)
	struct UTextRenderComponent* TextRender19; // 0x3e8(0x08)
	struct USplineComponent* NODE_AddSplineComponent-0_51; // 0x3f0(0x08)
	struct USplineMeshComponent* NODE_AddSplineMeshComponent-0_51; // 0x3f8(0x08)
	struct USceneComponent* SharedRoot; // 0x400(0x08)
};

