// BlueprintGeneratedClass BP_ACS_SplineVine_WesternGate.BP_ACS_SplineVine_WesternGate_C
// Size: 0x4b0 (Inherited: 0x3c0)
struct ABP_ACS_SplineVine_WesternGate_C : AActor {
	struct UTextRenderComponent* TextRender6; // 0x3c0(0x08)
	struct USplineComponent* NODE_AddSplineComponent-0_22; // 0x3c8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* NODE_AddHierarchicalInstancedStaticMeshComponent-0_25; // 0x3d0(0x08)
	struct USplineMeshComponent* NODE_AddSplineMeshComponent-0_22; // 0x3d8(0x08)
	struct UTextRenderComponent* TextRender5; // 0x3e0(0x08)
	struct USplineMeshComponent* NODE_AddSplineMeshComponent-0_44; // 0x3e8(0x08)
	struct USplineComponent* NODE_AddSplineComponent-0_44; // 0x3f0(0x08)
	struct USplineMeshComponent* NODE_AddSplineMeshComponent-0_45; // 0x3f8(0x08)
	struct USplineComponent* NODE_AddSplineComponent-0_45; // 0x400(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* NODE_AddHierarchicalInstancedStaticMeshComponent-0_24; // 0x408(0x08)
	struct UTextRenderComponent* TextRender4; // 0x410(0x08)
	struct USplineMeshComponent* NODE_AddSplineMeshComponent-0_71; // 0x418(0x08)
	struct USplineComponent* NODE_AddSplineComponent-0_71; // 0x420(0x08)
	struct USplineComponent* NODE_AddSplineComponent-0_70; // 0x428(0x08)
	struct USplineComponent* NODE_AddSplineComponent-0_69; // 0x430(0x08)
	struct USplineMeshComponent* NODE_AddSplineMeshComponent-0_69; // 0x438(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* NODE_AddHierarchicalInstancedStaticMeshComponent-0_23; // 0x440(0x08)
	struct USplineMeshComponent* NODE_AddSplineMeshComponent-0_70; // 0x448(0x08)
	struct UTextRenderComponent* TextRender3; // 0x450(0x08)
	struct UTextRenderComponent* TextRender2; // 0x458(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* NODE_AddHierarchicalInstancedStaticMeshComponent-0_22; // 0x460(0x08)
	struct USplineMeshComponent* NODE_AddSplineMeshComponent-0_68; // 0x468(0x08)
	struct USplineComponent* NODE_AddSplineComponent-0_66; // 0x470(0x08)
	struct USplineMeshComponent* NODE_AddSplineMeshComponent-0_66; // 0x478(0x08)
	struct USplineComponent* NODE_AddSplineComponent-0_68; // 0x480(0x08)
	struct USplineComponent* NODE_AddSplineComponent-0_67; // 0x488(0x08)
	struct USplineMeshComponent* NODE_AddSplineMeshComponent-0_67; // 0x490(0x08)
	struct UTextRenderComponent* TextRender1; // 0x498(0x08)
	struct UTextRenderComponent* TextRender7; // 0x4a0(0x08)
	struct USceneComponent* SharedRoot; // 0x4a8(0x08)
};

