// BlueprintGeneratedClass BP_Lootsite_Volcanic_03.BP_Lootsite_Volcanic_03_C
// Size: 0x709 (Inherited: 0x4c0)
struct ABP_Lootsite_Volcanic_03_C : ABaseLootSite_C {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x4c0(0x08)
	struct UStaticMeshComponent* SM_Lootsite_Volcanic_03_Proxy; // 0x4c8(0x08)
	struct UStaticMeshComponent* SM_Lootsite_Volcanic_03_Collision; // 0x4d0(0x08)
	struct UHideComponent_C* HideComponent; // 0x4d8(0x08)
	struct UMistHarvestableMeshComponent* MurphysAgave01_01; // 0x4e0(0x08)
	struct UMistHarvestableMeshComponent* MurphysAgave01_08; // 0x4e8(0x08)
	struct UMistHarvestableMeshComponent* MurphysAgave01_07; // 0x4f0(0x08)
	struct UMistHarvestableMeshComponent* MurphysAgave01_06; // 0x4f8(0x08)
	struct UMistHarvestableMeshComponent* MurphysAgave01_05; // 0x500(0x08)
	struct UMistHarvestableMeshComponent* MurphysAgave01_04; // 0x508(0x08)
	struct UMistHarvestableMeshComponent* MurphysAgave01_03; // 0x510(0x08)
	struct UMistHarvestableMeshComponent* MurphysAgave01_02; // 0x518(0x08)
	struct UStaticMeshComponent* SM_Skeleton_Pile_01_01; // 0x520(0x08)
	struct UStaticMeshComponent* SM_Skeleton_Pile_01_02; // 0x528(0x08)
	struct UMistHarvestableMeshComponent* Mushroom_09; // 0x530(0x08)
	struct UMistHarvestableMeshComponent* Mushroom_08; // 0x538(0x08)
	struct UMistHarvestableMeshComponent* Mushroom_07; // 0x540(0x08)
	struct UMistHarvestableMeshComponent* Mushroom_06; // 0x548(0x08)
	struct UMistHarvestableMeshComponent* Mushroom_05; // 0x550(0x08)
	struct UStaticMeshComponent* stick_c_Test; // 0x558(0x08)
	struct UStaticMeshComponent* SM_LootModular_08_04; // 0x560(0x08)
	struct UStaticMeshComponent* stick_c_Test13; // 0x568(0x08)
	struct UStaticMeshComponent* stick_c_Test12; // 0x570(0x08)
	struct UStaticMeshComponent* stick_c_Test11; // 0x578(0x08)
	struct UStaticMeshComponent* stick_c_Test10; // 0x580(0x08)
	struct UStaticMeshComponent* stick_c_Test1; // 0x588(0x08)
	struct UStaticMeshComponent* stick_c_Test8; // 0x590(0x08)
	struct UStaticMeshComponent* stick_c_Test7; // 0x598(0x08)
	struct UStaticMeshComponent* stick_c_Test6; // 0x5a0(0x08)
	struct UStaticMeshComponent* stick_c_Test5; // 0x5a8(0x08)
	struct UStaticMeshComponent* stick_c_Test4; // 0x5b0(0x08)
	struct UStaticMeshComponent* stick_c_Test2; // 0x5b8(0x08)
	struct UStaticMeshComponent* stick_c_Test9; // 0x5c0(0x08)
	struct UStaticMeshComponent* SM_LootModular_08_03; // 0x5c8(0x08)
	struct UStaticMeshComponent* SM_LootModular_08_02; // 0x5d0(0x08)
	struct UStaticMeshComponent* SM_LootModular_08_01; // 0x5d8(0x08)
	struct UStaticMeshComponent* SM_Skeleton_Pile_05_04; // 0x5e0(0x08)
	struct UStaticMeshComponent* SM_Skeleton_Pile_05_05; // 0x5e8(0x08)
	struct UMistHarvestableMeshComponent* Mushroom_04; // 0x5f0(0x08)
	struct UMistHarvestableMeshComponent* Mushroom_03; // 0x5f8(0x08)
	struct UMistHarvestableMeshComponent* Mushroom_02; // 0x600(0x08)
	struct UMistHarvestableMeshComponent* Mushroom_01; // 0x608(0x08)
	struct UMistHarvestableMeshComponent* SM_DryRock_02_03; // 0x610(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_05_013; // 0x618(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_05_014; // 0x620(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_05_012; // 0x628(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_05_011; // 0x630(0x08)
	struct UStaticMeshComponent* SM_Skeleton_Pile_05_03; // 0x638(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_05_010; // 0x640(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_05_09; // 0x648(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_05_08; // 0x650(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_05_07; // 0x658(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_05_06; // 0x660(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_05_05; // 0x668(0x08)
	struct UStaticMeshComponent* SM_Roots_big_03_03; // 0x670(0x08)
	struct UStaticMeshComponent* SM_Roots_big_03_02; // 0x678(0x08)
	struct UStaticMeshComponent* SM_Roots_big_03_01; // 0x680(0x08)
	struct ULootableSkeletonComponent_C* LootableSkeletonComponent1; // 0x688(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_05_04; // 0x690(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_05_03; // 0x698(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_05_02; // 0x6a0(0x08)
	struct UStaticMeshComponent* stick_c_01; // 0x6a8(0x08)
	struct UStaticMeshComponent* SM_Skeleton_Pile_05_01; // 0x6b0(0x08)
	struct ULootableBrokenBarrelComponent_C* LootableBrokenBarrelComponent; // 0x6b8(0x08)
	struct ULootableSkeletonComponent_C* LootableSkeletonComponent; // 0x6c0(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_05_01; // 0x6c8(0x08)
	struct UMistWorldObjectAdjustmentsComponent* MistWorldObjectAdjustments; // 0x6d0(0x08)
	struct UStaticMeshComponent* SM_DryRock_17_01; // 0x6d8(0x08)
	struct USceneComponent* Scene; // 0x6e0(0x08)
	float TimelineDissolve_Dissolve_7E84980C4A352A0ABD3BEBBB46B95620; // 0x6e8(0x04)
	enum class ETimelineDirection TimelineDissolve__Direction_7E84980C4A352A0ABD3BEBBB46B95620; // 0x6ec(0x01)
	char pad_6ED[0x3]; // 0x6ed(0x03)
	struct UTimelineComponent* TimelineDissolve; // 0x6f0(0x08)
	struct UMaterialInstanceDynamic* DMI; // 0x6f8(0x08)
	struct UStaticMeshComponent* RockVisualMesh; // 0x700(0x08)
	bool bDestroyed; // 0x708(0x01)

	void UserConstructionScript(); // Function BP_Lootsite_Volcanic_03.BP_Lootsite_Volcanic_03_C.UserConstructionScript // (Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void TimelineDissolve__FinishedFunc(); // Function BP_Lootsite_Volcanic_03.BP_Lootsite_Volcanic_03_C.TimelineDissolve__FinishedFunc // (BlueprintEvent) // @ game+0x163f1c0
	void TimelineDissolve__UpdateFunc(); // Function BP_Lootsite_Volcanic_03.BP_Lootsite_Volcanic_03_C.TimelineDissolve__UpdateFunc // (BlueprintEvent) // @ game+0x163f1c0
	void TimelineDissolve__Particles__EventFunc(); // Function BP_Lootsite_Volcanic_03.BP_Lootsite_Volcanic_03_C.TimelineDissolve__Particles__EventFunc // (BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__SM_DryRock_02_03_K2Node_ComponentBoundEvent_0_OnHarvested__DelegateSignature(); // Function BP_Lootsite_Volcanic_03.BP_Lootsite_Volcanic_03_C.BndEvt__SM_DryRock_02_03_K2Node_ComponentBoundEvent_0_OnHarvested__DelegateSignature // (BlueprintEvent) // @ game+0x163f1c0
	void ReceiveBeginPlay(); // Function BP_Lootsite_Volcanic_03.BP_Lootsite_Volcanic_03_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x163f1c0
	void ExecuteUbergraph_BP_Lootsite_Volcanic_03(int32_t EntryPoint); // Function BP_Lootsite_Volcanic_03.BP_Lootsite_Volcanic_03_C.ExecuteUbergraph_BP_Lootsite_Volcanic_03 // (Final|UbergraphFunction|HasDefaults) // @ game+0x163f1c0
};

