// BlueprintGeneratedClass BP_Lootsite_Volcanic_04.BP_Lootsite_Volcanic_04_C
// Size: 0x500 (Inherited: 0x4c0)
struct ABP_Lootsite_Volcanic_04_C : ABaseLootSite_C {
	struct UStaticMeshComponent* SM_Lootsite_Volcanic_04_Proxy; // 0x4c0(0x08)
	struct UStaticMeshComponent* SM_DryRock_17; // 0x4c8(0x08)
	struct UHideComponent_C* HideComponent; // 0x4d0(0x08)
	struct UMistWorldObjectAdjustmentsComponent* MistWorldObjectAdjustments; // 0x4d8(0x08)
	struct ULootableSiegeCrateComponent_C* LootableSiegeCrateComponent; // 0x4e0(0x08)
	struct UStaticMeshComponent* SM_LootModular_09; // 0x4e8(0x08)
	struct UStaticMeshComponent* SM_LootModular_08; // 0x4f0(0x08)
	struct USceneComponent* Scene; // 0x4f8(0x08)

	void UserConstructionScript(); // Function BP_Lootsite_Volcanic_04.BP_Lootsite_Volcanic_04_C.UserConstructionScript // (Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
};

