// BlueprintGeneratedClass BP_Lootsite_Volcanic_02.BP_Lootsite_Volcanic_02_C
// Size: 0x6b0 (Inherited: 0x4c0)
struct ABP_Lootsite_Volcanic_02_C : ABaseLootSite_C {
	struct UStaticMeshComponent* SM_Lootsite_Volcanic_02_Proxy; // 0x4c0(0x08)
	struct UStaticMeshComponent* SM_Lootsite_Volcanic_02_Collision; // 0x4c8(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh2; // 0x4d0(0x08)
	struct UHideComponent_C* HideComponent; // 0x4d8(0x08)
	struct ULootableBackpackComponent_C* LootableBackpackComponent; // 0x4e0(0x08)
	struct ULootableBackpackComponent_C* LootableBackpackComponent1; // 0x4e8(0x08)
	struct UMistHarvestableMeshComponent* MurphysAgave01_04; // 0x4f0(0x08)
	struct UMistHarvestableMeshComponent* MurphysAgave01_08; // 0x4f8(0x08)
	struct UMistHarvestableMeshComponent* MurphysAgave01_07; // 0x500(0x08)
	struct UMistHarvestableMeshComponent* MurphysAgave01_06; // 0x508(0x08)
	struct UMistHarvestableMeshComponent* MurphysAgave01_05; // 0x510(0x08)
	struct UStaticMeshComponent* stick_c_Test27; // 0x518(0x08)
	struct UStaticMeshComponent* stick_c_Test28; // 0x520(0x08)
	struct UStaticMeshComponent* stick_c_Test26; // 0x528(0x08)
	struct UStaticMeshComponent* stick_c_Test25; // 0x530(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_05_04; // 0x538(0x08)
	struct USceneComponent* Bush_04; // 0x540(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_05_03; // 0x548(0x08)
	struct USceneComponent* Bush_03; // 0x550(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_05_02; // 0x558(0x08)
	struct USceneComponent* Bush_02; // 0x560(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_05_01; // 0x568(0x08)
	struct USceneComponent* Bush_01; // 0x570(0x08)
	struct UStaticMeshComponent* SM_FOL_Grass_Clump_03_05; // 0x578(0x08)
	struct USceneComponent* Grass_05; // 0x580(0x08)
	struct UStaticMeshComponent* SM_FOL_Grass_Clump_03_04; // 0x588(0x08)
	struct USceneComponent* Grass_04; // 0x590(0x08)
	struct UStaticMeshComponent* SM_FOL_Grass_Clump_03_03; // 0x598(0x08)
	struct USceneComponent* Grass_03; // 0x5a0(0x08)
	struct UStaticMeshComponent* SM_FOL_Grass_Clump_03_02; // 0x5a8(0x08)
	struct USceneComponent* Grass_02; // 0x5b0(0x08)
	struct UStaticMeshComponent* SM_FOL_Grass_Clump_03_01; // 0x5b8(0x08)
	struct USceneComponent* Grass_01; // 0x5c0(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh1; // 0x5c8(0x08)
	struct USceneComponent* MurphysAgave01_02; // 0x5d0(0x08)
	struct UStaticMeshComponent* SM_DryRock_15_01; // 0x5d8(0x08)
	struct USceneComponent* Scene2; // 0x5e0(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh; // 0x5e8(0x08)
	struct USceneComponent* MurphysAgave01_01; // 0x5f0(0x08)
	struct UStaticMeshComponent* SM_FOL_Grass_Clump_03_010; // 0x5f8(0x08)
	struct UStaticMeshComponent* SM_FOL_Grass_Clump_03_09; // 0x600(0x08)
	struct UStaticMeshComponent* SM_FOL_Grass_Clump_03_08; // 0x608(0x08)
	struct UStaticMeshComponent* SM_FOL_Grass_Clump_03_07; // 0x610(0x08)
	struct UStaticMeshComponent* SM_FOL_Grass_Clump_03_06; // 0x618(0x08)
	struct UStaticMeshComponent* SM_LootModular_08_01; // 0x620(0x08)
	struct UStaticMeshComponent* stick_c_Test24; // 0x628(0x08)
	struct UStaticMeshComponent* stick_c_Test23; // 0x630(0x08)
	struct UStaticMeshComponent* stick_c_Test2; // 0x638(0x08)
	struct UStaticMeshComponent* stick_c_Test19; // 0x640(0x08)
	struct UStaticMeshComponent* stick_c_Test14; // 0x648(0x08)
	struct UStaticMeshComponent* stick_c_Test6; // 0x650(0x08)
	struct UStaticMeshComponent* stick_c_Test13; // 0x658(0x08)
	struct UStaticMeshComponent* stick_c_Test12; // 0x660(0x08)
	struct UStaticMeshComponent* stick_c_Test11; // 0x668(0x08)
	struct UStaticMeshComponent* stick_c_Test7; // 0x670(0x08)
	struct UStaticMeshComponent* stick_c_Test5; // 0x678(0x08)
	struct ULootableBreakableWoodenBoxComponent_C* LootableBreakableWoodenBoxComponent1; // 0x680(0x08)
	struct UStaticMeshComponent* SM_LootModular_08_02; // 0x688(0x08)
	struct UStaticMeshComponent* SM_DryRock_15_02; // 0x690(0x08)
	struct UStaticMeshComponent* stick_c_Test1; // 0x698(0x08)
	struct USceneComponent* Scene1; // 0x6a0(0x08)
	struct UMistWorldObjectAdjustmentsComponent* MistWorldObjectAdjustments; // 0x6a8(0x08)

	void UserConstructionScript(); // Function BP_Lootsite_Volcanic_02.BP_Lootsite_Volcanic_02_C.UserConstructionScript // (Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
};

