// BlueprintGeneratedClass BP_Nest.BP_Nest_C
// Size: 0x450 (Inherited: 0x3c0)
struct ABP_Nest_C : AActor {
	struct USphereComponent* PlayerTrigger; // 0x3c0(0x08)
	struct UBoxComponent* LootPileInteractable; // 0x3c8(0x08)
	struct UStaticMeshComponent* SM_BonesPile4; // 0x3d0(0x08)
	struct UStaticMeshComponent* SM_BonesPile3; // 0x3d8(0x08)
	struct UStaticMeshComponent* SM_BonesPile2; // 0x3e0(0x08)
	struct USceneComponent* SpawnLocation; // 0x3e8(0x08)
	struct UBoxComponent* LootTrigger; // 0x3f0(0x08)
	struct UStaticMeshComponent* SM_RupuPile; // 0x3f8(0x08)
	struct UStaticMeshComponent* SM_RupuPile4; // 0x400(0x08)
	struct UStaticMeshComponent* SM_RupuPile3; // 0x408(0x08)
	struct UBoxComponent* Box; // 0x410(0x08)
	struct UStaticMeshComponent* SM_RupuPile2; // 0x418(0x08)
	struct UStaticMeshComponent* SM_RupuPile1; // 0x420(0x08)
	struct UStaticMeshComponent* SM_RupuPile5; // 0x428(0x08)
	struct UMistMobNestComponent* MistMobNest; // 0x430(0x08)
	struct UMistContainerComponent* MistContainer; // 0x438(0x08)
	struct UStaticMeshComponent* CanyonRock_10m_01; // 0x440(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x448(0x08)
};

