// BlueprintGeneratedClass BuffaloWalker.BuffaloWalker_C
// Size: 0x1239 (Inherited: 0xf38)
struct ABuffaloWalker_C : AMistWalker {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xf38(0x08)
	struct UStaticMeshComponent* SM_BuffaloWalker_Cargo; // 0xf40(0x08)
	struct UStaticMeshComponent* SM_BuffaloWalker_Water; // 0xf48(0x08)
	struct UStaticMeshComponent* SM_BuffaloWalker_Packing; // 0xf50(0x08)
	struct UStaticMeshComponent* SM_BufaloWalkerCollisionPlayerOnly; // 0xf58(0x08)
	struct UStaticMeshComponent* SM_BufaloWalkerCollisionBuilding; // 0xf60(0x08)
	struct UStaticMeshComponent* SM_Bufalowalker; // 0xf68(0x08)
	struct UStaticMeshComponent* StaticMesh35; // 0xf70(0x08)
	struct UStaticMeshComponent* StaticMesh33; // 0xf78(0x08)
	struct UStaticMeshComponent* StaticMesh32; // 0xf80(0x08)
	struct UStaticMeshComponent* StaticMesh15; // 0xf88(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0xf90(0x08)
	struct UStaticMeshComponent* StaticMesh6; // 0xf98(0x08)
	struct UStaticMeshComponent* StaticMesh11; // 0xfa0(0x08)
	struct UStaticMeshComponent* StaticMesh30; // 0xfa8(0x08)
	struct UStaticMeshComponent* StaticMesh9; // 0xfb0(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0xfb8(0x08)
	struct UStaticMeshComponent* StaticMesh4; // 0xfc0(0x08)
	struct UStaticMeshComponent* StaticMesh10; // 0xfc8(0x08)
	struct UStaticMeshComponent* StaticMesh45; // 0xfd0(0x08)
	struct UStaticMeshComponent* StaticMesh43; // 0xfd8(0x08)
	struct UStaticMeshComponent* StaticMesh44; // 0xfe0(0x08)
	struct UStaticMeshComponent* StaticMesh46; // 0xfe8(0x08)
	struct UStaticMeshComponent* StaticMesh27; // 0xff0(0x08)
	struct UStaticMeshComponent* StaticMesh18; // 0xff8(0x08)
	struct UStaticMeshComponent* StaticMesh19; // 0x1000(0x08)
	struct UStaticMeshComponent* StaticMesh17; // 0x1008(0x08)
	struct UStaticMeshComponent* StaticMesh7; // 0x1010(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x1018(0x08)
	struct UStaticMeshComponent* StaticMesh12; // 0x1020(0x08)
	struct UStaticMeshComponent* StaticMesh26; // 0x1028(0x08)
	struct UStaticMeshComponent* StaticMesh20; // 0x1030(0x08)
	struct UStaticMeshComponent* StaticMesh34; // 0x1038(0x08)
	struct UStaticMeshComponent* StaticMesh14; // 0x1040(0x08)
	struct UStaticMeshComponent* StaticMesh21; // 0x1048(0x08)
	struct UStaticMeshComponent* StaticMesh22; // 0x1050(0x08)
	struct UStaticMeshComponent* StaticMesh37; // 0x1058(0x08)
	struct UStaticMeshComponent* StaticMesh38; // 0x1060(0x08)
	struct UStaticMeshComponent* StaticMesh47; // 0x1068(0x08)
	struct UStaticMeshComponent* StaticMesh25; // 0x1070(0x08)
	struct UStaticMeshComponent* StaticMesh24; // 0x1078(0x08)
	struct UStaticMeshComponent* StaticMesh40; // 0x1080(0x08)
	struct UStaticMeshComponent* StaticMesh31; // 0x1088(0x08)
	struct UStaticMeshComponent* StaticMesh39; // 0x1090(0x08)
	struct UStaticMeshComponent* StaticMesh16; // 0x1098(0x08)
	struct UStaticMeshComponent* StaticMesh41; // 0x10a0(0x08)
	struct UStaticMeshComponent* StaticMesh28; // 0x10a8(0x08)
	struct UStaticMeshComponent* StaticMesh36; // 0x10b0(0x08)
	struct UStaticMeshComponent* StaticMesh42; // 0x10b8(0x08)
	struct UStaticMeshComponent* StaticMesh23; // 0x10c0(0x08)
	struct UStaticMeshComponent* StaticMesh29; // 0x10c8(0x08)
	struct UStaticMeshComponent* StaticMesh8; // 0x10d0(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x10d8(0x08)
	struct UStaticMeshComponent* SM_LegsAttachment_02; // 0x10e0(0x08)
	struct UStaticMeshComponent* SM_LegsAttachment_03; // 0x10e8(0x08)
	struct USceneComponent* Scene; // 0x10f0(0x08)
	struct UWalkerSparePartsCraftingStation_C* WalkerSparePartsCraftingStation; // 0x10f8(0x08)
	struct UMistWalkerSprintTorqueComponent* MistWalkerSprintTorque; // 0x1100(0x08)
	struct UWalkerWaterContainer_C* WalkerWaterContainer; // 0x1108(0x08)
	struct UWalkerCargoContainer_C* WalkerCargoContainer; // 0x1110(0x08)
	struct UWalkerHatchContainer_C* WalkerHatchContainer; // 0x1118(0x08)
	struct UTorqueContainerComponent_C* TorqueContainer; // 0x1120(0x08)
	struct UMistInteractableInventoryComponent* HatchInteractableInventory; // 0x1128(0x08)
	struct UAudioComponent* WaterLoop; // 0x1130(0x08)
	struct UMistWalkerPartSocketComponent* RightWingSocket; // 0x1138(0x08)
	struct UMistWalkerPartSocketComponent* LeftLegSocket; // 0x1140(0x08)
	struct UMistWalkerPartSocketComponent* RightLegSocket; // 0x1148(0x08)
	struct UMistWalkerPartSocketComponent* LeftWingSocket; // 0x1150(0x08)
	struct UMistPackingInteractableComponent* MistPackingInteractable; // 0x1158(0x08)
	struct UMistPackingComponent* MistPacking; // 0x1160(0x08)
	struct UMistInteractableInventoryComponent* WaterInteractable; // 0x1168(0x08)
	struct UWalkerCollisionSoundComponent_C* WalkerCollisionSoundComponent; // 0x1170(0x08)
	struct UAudioComponent* InteriorSoundSocket4; // 0x1178(0x08)
	struct UAudioComponent* InteriorSoundSocket3; // 0x1180(0x08)
	struct UAudioComponent* InteriorSoundSocket2; // 0x1188(0x08)
	struct UAudioComponent* InteriorSoundSocket1; // 0x1190(0x08)
	struct UMistMapIconProviderComponent* MistMapIconProvider; // 0x1198(0x08)
	struct UWalkerSoundComponent_C* WalkerSoundComponent; // 0x11a0(0x08)
	struct UMistSoundNotifyListenerComponent* MistSoundNotifyListener; // 0x11a8(0x08)
	float NormalizedRPM_L; // 0x11b0(0x04)
	float NormalizedRPM_R; // 0x11b4(0x04)
	int32_t PrevGroupR; // 0x11b8(0x04)
	int32_t CurrentGroup R; // 0x11bc(0x04)
	struct UAudioComponent* Walker180A; // 0x11c0(0x08)
	struct UAudioComponent* Walker220A; // 0x11c8(0x08)
	struct UAudioComponent* Walker260A; // 0x11d0(0x08)
	struct UAudioComponent* Walker300A; // 0x11d8(0x08)
	int32_t PrevGroupL; // 0x11e0(0x04)
	int32_t CurrentGroupL; // 0x11e4(0x04)
	struct UAudioComponent* Walker180B; // 0x11e8(0x08)
	struct UAudioComponent* Walker220B; // 0x11f0(0x08)
	struct UAudioComponent* Walker260B; // 0x11f8(0x08)
	struct UAudioComponent* Walker300B; // 0x1200(0x08)
	float GearShiftVolume; // 0x1208(0x04)
	float NormalizedWalkerSpeed; // 0x120c(0x04)
	float LegsSpeed; // 0x1210(0x04)
	bool IsInside; // 0x1214(0x01)
	char pad_1215[0x3]; // 0x1215(0x03)
	float CurrentTilt; // 0x1218(0x04)
	float PrevTilt; // 0x121c(0x04)
	struct USkeletalMeshComponent* Mesh Component; // 0x1220(0x08)
	struct UAudioComponent* WalkerInWaterLoop; // 0x1228(0x08)
	bool Walker Start Moving SFX Fired; // 0x1230(0x01)
	bool HullBroke; // 0x1231(0x01)
	char pad_1232[0x2]; // 0x1232(0x02)
	float TimeInAir; // 0x1234(0x04)
	bool ListenerIsInRange; // 0x1238(0x01)

	void HowLongIsInAir(); // Function BuffaloWalker.BuffaloWalker_C.HowLongIsInAir // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void OnLegSoundNotify(struct USceneComponent* Mesh); // Function BuffaloWalker.BuffaloWalker_C.OnLegSoundNotify // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void SetRPMGroupL(float RPM L, int32_t& RPM Group L); // Function BuffaloWalker.BuffaloWalker_C.SetRPMGroupL // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void SetRPMGroupR(float RPM R, int32_t& RPM Group R); // Function BuffaloWalker.BuffaloWalker_C.SetRPMGroupR // (Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__InteriorMixTrigger_K2Node_ComponentBoundEvent_4_ComponentTriggerSignature__DelegateSignature(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function BuffaloWalker.BuffaloWalker_C.BndEvt__InteriorMixTrigger_K2Node_ComponentBoundEvent_4_ComponentTriggerSignature__DelegateSignature // (BlueprintEvent) // @ game+0x163f1c0
	void CheckForTilt(); // Function BuffaloWalker.BuffaloWalker_C.CheckForTilt // (BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__MistSoundNotifyListener_K2Node_ComponentBoundEvent_1_SoundNotifyEvent__DelegateSignature(struct USkeletalMeshComponent* MeshComponent, struct UAnimSequenceBase* Animation, struct FName& NotifyName, float VolumeMultiplier); // Function BuffaloWalker.BuffaloWalker_C.BndEvt__MistSoundNotifyListener_K2Node_ComponentBoundEvent_1_SoundNotifyEvent__DelegateSignature // (HasOutParms|BlueprintEvent) // @ game+0x163f1c0
	void ReceiveBeginPlay(); // Function BuffaloWalker.BuffaloWalker_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x163f1c0
	void CheckingWater(); // Function BuffaloWalker.BuffaloWalker_C.CheckingWater // (BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__InteriorMixTrigger_K2Node_ComponentBoundEvent_2_ComponentTriggerSignature__DelegateSignature(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function BuffaloWalker.BuffaloWalker_C.BndEvt__InteriorMixTrigger_K2Node_ComponentBoundEvent_2_ComponentTriggerSignature__DelegateSignature // (BlueprintEvent) // @ game+0x163f1c0
	void OnWalkerDamage(float PrevHealth, float NewHealth, float MaximumHealth); // Function BuffaloWalker.BuffaloWalker_C.OnWalkerDamage // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void CheckIfIsInAir(); // Function BuffaloWalker.BuffaloWalker_C.CheckIfIsInAir // (BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void CheckIfListenerIsInRange(); // Function BuffaloWalker.BuffaloWalker_C.CheckIfListenerIsInRange // (BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void ExecuteUbergraph_BuffaloWalker(int32_t EntryPoint); // Function BuffaloWalker.BuffaloWalker_C.ExecuteUbergraph_BuffaloWalker // (Final|UbergraphFunction|HasDefaults) // @ game+0x163f1c0
};

