// BlueprintGeneratedClass Claimingwalker.ClaimingWalker_C
// Size: 0x13e2 (Inherited: 0xf38)
struct AClaimingWalker_C : AMistWalker {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xf38(0x08)
	struct UCapsuleComponent* NoBuildArea; // 0xf40(0x08)
	struct UStaticMeshComponent* SM_ClaimingWalker_Collision_NoBuilding; // 0xf48(0x08)
	struct UStaticMeshComponent* StaticMesh25; // 0xf50(0x08)
	struct UStaticMeshComponent* StaticMesh44; // 0xf58(0x08)
	struct UStaticMeshComponent* StaticMesh93; // 0xf60(0x08)
	struct UStaticMeshComponent* StaticMesh19; // 0xf68(0x08)
	struct UStaticMeshComponent* StaticMesh18; // 0xf70(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0xf78(0x08)
	struct UStaticMeshComponent* SM_sack_flat_L; // 0xf80(0x08)
	struct UStaticMeshComponent* StaticMesh21; // 0xf88(0x08)
	struct UStaticMeshComponent* SM_sack_flat; // 0xf90(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0xf98(0x08)
	struct UStaticMeshComponent* StaticMesh67; // 0xfa0(0x08)
	struct UStaticMeshComponent* StaticMesh20; // 0xfa8(0x08)
	struct UStaticMeshComponent* StaticMesh22; // 0xfb0(0x08)
	struct UStaticMeshComponent* StaticMesh89; // 0xfb8(0x08)
	struct UStaticMeshComponent* StaticMesh87; // 0xfc0(0x08)
	struct UStaticMeshComponent* StaticMesh35; // 0xfc8(0x08)
	struct UStaticMeshComponent* StaticMesh90; // 0xfd0(0x08)
	struct UStaticMeshComponent* StaticMesh95; // 0xfd8(0x08)
	struct UStaticMeshComponent* StaticMesh94; // 0xfe0(0x08)
	struct UStaticMeshComponent* StaticMesh45; // 0xfe8(0x08)
	struct UStaticMeshComponent* StaticMesh59; // 0xff0(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0xff8(0x08)
	struct UStaticMeshComponent* StaticMesh92; // 0x1000(0x08)
	struct UStaticMeshComponent* StaticMesh88; // 0x1008(0x08)
	struct UStaticMeshComponent* StaticMesh86; // 0x1010(0x08)
	struct UStaticMeshComponent* StaticMesh85; // 0x1018(0x08)
	struct UStaticMeshComponent* StaticMesh84; // 0x1020(0x08)
	struct UStaticMeshComponent* StaticMesh83; // 0x1028(0x08)
	struct UStaticMeshComponent* StaticMesh82; // 0x1030(0x08)
	struct UStaticMeshComponent* StaticMesh81; // 0x1038(0x08)
	struct UStaticMeshComponent* StaticMesh80; // 0x1040(0x08)
	struct UStaticMeshComponent* StaticMesh79; // 0x1048(0x08)
	struct UStaticMeshComponent* StaticMesh78; // 0x1050(0x08)
	struct UStaticMeshComponent* StaticMesh77; // 0x1058(0x08)
	struct UStaticMeshComponent* StaticMesh76; // 0x1060(0x08)
	struct UStaticMeshComponent* StaticMesh75; // 0x1068(0x08)
	struct UStaticMeshComponent* StaticMesh74; // 0x1070(0x08)
	struct UStaticMeshComponent* StaticMesh73; // 0x1078(0x08)
	struct UStaticMeshComponent* StaticMesh72; // 0x1080(0x08)
	struct UStaticMeshComponent* StaticMesh71; // 0x1088(0x08)
	struct UStaticMeshComponent* StaticMesh70; // 0x1090(0x08)
	struct UStaticMeshComponent* StaticMesh69; // 0x1098(0x08)
	struct UStaticMeshComponent* StaticMesh68; // 0x10a0(0x08)
	struct UStaticMeshComponent* StaticMesh66; // 0x10a8(0x08)
	struct UStaticMeshComponent* StaticMesh65; // 0x10b0(0x08)
	struct UStaticMeshComponent* StaticMesh64; // 0x10b8(0x08)
	struct UStaticMeshComponent* StaticMesh63; // 0x10c0(0x08)
	struct UStaticMeshComponent* StaticMesh62; // 0x10c8(0x08)
	struct UStaticMeshComponent* StaticMesh61; // 0x10d0(0x08)
	struct UStaticMeshComponent* StaticMesh60; // 0x10d8(0x08)
	struct UStaticMeshComponent* StaticMesh58; // 0x10e0(0x08)
	struct UStaticMeshComponent* StaticMesh57; // 0x10e8(0x08)
	struct UStaticMeshComponent* StaticMesh56; // 0x10f0(0x08)
	struct UStaticMeshComponent* StaticMesh55; // 0x10f8(0x08)
	struct UStaticMeshComponent* StaticMesh54; // 0x1100(0x08)
	struct UStaticMeshComponent* StaticMesh53; // 0x1108(0x08)
	struct UStaticMeshComponent* StaticMesh52; // 0x1110(0x08)
	struct UStaticMeshComponent* StaticMesh51; // 0x1118(0x08)
	struct UStaticMeshComponent* StaticMesh50; // 0x1120(0x08)
	struct UStaticMeshComponent* StaticMesh49; // 0x1128(0x08)
	struct UStaticMeshComponent* StaticMesh48; // 0x1130(0x08)
	struct UStaticMeshComponent* StaticMesh47; // 0x1138(0x08)
	struct UStaticMeshComponent* StaticMesh46; // 0x1140(0x08)
	struct UStaticMeshComponent* StaticMesh43; // 0x1148(0x08)
	struct UStaticMeshComponent* StaticMesh24; // 0x1150(0x08)
	struct UStaticMeshComponent* StaticMesh23; // 0x1158(0x08)
	struct UStaticMeshComponent* SM_rope_bunch_circular1; // 0x1160(0x08)
	struct UStaticMeshComponent* StaticMesh34; // 0x1168(0x08)
	struct UStaticMeshComponent* StaticMesh33; // 0x1170(0x08)
	struct UStaticMeshComponent* StaticMesh29; // 0x1178(0x08)
	struct UStaticMeshComponent* StaticMesh36; // 0x1180(0x08)
	struct UStaticMeshComponent* StaticMesh27; // 0x1188(0x08)
	struct UStaticMeshComponent* StaticMesh26; // 0x1190(0x08)
	struct UStaticMeshComponent* SM_RopeSoftArch_02; // 0x1198(0x08)
	struct UStaticMeshComponent* StaticMesh28; // 0x11a0(0x08)
	struct UStaticMeshComponent* StaticMesh39; // 0x11a8(0x08)
	struct UStaticMeshComponent* StaticMesh37; // 0x11b0(0x08)
	struct UStaticMeshComponent* SM_rope_bunch_circular3; // 0x11b8(0x08)
	struct UStaticMeshComponent* StaticMesh40; // 0x11c0(0x08)
	struct UStaticMeshComponent* StaticMesh38; // 0x11c8(0x08)
	struct UStaticMeshComponent* SM_rope_bunch_circular4; // 0x11d0(0x08)
	struct UStaticMeshComponent* SM_rope_bunch_circular6; // 0x11d8(0x08)
	struct UStaticMeshComponent* SM_rope_bunch_circular2; // 0x11e0(0x08)
	struct UStaticMeshComponent* StaticMesh41; // 0x11e8(0x08)
	struct UStaticMeshComponent* SM_rope_bunch_circular5; // 0x11f0(0x08)
	struct UStaticMeshComponent* StaticMesh42; // 0x11f8(0x08)
	struct UStaticMeshComponent* SM_rope_bunch_circular7; // 0x1200(0x08)
	struct UStaticMeshComponent* StaticMesh32; // 0x1208(0x08)
	struct UStaticMeshComponent* SM_rope_bunch_mast_b; // 0x1210(0x08)
	struct UStaticMeshComponent* StaticMesh31; // 0x1218(0x08)
	struct UStaticMeshComponent* SM_rope_bunch_circular; // 0x1220(0x08)
	struct UStaticMeshComponent* StaticMesh30; // 0x1228(0x08)
	struct UStaticMeshComponent* StaticMesh7; // 0x1230(0x08)
	struct UStaticMeshComponent* StaticMesh17; // 0x1238(0x08)
	struct UStaticMeshComponent* StaticMesh16; // 0x1240(0x08)
	struct UStaticMeshComponent* StaticMesh15; // 0x1248(0x08)
	struct UStaticMeshComponent* StaticMesh14; // 0x1250(0x08)
	struct UStaticMeshComponent* StaticMesh13; // 0x1258(0x08)
	struct UStaticMeshComponent* StaticMesh12; // 0x1260(0x08)
	struct UStaticMeshComponent* StaticMesh11; // 0x1268(0x08)
	struct UStaticMeshComponent* StaticMesh10; // 0x1270(0x08)
	struct UStaticMeshComponent* StaticMesh9; // 0x1278(0x08)
	struct UStaticMeshComponent* StaticMesh8; // 0x1280(0x08)
	struct UStaticMeshComponent* StaticMesh6; // 0x1288(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0x1290(0x08)
	struct UStaticMeshComponent* StaticMesh4; // 0x1298(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x12a0(0x08)
	struct UStaticMeshComponent* StaticMesh91; // 0x12a8(0x08)
	struct UStaticMeshComponent* Base; // 0x12b0(0x08)
	struct UStaticMeshComponent* SM_ClaimingWalker; // 0x12b8(0x08)
	struct UWalkerWaterContainer_C* WaterContainer; // 0x12c0(0x08)
	struct USphereComponent* NoBuildAreaEnemy; // 0x12c8(0x08)
	struct USceneComponent* ClaimCheck; // 0x12d0(0x08)
	struct UStaticMeshComponent* ClaimChest; // 0x12d8(0x08)
	struct UStaticMeshComponent* SM_LegsAttachment; // 0x12e0(0x08)
	struct UStaticMeshComponent* SM_LegsAttachment1; // 0x12e8(0x08)
	struct UBoxComponent* Box; // 0x12f0(0x08)
	struct USceneComponent* ContainerCheck; // 0x12f8(0x08)
	struct UMistContainerComponent* ClaimContainer; // 0x1300(0x08)
	struct UMistClaimingWalkerComponent* MistClaimingWalker; // 0x1308(0x08)
	struct UMistInteractableInventoryComponent* InteractableInventory; // 0x1310(0x08)
	struct UStaticMeshComponent* Lid; // 0x1318(0x08)
	struct USceneComponent* Scene; // 0x1320(0x08)
	struct UBoxComponent* OverheadTrigger; // 0x1328(0x08)
	struct UAudioComponent* OverheadSocket; // 0x1330(0x08)
	struct UMistWalkerPartSocketComponent* LeftLegSocket; // 0x1338(0x08)
	struct UMistWalkerPartSocketComponent* RightLegSocket; // 0x1340(0x08)
	struct UMistInteractableComponent* DeployInteractable; // 0x1348(0x08)
	struct UMistInteractableInventoryComponent* DirtyInventoryInteractable; // 0x1350(0x08)
	struct UWalkerCollisionSoundComponent_C* WalkerCollisionSoundComponent; // 0x1358(0x08)
	struct UMistMapIconProviderComponent* MistMapIconProvider; // 0x1360(0x08)
	struct UAudioComponent* WingsTemp2; // 0x1368(0x08)
	struct UAudioComponent* WingsTemp; // 0x1370(0x08)
	struct UAudioComponent* SoundSocket4; // 0x1378(0x08)
	struct UAudioComponent* SoundSocket3; // 0x1380(0x08)
	struct UAudioComponent* SoundSocket2; // 0x1388(0x08)
	struct UAudioComponent* SoundSocket1; // 0x1390(0x08)
	struct UWalkerSoundComponent_C* WalkerSoundComponent; // 0x1398(0x08)
	struct UMistSoundNotifyListenerComponent* MistSoundNotifyListener; // 0x13a0(0x08)
	struct UMistAudioComponent* PurifierSound; // 0x13a8(0x08)
	struct UMistItemProcessorComponent* MistItemProcessor; // 0x13b0(0x08)
	struct UMistWalkerTorqueGeneratorComponent* MistWalkerTorqueGenerator; // 0x13b8(0x08)
	bool OverheadActive; // 0x13c0(0x01)
	char pad_13C1[0x3]; // 0x13c1(0x03)
	float CurrentTilt; // 0x13c4(0x04)
	float PrevTilt; // 0x13c8(0x04)
	char pad_13CC[0x4]; // 0x13cc(0x04)
	struct UAudioComponent* WalkerInWaterLoop; // 0x13d0(0x08)
	bool WalkerStartMovingSFXFired; // 0x13d8(0x01)
	char pad_13D9[0x3]; // 0x13d9(0x03)
	float TimeInAir; // 0x13dc(0x04)
	bool HullBroke; // 0x13e0(0x01)
	bool ListenerIsInRange; // 0x13e1(0x01)

	void HowLongIsInAir(); // Function Claimingwalker.ClaimingWalker_C.HowLongIsInAir // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void CheckForTilt(); // Function Claimingwalker.ClaimingWalker_C.CheckForTilt // (BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void ReceiveBeginPlay(); // Function Claimingwalker.ClaimingWalker_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__OverheadTrigger_K2Node_ComponentBoundEvent_3_ComponentTriggerSignature__DelegateSignature(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function Claimingwalker.ClaimingWalker_C.BndEvt__OverheadTrigger_K2Node_ComponentBoundEvent_3_ComponentTriggerSignature__DelegateSignature // (BlueprintEvent) // @ game+0x163f1c0
	void CheckingWater(); // Function Claimingwalker.ClaimingWalker_C.CheckingWater // (BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void CheckIfIsInAir(); // Function Claimingwalker.ClaimingWalker_C.CheckIfIsInAir // (BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__MistSoundNotifyListener_K2Node_ComponentBoundEvent_1_SoundNotifyEvent__DelegateSignature(struct USkeletalMeshComponent* MeshComponent, struct UAnimSequenceBase* Animation, struct FName& NotifyName, float VolumeMultiplier); // Function Claimingwalker.ClaimingWalker_C.BndEvt__MistSoundNotifyListener_K2Node_ComponentBoundEvent_1_SoundNotifyEvent__DelegateSignature // (HasOutParms|BlueprintEvent) // @ game+0x163f1c0
	void OnWalkerDamage(float PrevHealth, float NewHealth, float MaximumHealth); // Function Claimingwalker.ClaimingWalker_C.OnWalkerDamage // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void CheckIfListenerIsInRange(); // Function Claimingwalker.ClaimingWalker_C.CheckIfListenerIsInRange // (BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void ExecuteUbergraph_Claimingwalker(int32_t EntryPoint); // Function Claimingwalker.ClaimingWalker_C.ExecuteUbergraph_Claimingwalker // (Final|UbergraphFunction|HasDefaults) // @ game+0x163f1c0
};

