// BlueprintGeneratedClass FastWalker.FastWalker_C
// Size: 0x1319 (Inherited: 0xf38)
struct AFastWalker_C : AMistWalker {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xf38(0x08)
	struct UStaticMeshComponent* StaticMesh9; // 0xf40(0x08)
	struct UStaticMeshComponent* orcaSkull_head; // 0xf48(0x08)
	struct UStaticMeshComponent* stick_d; // 0xf50(0x08)
	struct UStaticMeshComponent* StaticMesh17; // 0xf58(0x08)
	struct UStaticMeshComponent* StaticMesh16; // 0xf60(0x08)
	struct UStaticMeshComponent* SM_rope_bunch_curved1; // 0xf68(0x08)
	struct UStaticMeshComponent* SM_rope_bunch_mast_b; // 0xf70(0x08)
	struct UStaticMeshComponent* SM_sack_flat1; // 0xf78(0x08)
	struct UStaticMeshComponent* SM_sack2; // 0xf80(0x08)
	struct UStaticMeshComponent* SM_bowl; // 0xf88(0x08)
	struct UStaticMeshComponent* SM_sack_flat_L2; // 0xf90(0x08)
	struct UStaticMeshComponent* SM_sack_flat_L1; // 0xf98(0x08)
	struct UStaticMeshComponent* StaticMesh12; // 0xfa0(0x08)
	struct UStaticMeshComponent* SM_crate_small_cover; // 0xfa8(0x08)
	struct UStaticMeshComponent* whale_rib1; // 0xfb0(0x08)
	struct UStaticMeshComponent* SM_sack_flat_L; // 0xfb8(0x08)
	struct UStaticMeshComponent* SM_bowl1; // 0xfc0(0x08)
	struct UStaticMeshComponent* humanSkull1; // 0xfc8(0x08)
	struct UStaticMeshComponent* SM_sack_flat_L3; // 0xfd0(0x08)
	struct UStaticMeshComponent* StaticMesh19; // 0xfd8(0x08)
	struct UStaticMeshComponent* SM_sack_flat; // 0xfe0(0x08)
	struct UStaticMeshComponent* StaticMesh18; // 0xfe8(0x08)
	struct UStaticMeshComponent* SM_urn_big; // 0xff0(0x08)
	struct UStaticMeshComponent* SM_Lamp; // 0xff8(0x08)
	struct UStaticMeshComponent* StaticMesh26; // 0x1000(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x1008(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0x1010(0x08)
	struct UStaticMeshComponent* StaticMesh10; // 0x1018(0x08)
	struct UStaticMeshComponent* StaticMesh6; // 0x1020(0x08)
	struct UStaticMeshComponent* StaticMesh4; // 0x1028(0x08)
	struct UStaticMeshComponent* SM_crate_small_without_cover; // 0x1030(0x08)
	struct UStaticMeshComponent* SM_sack2v4; // 0x1038(0x08)
	struct UStaticMeshComponent* SM_sack2v2; // 0x1040(0x08)
	struct UStaticMeshComponent* goatSkull_head; // 0x1048(0x08)
	struct UStaticMeshComponent* SM_BarrelBones_01; // 0x1050(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x1058(0x08)
	struct UStaticMeshComponent* SM_Bag_02; // 0x1060(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x1068(0x08)
	struct UStaticMeshComponent* StaticMesh15; // 0x1070(0x08)
	struct UStaticMeshComponent* SM_Bucket_01; // 0x1078(0x08)
	struct UStaticMeshComponent* humanSkull; // 0x1080(0x08)
	struct UStaticMeshComponent* StaticMesh8; // 0x1088(0x08)
	struct UStaticMeshComponent* SM_rope_tangled1; // 0x1090(0x08)
	struct UStaticMeshComponent* SM_basket_small_cover; // 0x1098(0x08)
	struct UStaticMeshComponent* SM_pot1; // 0x10a0(0x08)
	struct UStaticMeshComponent* SM_rope_deep_arch; // 0x10a8(0x08)
	struct UStaticMeshComponent* SM_rope_bunch_curved; // 0x10b0(0x08)
	struct UStaticMeshComponent* stick_bundle_a; // 0x10b8(0x08)
	struct UStaticMeshComponent* stick_c; // 0x10c0(0x08)
	struct UStaticMeshComponent* StaticMesh21; // 0x10c8(0x08)
	struct UStaticMeshComponent* SM_urn_cap; // 0x10d0(0x08)
	struct UStaticMeshComponent* whale_rib; // 0x10d8(0x08)
	struct UStaticMeshComponent* goatSkull_jaw; // 0x10e0(0x08)
	struct UStaticMeshComponent* SM_Tub_01; // 0x10e8(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x10f0(0x08)
	struct UStaticMeshComponent* SM_PimpingBasket_01; // 0x10f8(0x08)
	struct UStaticMeshComponent* StaticMesh13; // 0x1100(0x08)
	struct UStaticMeshComponent* StaticMesh14; // 0x1108(0x08)
	struct UStaticMeshComponent* StaticMesh11; // 0x1110(0x08)
	struct UStaticMeshComponent* StaticMesh7; // 0x1118(0x08)
	struct UStaticMeshComponent* SM_sack2v41; // 0x1120(0x08)
	struct UStaticMeshComponent* StaticMesh22; // 0x1128(0x08)
	struct UStaticMeshComponent* StaticMesh24; // 0x1130(0x08)
	struct UStaticMeshComponent* StaticMesh25; // 0x1138(0x08)
	struct UStaticMeshComponent* SM_crate_2_cover; // 0x1140(0x08)
	struct UStaticMeshComponent* SM_rope_bunch; // 0x1148(0x08)
	struct UStaticMeshComponent* SM_sack_flat2; // 0x1150(0x08)
	struct UStaticMeshComponent* SM_sack2v21; // 0x1158(0x08)
	struct UStaticMeshComponent* SM_Bag_021; // 0x1160(0x08)
	struct UStaticMeshComponent* SM_rope_tangled2; // 0x1168(0x08)
	struct UStaticMeshComponent* SM_Bag_031; // 0x1170(0x08)
	struct UStaticMeshComponent* SM_Bucket_011; // 0x1178(0x08)
	struct UStaticMeshComponent* SM_Bag_03; // 0x1180(0x08)
	struct UStaticMeshComponent* SM_rope_deep_arch1; // 0x1188(0x08)
	struct UStaticMeshComponent* SM_sack2v42; // 0x1190(0x08)
	struct UStaticMeshComponent* SM_Basket_01; // 0x1198(0x08)
	struct UStaticMeshComponent* StaticMesh20; // 0x11a0(0x08)
	struct UStaticMeshComponent* SM_Package_01; // 0x11a8(0x08)
	struct UStaticMeshComponent* SM_BarrelBones_02; // 0x11b0(0x08)
	struct UStaticMeshComponent* SM_BarrelBones_011; // 0x11b8(0x08)
	struct UStaticMeshComponent* SM_big_pot; // 0x11c0(0x08)
	struct UStaticMeshComponent* StaticMesh23; // 0x11c8(0x08)
	struct UStaticMeshComponent* SM_rope_tangled; // 0x11d0(0x08)
	struct UStaticMeshComponent* SM_FastWalker_Packing; // 0x11d8(0x08)
	struct UStaticMeshComponent* SM_FastWalker_Cargo; // 0x11e0(0x08)
	struct UStaticMeshComponent* SM_FastWalkerCollision_Player; // 0x11e8(0x08)
	struct UStaticMeshComponent* SM_FastWalkerCollision_Main; // 0x11f0(0x08)
	struct UStaticMeshComponent* SM_FastWalker; // 0x11f8(0x08)
	struct UStaticMeshComponent* SM_LegsAttachment; // 0x1200(0x08)
	struct UStaticMeshComponent* SM_LegsAttachment1; // 0x1208(0x08)
	struct USceneComponent* Scene; // 0x1210(0x08)
	struct UWalkerSparePartsCraftingStation_C* WalkerSparePartsCraftingStation; // 0x1218(0x08)
	struct UMistWalkerSprintTorqueComponent* MistWalkerSprintTorque; // 0x1220(0x08)
	struct UMistInteractableInventoryComponent* CargoInteractableInventory; // 0x1228(0x08)
	struct UWalkerWaterContainer_C* WalkerWaterContainer; // 0x1230(0x08)
	struct UWalkerHatchContainer_C* WalkerHatchContainer; // 0x1238(0x08)
	struct UWalkerCargoContainer_C* WalkerCargoContainer; // 0x1240(0x08)
	struct UTorqueContainerComponent_C* TorqueContainer; // 0x1248(0x08)
	struct UBoxComponent* OverheadTrigger; // 0x1250(0x08)
	struct UMistWalkerPartSocketComponent* LeftWingSocket; // 0x1258(0x08)
	struct UMistWalkerPartSocketComponent* RightLegSocket; // 0x1260(0x08)
	struct UMistWalkerPartSocketComponent* LeftLegSocket; // 0x1268(0x08)
	struct UMistWalkerPartSocketComponent* RightWingSocket; // 0x1270(0x08)
	struct UStaticMeshComponent* SM_Walker_07; // 0x1278(0x08)
	struct UMistPackingInteractableComponent* MistPackingInteractable; // 0x1280(0x08)
	struct UMistPackingComponent* MistPacking; // 0x1288(0x08)
	struct UWalkerCollisionSoundComponent_C* WalkerCollisionSoundComponent; // 0x1290(0x08)
	struct UMistMapIconProviderComponent* MistMapIconProvider; // 0x1298(0x08)
	struct UAudioComponent* OverheadSocket; // 0x12a0(0x08)
	struct UAudioComponent* SoundSocket4; // 0x12a8(0x08)
	struct UAudioComponent* SoundSocket3; // 0x12b0(0x08)
	struct UAudioComponent* SoundSocket2; // 0x12b8(0x08)
	struct UAudioComponent* SoundSocket1; // 0x12c0(0x08)
	struct UMistSoundNotifyListenerComponent* MistSoundNotifyListener; // 0x12c8(0x08)
	struct UWalkerSoundComponent_C* WalkerSoundComponent; // 0x12d0(0x08)
	float CurrentTilt; // 0x12d8(0x04)
	float PrevTilt; // 0x12dc(0x04)
	bool OverheadActive; // 0x12e0(0x01)
	bool DamageOcurred; // 0x12e1(0x01)
	bool ImpactOcurred; // 0x12e2(0x01)
	char pad_12E3[0x5]; // 0x12e3(0x05)
	struct UAudioComponent* WalkerScrape; // 0x12e8(0x08)
	bool RattleOcurred; // 0x12f0(0x01)
	char pad_12F1[0x7]; // 0x12f1(0x07)
	struct UAudioComponent* WalkerInWaterLoop; // 0x12f8(0x08)
	bool Walker Start Moving SFX Fired; // 0x1300(0x01)
	char pad_1301[0x7]; // 0x1301(0x07)
	struct USkeletalMeshComponent* Mesh Component; // 0x1308(0x08)
	bool HullBroke; // 0x1310(0x01)
	char pad_1311[0x3]; // 0x1311(0x03)
	float TimeInAir; // 0x1314(0x04)
	bool ListenerIsInRange; // 0x1318(0x01)

	void HowLongIsInAir(); // Function FastWalker.FastWalker_C.HowLongIsInAir // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__OverheadTrigger_K2Node_ComponentBoundEvent_2_ComponentTriggerSignature__DelegateSignature(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function FastWalker.FastWalker_C.BndEvt__OverheadTrigger_K2Node_ComponentBoundEvent_2_ComponentTriggerSignature__DelegateSignature // (BlueprintEvent) // @ game+0x163f1c0
	void CheckingWater(); // Function FastWalker.FastWalker_C.CheckingWater // (BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void CheckForTilt(); // Function FastWalker.FastWalker_C.CheckForTilt // (BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void ReceiveBeginPlay(); // Function FastWalker.FastWalker_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x163f1c0
	void OnWalkerDamage(float PrevHealth, float NewHealth, float MaximumHealth); // Function FastWalker.FastWalker_C.OnWalkerDamage // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void CheckIfIsInAir(); // Function FastWalker.FastWalker_C.CheckIfIsInAir // (BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void CheckIfListenerIsInRange(); // Function FastWalker.FastWalker_C.CheckIfListenerIsInRange // (BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__MistSoundNotifyListener_K2Node_ComponentBoundEvent_1_SoundNotifyEvent__DelegateSignature(struct USkeletalMeshComponent* MeshComponent, struct UAnimSequenceBase* Animation, struct FName& NotifyName, float VolumeMultiplier); // Function FastWalker.FastWalker_C.BndEvt__MistSoundNotifyListener_K2Node_ComponentBoundEvent_1_SoundNotifyEvent__DelegateSignature // (HasOutParms|BlueprintEvent) // @ game+0x163f1c0
	void ExecuteUbergraph_FastWalker(int32_t EntryPoint); // Function FastWalker.FastWalker_C.ExecuteUbergraph_FastWalker // (Final|UbergraphFunction|HasDefaults) // @ game+0x163f1c0
};

