// BlueprintGeneratedClass FastTransporterWalker.FastTransporterWalker_C
// Size: 0x11b1 (Inherited: 0xf38)
struct AFastTransporterWalker_C : AMistWalker {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xf38(0x08)
	struct UStaticMeshComponent* SM_FastTransportWalkerCollision_Main; // 0xf40(0x08)
	struct UStaticMeshComponent* SM_FastTransportWalkerCollision_Player; // 0xf48(0x08)
	struct UStaticMeshComponent* SM_FastTransporterWalker; // 0xf50(0x08)
	struct UBoxComponent* CameraBlock1; // 0xf58(0x08)
	struct UBoxComponent* CameraBlock; // 0xf60(0x08)
	struct UStaticMeshComponent* SM_pot1; // 0xf68(0x08)
	struct UStaticMeshComponent* SM_bowl; // 0xf70(0x08)
	struct UStaticMeshComponent* SM_sack_flat_L; // 0xf78(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0xf80(0x08)
	struct UStaticMeshComponent* SM_urn_big; // 0xf88(0x08)
	struct UStaticMeshComponent* SM_Package_01; // 0xf90(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0xf98(0x08)
	struct UStaticMeshComponent* SM_sack2; // 0xfa0(0x08)
	struct UStaticMeshComponent* StaticMesh4; // 0xfa8(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0xfb0(0x08)
	struct UStaticMeshComponent* StaticMesh6; // 0xfb8(0x08)
	struct UStaticMeshComponent* SM_crate_small; // 0xfc0(0x08)
	struct UStaticMeshComponent* humanSkull; // 0xfc8(0x08)
	struct UStaticMeshComponent* Barrel; // 0xfd0(0x08)
	struct UStaticMeshComponent* StaticMesh7; // 0xfd8(0x08)
	struct UStaticMeshComponent* StaticMesh9; // 0xfe0(0x08)
	struct UStaticMeshComponent* StaticMesh5; // 0xfe8(0x08)
	struct UStaticMeshComponent* SM_PimpingBarrel_01; // 0xff0(0x08)
	struct UStaticMeshComponent* SM_urn; // 0xff8(0x08)
	struct UStaticMeshComponent* whale_rib; // 0x1000(0x08)
	struct UStaticMeshComponent* SM_sack_flat1; // 0x1008(0x08)
	struct UStaticMeshComponent* SM_rope_bunch_curved; // 0x1010(0x08)
	struct UStaticMeshComponent* SM_basket_cover; // 0x1018(0x08)
	struct UStaticMeshComponent* SM_sack_flat_L1; // 0x1020(0x08)
	struct UStaticMeshComponent* SM_sack_flat; // 0x1028(0x08)
	struct UStaticMeshComponent* SM_crate_frabric; // 0x1030(0x08)
	struct UStaticMeshComponent* SM_bowl1; // 0x1038(0x08)
	struct UStaticMeshComponent* StaticMesh8; // 0x1040(0x08)
	struct UStaticMeshComponent* SM_FastTransporterWalker_Cargo; // 0x1048(0x08)
	struct UStaticMeshComponent* SM_LegsAttachment; // 0x1050(0x08)
	struct UStaticMeshComponent* SM_LegsAttachment1; // 0x1058(0x08)
	struct UCapsuleComponent* Capsule5; // 0x1060(0x08)
	struct UCapsuleComponent* Capsule4; // 0x1068(0x08)
	struct UCapsuleComponent* Capsule3; // 0x1070(0x08)
	struct UBoxComponent* Box; // 0x1078(0x08)
	struct UCapsuleComponent* BlockBuilding1; // 0x1080(0x08)
	struct UCapsuleComponent* Capsule1; // 0x1088(0x08)
	struct UCapsuleComponent* Capsule2; // 0x1090(0x08)
	struct UCapsuleComponent* BlockBuilding; // 0x1098(0x08)
	struct UStaticMeshComponent* goatSkull_jaw; // 0x10a0(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x10a8(0x08)
	struct UStaticMeshComponent* whale_vertebra; // 0x10b0(0x08)
	struct USceneComponent* Scene; // 0x10b8(0x08)
	struct UWalkerSparePartsCraftingStation_C* WalkerSparePartsCraftingStation; // 0x10c0(0x08)
	struct UMistWalkerSprintTorqueComponent* MistWalkerSprintTorque; // 0x10c8(0x08)
	struct UMistInteractableInventoryComponent* CargoInventoryInteractable; // 0x10d0(0x08)
	struct UWalkerWaterContainer_C* WalkerWaterContainer; // 0x10d8(0x08)
	struct UWalkerHatchContainer_C* WalkerHatchContainer; // 0x10e0(0x08)
	struct UWalkerCargoContainer_C* WalkerCargoContainer; // 0x10e8(0x08)
	struct UTorqueContainerComponent_C* TorqueContainer; // 0x10f0(0x08)
	struct UBoxComponent* OverheadTrigger; // 0x10f8(0x08)
	struct UMistWalkerPartSocketComponent* LeftLegSocket; // 0x1100(0x08)
	struct UMistWalkerPartSocketComponent* RightWingSocket; // 0x1108(0x08)
	struct UMistWalkerPartSocketComponent* LeftWingSocket; // 0x1110(0x08)
	struct UMistWalkerPartSocketComponent* RightLegSocket; // 0x1118(0x08)
	struct UStaticMeshComponent* SM_Lamp; // 0x1120(0x08)
	struct UMistPackingInteractableComponent* MistPackingInteractable; // 0x1128(0x08)
	struct UMistPackingComponent* MistPacking; // 0x1130(0x08)
	struct UWalkerCollisionSoundComponent_C* WalkerCollisionSoundComponent; // 0x1138(0x08)
	struct UMistMapIconProviderComponent* MistMapIconProvider; // 0x1140(0x08)
	struct UMistSoundNotifyListenerComponent* MistSoundNotifyListener; // 0x1148(0x08)
	struct UAudioComponent* SoundSocket4; // 0x1150(0x08)
	struct UAudioComponent* SoundSocket3; // 0x1158(0x08)
	struct UAudioComponent* SoundSocket2; // 0x1160(0x08)
	struct UAudioComponent* SoundSocket1; // 0x1168(0x08)
	struct UAudioComponent* OverheadSocket; // 0x1170(0x08)
	struct UWalkerSoundComponent_C* WalkerSoundComponent; // 0x1178(0x08)
	float CurrentTilt; // 0x1180(0x04)
	float PrevTilt; // 0x1184(0x04)
	bool OverheadActive; // 0x1188(0x01)
	char pad_1189[0x7]; // 0x1189(0x07)
	struct UAudioComponent* WalkerInWaterLoop; // 0x1190(0x08)
	bool Walker Start Moving SFX Fired; // 0x1198(0x01)
	char pad_1199[0x7]; // 0x1199(0x07)
	struct USkeletalMeshComponent* Mesh Component; // 0x11a0(0x08)
	bool HullBroke; // 0x11a8(0x01)
	char pad_11A9[0x3]; // 0x11a9(0x03)
	float TimeInAir; // 0x11ac(0x04)
	bool ListenerIsInRange; // 0x11b0(0x01)

	void HowLongIsInAir(); // Function FastTransporterWalker.FastTransporterWalker_C.HowLongIsInAir // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void ReceiveBeginPlay(); // Function FastTransporterWalker.FastTransporterWalker_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__OverheadTrigger_K2Node_ComponentBoundEvent_2_ComponentTriggerSignature__DelegateSignature(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function FastTransporterWalker.FastTransporterWalker_C.BndEvt__OverheadTrigger_K2Node_ComponentBoundEvent_2_ComponentTriggerSignature__DelegateSignature // (BlueprintEvent) // @ game+0x163f1c0
	void CheckForTilt(); // Function FastTransporterWalker.FastTransporterWalker_C.CheckForTilt // (BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void CheckingWater(); // Function FastTransporterWalker.FastTransporterWalker_C.CheckingWater // (BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void OnWalkerDamage(float PrevHealth, float NewHealth, float MaximumHealth); // Function FastTransporterWalker.FastTransporterWalker_C.OnWalkerDamage // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void CheckIfIsInAir(); // Function FastTransporterWalker.FastTransporterWalker_C.CheckIfIsInAir // (BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void CheckIfListenerIsInRange(); // Function FastTransporterWalker.FastTransporterWalker_C.CheckIfListenerIsInRange // (BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__MistSoundNotifyListener_K2Node_ComponentBoundEvent_1_SoundNotifyEvent__DelegateSignature(struct USkeletalMeshComponent* MeshComponent, struct UAnimSequenceBase* Animation, struct FName& NotifyName, float VolumeMultiplier); // Function FastTransporterWalker.FastTransporterWalker_C.BndEvt__MistSoundNotifyListener_K2Node_ComponentBoundEvent_1_SoundNotifyEvent__DelegateSignature // (HasOutParms|BlueprintEvent) // @ game+0x163f1c0
	void ExecuteUbergraph_FastTransporterWalker(int32_t EntryPoint); // Function FastTransporterWalker.FastTransporterWalker_C.ExecuteUbergraph_FastTransporterWalker // (Final|UbergraphFunction|HasDefaults) // @ game+0x163f1c0
};

