// BlueprintGeneratedClass FragmentMachine.FragmentMachine_C
// Size: 0x4e8 (Inherited: 0x4a0)
struct AFragmentMachine_C : AMistFragmentMachine {
	struct UBoxComponent* ACSInteraction; // 0x4a0(0x08)
	struct UStaticMeshComponent* DebugGroundPlane; // 0x4a8(0x08)
	struct UStaticMeshComponent* FragmentMachine; // 0x4b0(0x08)
	struct USphereComponent* ProximityTrigger; // 0x4b8(0x08)
	struct UTorqueContainerComponent_C* TorqueContainerComponent; // 0x4c0(0x08)
	struct UMistToggleAutoCraftingStationComponent* TorqueConsumption; // 0x4c8(0x08)
	struct UMistContainerComponent* InputContainer; // 0x4d0(0x08)
	struct UMistAlternativeFurnaceComponent* AncientCraftingFurnace; // 0x4d8(0x08)
	struct UMistWorldObjectAdjustmentsComponent* MistWorldObjectAdjustments; // 0x4e0(0x08)
};

