// BlueprintGeneratedClass HardLargeRupuCamp_01.HardLargeRupuCamp_01_C
// Size: 0x970 (Inherited: 0x514)
struct AHardLargeRupuCamp_01_C : AMistMobCamp_Base_C {
	char pad_514[0x4]; // 0x514(0x04)
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x518(0x08)
	struct UStaticMeshComponent* VT_Decal12; // 0x520(0x08)
	struct UStaticMeshComponent* VT_Decal11; // 0x528(0x08)
	struct UStaticMeshComponent* VT_Decal10; // 0x530(0x08)
	struct UStaticMeshComponent* VT_Decal9; // 0x538(0x08)
	struct UStaticMeshComponent* VT_Decal8; // 0x540(0x08)
	struct UStaticMeshComponent* VT_Decal7; // 0x548(0x08)
	struct UStaticMeshComponent* VT_Decal6; // 0x550(0x08)
	struct UStaticMeshComponent* VT_Decal5; // 0x558(0x08)
	struct UStaticMeshComponent* VT_Decal4; // 0x560(0x08)
	struct UStaticMeshComponent* VT_Decal3; // 0x568(0x08)
	struct UStaticMeshComponent* VT_Decal2; // 0x570(0x08)
	struct UStaticMeshComponent* VT_Decal1; // 0x578(0x08)
	struct UStaticMeshComponent* SM_RupuCamp_02_Collision; // 0x580(0x08)
	struct UStaticMeshComponent* SM_RupuCamp_03_Collision; // 0x588(0x08)
	struct UStaticMeshComponent* SM_RupuCamp_04_Collision; // 0x590(0x08)
	struct UCampTotem_C* CampTotem1; // 0x598(0x08)
	struct UCampTotem_C* CampTotem; // 0x5a0(0x08)
	struct UStaticMeshComponent* SM_RupuStructure11a2; // 0x5a8(0x08)
	struct UStaticMeshComponent* SM_RupuStructure11b2; // 0x5b0(0x08)
	struct UStaticMeshComponent* SM_RupuStructure11b1; // 0x5b8(0x08)
	struct UStaticMeshComponent* SM_RupuStructure11a1; // 0x5c0(0x08)
	struct UStaticMeshComponent* SM_RupuStructure11b; // 0x5c8(0x08)
	struct UStaticMeshComponent* SM_RupuStructure11a; // 0x5d0(0x08)
	struct UHideComponent_C* HideComponent; // 0x5d8(0x08)
	struct UStaticMeshComponent* SM_HardLargeRupuCamp_01_Proxy; // 0x5e0(0x08)
	struct ULootableSkeletonComponent_C* LootableSkeletonComponent; // 0x5e8(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x5f0(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x5f8(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x600(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x608(0x08)
	struct UStaticMeshComponent* SM_RupuTotemFlags1; // 0x610(0x08)
	struct UStaticMeshComponent* SM_RupuCampFlags_04; // 0x618(0x08)
	struct UStaticMeshComponent* SM_RupuCampFlags_03; // 0x620(0x08)
	struct UStaticMeshComponent* SM_RupuTotemFlags; // 0x628(0x08)
	struct UStaticMeshComponent* SM_RupuCampFlags_02; // 0x630(0x08)
	struct UStaticMeshComponent* SM_DryRockHand_04; // 0x638(0x08)
	struct UStaticMeshComponent* SM_DryRockHand_07; // 0x640(0x08)
	struct UStaticMeshComponent* SM_DryRockHand_09; // 0x648(0x08)
	struct UStaticMeshComponent* SM_DryRockHand_010; // 0x650(0x08)
	struct UStaticMeshComponent* SM_DryRockHand_06; // 0x658(0x08)
	struct UStaticMeshComponent* SM_DryRockHand_05; // 0x660(0x08)
	struct USceneComponent* Scene; // 0x668(0x08)
	struct UCampMonkeyVine_C* CampMonkeyVine5; // 0x670(0x08)
	struct UStaticMeshComponent* SM_DryRockHand_011; // 0x678(0x08)
	struct UCampMonkeyVine_C* CampMonkeyVine8; // 0x680(0x08)
	struct UCampMonkeyVine_C* CampMonkeyVine7; // 0x688(0x08)
	struct UStaticMeshComponent* SM_RupuPile11; // 0x690(0x08)
	struct UStaticMeshComponent* SM_RupuStructure010; // 0x698(0x08)
	struct UStaticMeshComponent* SM_BonesPile3; // 0x6a0(0x08)
	struct UStaticMeshComponent* SM_RupuStructure03; // 0x6a8(0x08)
	struct UStaticMeshComponent* SM_RupuStructure06; // 0x6b0(0x08)
	struct UStaticMeshComponent* SM_RupuCamp_04_wood; // 0x6b8(0x08)
	struct UStaticMeshComponent* SM_RupuCamp_02_wood; // 0x6c0(0x08)
	struct UStaticMeshComponent* SM_RupuCamp_03_wood; // 0x6c8(0x08)
	struct UBoxComponent* Trigger_RC2_05; // 0x6d0(0x08)
	struct ULootableAttackableUrnComponent_C* LootableAttackableUrnComponent2; // 0x6d8(0x08)
	struct UMobSpawnLocation_C* MobSpawnLocation11; // 0x6e0(0x08)
	struct UMobSpawnLocation_C* MobSpawnLocation10; // 0x6e8(0x08)
	struct UMobSpawnLocation_C* MobSpawnLocation9; // 0x6f0(0x08)
	struct UMobSpawnLocation_C* MobSpawnLocation8; // 0x6f8(0x08)
	struct UMobSpawnLocation_C* MobSpawnLocation7; // 0x700(0x08)
	struct UMobSpawnLocation_C* MobSpawnLocation6; // 0x708(0x08)
	struct UMobSpawnLocation_C* MobSpawnLocation5; // 0x710(0x08)
	struct UMobSpawnLocation_C* MobSpawnLocation4; // 0x718(0x08)
	struct UMobSpawnLocation_C* MobSpawnLocation3; // 0x720(0x08)
	struct UMobSpawnLocation_C* MobSpawnLocation2; // 0x728(0x08)
	struct UMobSpawnLocation_C* MobSpawnLocation1; // 0x730(0x08)
	struct UMobSpawnLocation_C* MobSpawnLocation; // 0x738(0x08)
	struct UStaticMeshComponent* SM_RupuStructure31; // 0x740(0x08)
	struct UCampMonkeyVine_C* CampMonkeyVine6; // 0x748(0x08)
	struct UStaticMeshComponent* SM_RupuPile10; // 0x750(0x08)
	struct UStaticMeshComponent* SM_RupuPile7; // 0x758(0x08)
	struct UStaticMeshComponent* SM_DestroyedWalker02; // 0x760(0x08)
	struct UStaticMeshComponent* SM_DestroyedWalker; // 0x768(0x08)
	struct UStaticMeshComponent* SM_RupuStructure30; // 0x770(0x08)
	struct UStaticMeshComponent* SM_RupuCamp_06; // 0x778(0x08)
	struct UStaticMeshComponent* SM_RupuStructure29; // 0x780(0x08)
	struct UStaticMeshComponent* SM_RupuStructure27; // 0x788(0x08)
	struct UStaticMeshComponent* SM_RupuStructure26; // 0x790(0x08)
	struct UStaticMeshComponent* SM_RupuStructure25; // 0x798(0x08)
	struct UStaticMeshComponent* SM_RupuStructure24; // 0x7a0(0x08)
	struct UStaticMeshComponent* SM_RupuStructure22; // 0x7a8(0x08)
	struct UStaticMeshComponent* SM_DryRockHand_08; // 0x7b0(0x08)
	struct UStaticMeshComponent* SM_RupuStructure21; // 0x7b8(0x08)
	struct UStaticMeshComponent* SM_RupuStructure20; // 0x7c0(0x08)
	struct UStaticMeshComponent* SM_RupuStructure19; // 0x7c8(0x08)
	struct UStaticMeshComponent* SM_RupuStructure018; // 0x7d0(0x08)
	struct UStaticMeshComponent* SM_RupuStructure017; // 0x7d8(0x08)
	struct UStaticMeshComponent* SM_RupuStructure016; // 0x7e0(0x08)
	struct UStaticMeshComponent* SM_RupuTotem1; // 0x7e8(0x08)
	struct UBoxComponent* Trigger_RC2_04; // 0x7f0(0x08)
	struct UBoxComponent* Trigger_RC2_01; // 0x7f8(0x08)
	struct ULootableAttackableUrnComponent_C* LootableAttackableUrnComponent1; // 0x800(0x08)
	struct ULootableAttackableUrnComponent_C* LootableAttackableUrnComponent; // 0x808(0x08)
	struct UStaticMeshComponent* SM_RupuStructure05; // 0x810(0x08)
	struct UCampMonkeyVine_C* CampMonkeyVine2; // 0x818(0x08)
	struct UStaticMeshComponent* SM_RupuStructure18; // 0x820(0x08)
	struct UCampMonkeyVine_C* CampMonkeyVine3; // 0x828(0x08)
	struct UCampMonkeyVine_C* CampMonkeyVine1; // 0x830(0x08)
	struct UStaticMeshComponent* SM_RupuPile9; // 0x838(0x08)
	struct UStaticMeshComponent* SM_RupuStructure015; // 0x840(0x08)
	struct UStaticMeshComponent* SM_RupuStructure014; // 0x848(0x08)
	struct UStaticMeshComponent* SM_RupuStructure013; // 0x850(0x08)
	struct UStaticMeshComponent* SM_RupuStructure012; // 0x858(0x08)
	struct UStaticMeshComponent* SM_BonesPile8; // 0x860(0x08)
	struct UStaticMeshComponent* SM_RupuPile8; // 0x868(0x08)
	struct UStaticMeshComponent* SM_RupuStructure011; // 0x870(0x08)
	struct UStaticMeshComponent* SM_BonesPile7; // 0x878(0x08)
	struct UStaticMeshComponent* SM_BonesPile6; // 0x880(0x08)
	struct UStaticMeshComponent* SM_BonesPile1; // 0x888(0x08)
	struct UStaticMeshComponent* SM_BonesPile4; // 0x890(0x08)
	struct UStaticMeshComponent* SM_BonesPile; // 0x898(0x08)
	struct UStaticMeshComponent* SM_BonesPile2; // 0x8a0(0x08)
	struct UStaticMeshComponent* SM_RupuPile5; // 0x8a8(0x08)
	struct UStaticMeshComponent* SM_RupuPile6; // 0x8b0(0x08)
	struct UStaticMeshComponent* SM_RupuPile4; // 0x8b8(0x08)
	struct UStaticMeshComponent* SM_RupuCampfire; // 0x8c0(0x08)
	struct UStaticMeshComponent* SM_RupuMeats; // 0x8c8(0x08)
	struct UStaticMeshComponent* SM_RupuPile3; // 0x8d0(0x08)
	struct UStaticMeshComponent* SM_RupuPile1; // 0x8d8(0x08)
	struct UStaticMeshComponent* SM_RupuPile; // 0x8e0(0x08)
	struct UStaticMeshComponent* SM_RupuPile2; // 0x8e8(0x08)
	struct UStaticMeshComponent* SM_RupuCampfire3; // 0x8f0(0x08)
	struct UStaticMeshComponent* SM_RupuStructure04; // 0x8f8(0x08)
	struct UStaticMeshComponent* SM_RupuCampfire2; // 0x900(0x08)
	struct UStaticMeshComponent* SM_RupuStructure09; // 0x908(0x08)
	struct UStaticMeshComponent* SM_RupuStructure01; // 0x910(0x08)
	struct UStaticMeshComponent* SM_RupuStructure08; // 0x918(0x08)
	struct UStaticMeshComponent* SM_RupuStructure07; // 0x920(0x08)
	struct UStaticMeshComponent* SM_RupuStructure16; // 0x928(0x08)
	struct UStaticMeshComponent* SM_RupuTotem; // 0x930(0x08)
	struct UStaticMeshComponent* SM_RupuStructure15; // 0x938(0x08)
	struct UStaticMeshComponent* SM_RupuStructure14; // 0x940(0x08)
	struct UStaticMeshComponent* SM_RupuStructure13; // 0x948(0x08)
	struct UStaticMeshComponent* SM_RupuStructure12; // 0x950(0x08)
	struct UStaticMeshComponent* SM_RupuCamp_05; // 0x958(0x08)
	struct UStaticMeshComponent* SM_RupuCamp_04; // 0x960(0x08)
	struct UMistWorldObjectAdjustmentsComponent* MistWorldObjectAdjustments; // 0x968(0x08)

	void UserConstructionScript(); // Function HardLargeRupuCamp_01.HardLargeRupuCamp_01_C.UserConstructionScript // (Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__Trigger_RC2_03_K2Node_ComponentBoundEvent_2_ComponentBeginActorTriggerSignature__DelegateSignature(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function HardLargeRupuCamp_01.HardLargeRupuCamp_01_C.BndEvt__Trigger_RC2_03_K2Node_ComponentBoundEvent_2_ComponentBeginActorTriggerSignature__DelegateSignature // (BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__Trigger_RC2_03_K2Node_ComponentBoundEvent_3_ComponentEndActorTriggerSignature__DelegateSignature(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function HardLargeRupuCamp_01.HardLargeRupuCamp_01_C.BndEvt__Trigger_RC2_03_K2Node_ComponentBoundEvent_3_ComponentEndActorTriggerSignature__DelegateSignature // (BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__Trigger_RC2_04_K2Node_ComponentBoundEvent_15_ComponentBeginActorTriggerSignature__DelegateSignature(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function HardLargeRupuCamp_01.HardLargeRupuCamp_01_C.BndEvt__Trigger_RC2_04_K2Node_ComponentBoundEvent_15_ComponentBeginActorTriggerSignature__DelegateSignature // (BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__Trigger_RC2_04_K2Node_ComponentBoundEvent_18_ComponentEndActorTriggerSignature__DelegateSignature(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function HardLargeRupuCamp_01.HardLargeRupuCamp_01_C.BndEvt__Trigger_RC2_04_K2Node_ComponentBoundEvent_18_ComponentEndActorTriggerSignature__DelegateSignature // (BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__Trigger_RC2_05_K2Node_ComponentBoundEvent_0_ComponentBeginActorTriggerSignature__DelegateSignature(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function HardLargeRupuCamp_01.HardLargeRupuCamp_01_C.BndEvt__Trigger_RC2_05_K2Node_ComponentBoundEvent_0_ComponentBeginActorTriggerSignature__DelegateSignature // (BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__Trigger_RC2_05_K2Node_ComponentBoundEvent_1_ComponentEndActorTriggerSignature__DelegateSignature(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function HardLargeRupuCamp_01.HardLargeRupuCamp_01_C.BndEvt__Trigger_RC2_05_K2Node_ComponentBoundEvent_1_ComponentEndActorTriggerSignature__DelegateSignature // (BlueprintEvent) // @ game+0x163f1c0
	void ExecuteUbergraph_HardLargeRupuCamp_01(int32_t EntryPoint); // Function HardLargeRupuCamp_01.HardLargeRupuCamp_01_C.ExecuteUbergraph_HardLargeRupuCamp_01 // (Final|UbergraphFunction) // @ game+0x163f1c0
};

