// BlueprintGeneratedClass HardSmallRupuCamp_01.HardSmallRupuCamp_01_C
// Size: 0x638 (Inherited: 0x514)
struct AHardSmallRupuCamp_01_C : AMistMobCamp_Base_C {
	char pad_514[0x4]; // 0x514(0x04)
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x518(0x08)
	struct UStaticMeshComponent* VT_Decal12; // 0x520(0x08)
	struct UStaticMeshComponent* VT_Decal1; // 0x528(0x08)
	struct UStaticMeshComponent* SM_RupuCamp_02_Collision; // 0x530(0x08)
	struct UHideComponent_C* HideComponent; // 0x538(0x08)
	struct UStaticMeshComponent* SM_HardSmallRupuCamp_01_Proxy; // 0x540(0x08)
	struct UStaticMeshComponent* SM_RupuCampFlags_02; // 0x548(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x550(0x08)
	struct UStaticMeshComponent* SM_RupuCamp_02_wood; // 0x558(0x08)
	struct UMistWorldObjectAdjustmentsComponent* MistWorldObjectAdjustments; // 0x560(0x08)
	struct UMobSpawnLocation_C* MobSpawnLocation2; // 0x568(0x08)
	struct UMobSpawnLocation_C* MobSpawnLocation1; // 0x570(0x08)
	struct ULootableAttackableUrnComponent_C* LootableAttackableUrnComponent1; // 0x578(0x08)
	struct UStaticMeshComponent* SM_RupuStructure04; // 0x580(0x08)
	struct UStaticMeshComponent* SM_RupuStructure02; // 0x588(0x08)
	struct UStaticMeshComponent* SM_RupuStructure05; // 0x590(0x08)
	struct UCampMonkeyVine_C* CampMonkeyVine1; // 0x598(0x08)
	struct UCampMonkeyVine_C* CampMonkeyVine; // 0x5a0(0x08)
	struct ULootableAttackableUrnComponent_C* LootableAttackableUrnComponent; // 0x5a8(0x08)
	struct UStaticMeshComponent* SM_RupuMeats; // 0x5b0(0x08)
	struct UStaticMeshComponent* SM_RupuStructure010; // 0x5b8(0x08)
	struct UStaticMeshComponent* SM_RupuStructure012; // 0x5c0(0x08)
	struct UStaticMeshComponent* SM_Dead_Tree_04_LOD1; // 0x5c8(0x08)
	struct UStaticMeshComponent* SM_RupuStructure08; // 0x5d0(0x08)
	struct UStaticMeshComponent* SM_BonesPile3; // 0x5d8(0x08)
	struct UStaticMeshComponent* SM_RupuPile1; // 0x5e0(0x08)
	struct UStaticMeshComponent* SM_BonesPile; // 0x5e8(0x08)
	struct UStaticMeshComponent* SM_RupuCampfire; // 0x5f0(0x08)
	struct UStaticMeshComponent* SM_RupuPile2; // 0x5f8(0x08)
	struct UStaticMeshComponent* SM_RupuPile; // 0x600(0x08)
	struct UStaticMeshComponent* SM_RupuStructure18; // 0x608(0x08)
	struct UStaticMeshComponent* SM_Dead_Tree_02_LOD1; // 0x610(0x08)
	struct UBoxComponent* Trigger_RC2_03; // 0x618(0x08)
	struct UMobSpawnLocation_C* MobSpawnLocation; // 0x620(0x08)
	struct UStaticMeshComponent* SM_RupuStructure17; // 0x628(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x630(0x08)

	void UserConstructionScript(); // Function HardSmallRupuCamp_01.HardSmallRupuCamp_01_C.UserConstructionScript // (Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__Trigger_RC2_03_K2Node_ComponentBoundEvent_2_ComponentBeginActorTriggerSignature__DelegateSignature(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function HardSmallRupuCamp_01.HardSmallRupuCamp_01_C.BndEvt__Trigger_RC2_03_K2Node_ComponentBoundEvent_2_ComponentBeginActorTriggerSignature__DelegateSignature // (BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__Trigger_RC2_03_K2Node_ComponentBoundEvent_3_ComponentEndActorTriggerSignature__DelegateSignature(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function HardSmallRupuCamp_01.HardSmallRupuCamp_01_C.BndEvt__Trigger_RC2_03_K2Node_ComponentBoundEvent_3_ComponentEndActorTriggerSignature__DelegateSignature // (BlueprintEvent) // @ game+0x163f1c0
	void ExecuteUbergraph_HardSmallRupuCamp_01(int32_t EntryPoint); // Function HardSmallRupuCamp_01.HardSmallRupuCamp_01_C.ExecuteUbergraph_HardSmallRupuCamp_01 // (Final|UbergraphFunction) // @ game+0x163f1c0
};

