// BlueprintGeneratedClass HardLargeRupuCamp_02.HardLargeRupuCamp_02_C
// Size: 0x850 (Inherited: 0x514)
struct AHardLargeRupuCamp_02_C : AMistMobCamp_Base_C {
	char pad_514[0x4]; // 0x514(0x04)
	struct UStaticMeshComponent* VT_Decal3; // 0x518(0x08)
	struct UStaticMeshComponent* VT_Decal2; // 0x520(0x08)
	struct UStaticMeshComponent* VT_Decal11; // 0x528(0x08)
	struct UStaticMeshComponent* VT_Decal1; // 0x530(0x08)
	struct UStaticMeshComponent* SM_RupuCamp_05_Collision; // 0x538(0x08)
	struct UMobSpawnLocation_C* SentinelRupuPosition2; // 0x540(0x08)
	struct UMobSpawnLocation_C* SentinelRupuPosition; // 0x548(0x08)
	struct UMobSpawnLocation_C* LargeRupuPosition; // 0x550(0x08)
	struct UMobSpawnLocation_C* HazrakiRupuPosition; // 0x558(0x08)
	struct UMobSpawnLocation_C* LightningRupuPosition; // 0x560(0x08)
	struct UMobSpawnLocation_C* SentinelRupuPosition3; // 0x568(0x08)
	struct UDecalComponent* Decal4; // 0x570(0x08)
	struct UDecalComponent* Decal2; // 0x578(0x08)
	struct UDecalComponent* Decal1; // 0x580(0x08)
	struct UDecalComponent* Decal; // 0x588(0x08)
	struct UStaticMeshComponent* SM_RupuStructure11a_StaticMeshComponent0; // 0x590(0x08)
	struct UStaticMeshComponent* SM_RupuStructure04; // 0x598(0x08)
	struct UStaticMeshComponent* SM_RupuMeats; // 0x5a0(0x08)
	struct UCampTotem_C* CampTotem; // 0x5a8(0x08)
	struct USceneComponent* RupuStructure_03; // 0x5b0(0x08)
	struct USceneComponent* RupuStructure_02; // 0x5b8(0x08)
	struct UStaticMeshComponent* SM_RupuStructure06; // 0x5c0(0x08)
	struct USceneComponent* MobPositions; // 0x5c8(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh6; // 0x5d0(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh8; // 0x5d8(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh7; // 0x5e0(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh4; // 0x5e8(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh5; // 0x5f0(0x08)
	struct UStaticMeshComponent* CampCollision; // 0x5f8(0x08)
	struct USceneComponent* Camp; // 0x600(0x08)
	struct USceneComponent* Grass_02; // 0x608(0x08)
	struct USceneComponent* RupuStructure_01; // 0x610(0x08)
	struct USceneComponent* Fence_02; // 0x618(0x08)
	struct USceneComponent* HarvestableBush_01; // 0x620(0x08)
	struct USceneComponent* HarvestableBush_03; // 0x628(0x08)
	struct USceneComponent* Pile_01; // 0x630(0x08)
	struct USceneComponent* Grass_01; // 0x638(0x08)
	struct USceneComponent* HarvestableBush_02; // 0x640(0x08)
	struct USceneComponent* Fence_01; // 0x648(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh2; // 0x650(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh1; // 0x658(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh; // 0x660(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_7_StaticMeshComponent0; // 0x668(0x08)
	struct UStaticMeshComponent* SM_RupuStructure5_StaticMeshComponent0; // 0x670(0x08)
	struct UStaticMeshComponent* SM_RupuStructure02_StaticMeshComponent0; // 0x678(0x08)
	struct UStaticMeshComponent* SM_RupuPile2_StaticMeshComponent0; // 0x680(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_3_StaticMeshComponent0; // 0x688(0x08)
	struct USceneComponent* Loot; // 0x690(0x08)
	struct ULootableBackpackComponent_C* LootableBackpackComponent4; // 0x698(0x08)
	struct ULootableBackpackComponent_C* LootableBackpackComponent7; // 0x6a0(0x08)
	struct ULootableBackpackComponent_C* LootableBackpackComponent6; // 0x6a8(0x08)
	struct ULootableAttackableUrnComponent_C* LootableAttackableUrnComponent3; // 0x6b0(0x08)
	struct ULootableBackpackComponent_C* LootableBackpackComponent5; // 0x6b8(0x08)
	struct ULootableAttackableUrnComponent_C* LootableAttackableUrnComponent2; // 0x6c0(0x08)
	struct ULootableBackpackComponent_C* LootableBackpackComponent2; // 0x6c8(0x08)
	struct ULootableBackpackComponent_C* LootableBackpackComponent3; // 0x6d0(0x08)
	struct ULootableBackpackComponent_C* LootableBackpackComponent1; // 0x6d8(0x08)
	struct ULootableBackpackComponent_C* LootableBackpackComponent; // 0x6e0(0x08)
	struct ULootableAttackableUrnComponent_C* LootableAttackableUrnComponent1; // 0x6e8(0x08)
	struct USceneComponent* Vines; // 0x6f0(0x08)
	struct UMistWorldObjectAdjustmentsComponent* MistWorldObjectAdjustments; // 0x6f8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HangingSpline19_NODE_AddHierarchicalInstancedStaticMeshComponent-0_570; // 0x700(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HangingSpline19_NODE_AddHierarchicalInstancedStaticMeshComponent-0_571; // 0x708(0x08)
	struct USplineMeshComponent* HangingSpline16_NODE_AddSplineMeshComponent-0_857; // 0x710(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HangingSpline16_NODE_AddHierarchicalInstancedStaticMeshComponent-0_570; // 0x718(0x08)
	struct USplineMeshComponent* HangingSpline16_NODE_AddSplineMeshComponent-0_855; // 0x720(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HangingSpline16_NODE_AddHierarchicalInstancedStaticMeshComponent-0_571; // 0x728(0x08)
	struct USplineMeshComponent* HangingSpline16_NODE_AddSplineMeshComponent-0_856; // 0x730(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HangingSpline10_NODE_AddHierarchicalInstancedStaticMeshComponent-1_285; // 0x738(0x08)
	struct USplineMeshComponent* HangingSpline10_NODE_AddSplineMeshComponent-0_857; // 0x740(0x08)
	struct USplineMeshComponent* HangingSpline10_NODE_AddSplineMeshComponent-0_856; // 0x748(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HangingSpline7_NODE_AddHierarchicalInstancedStaticMeshComponent-0_571; // 0x750(0x08)
	struct USplineMeshComponent* HangingSpline19_NODE_AddSplineMeshComponent-0_285; // 0x758(0x08)
	struct USplineMeshComponent* HangingSpline7_NODE_AddSplineMeshComponent-0_857; // 0x760(0x08)
	struct USplineMeshComponent* HangingSpline7_NODE_AddSplineMeshComponent-0_856; // 0x768(0x08)
	struct USplineMeshComponent* HangingSpline7_NODE_AddSplineMeshComponent-0_855; // 0x770(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HangingSpline5_NODE_AddHierarchicalInstancedStaticMeshComponent-0_571; // 0x778(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HangingSpline5_NODE_AddHierarchicalInstancedStaticMeshComponent-0_570; // 0x780(0x08)
	struct USplineMeshComponent* HangingSpline5_NODE_AddSplineMeshComponent-0_285; // 0x788(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HangingSpline3_NODE_AddHierarchicalInstancedStaticMeshComponent-0_571; // 0x790(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HangingSpline3_NODE_AddHierarchicalInstancedStaticMeshComponent-0_570; // 0x798(0x08)
	struct USplineMeshComponent* HangingSpline3_NODE_AddSplineMeshComponent-0_857; // 0x7a0(0x08)
	struct USplineMeshComponent* HangingSpline3_NODE_AddSplineMeshComponent-0_856; // 0x7a8(0x08)
	struct USplineMeshComponent* HangingSpline3_NODE_AddSplineMeshComponent-0_855; // 0x7b0(0x08)
	struct USplineMeshComponent* HangingSpline10_NODE_AddSplineMeshComponent-0_855; // 0x7b8(0x08)
	struct UHierarchicalInstancedStaticMeshComponent* HangingSpline7_NODE_AddHierarchicalInstancedStaticMeshComponent-0_570; // 0x7c0(0x08)
	struct UStaticMeshComponent* SM_RupuTotem_StaticMeshComponent0; // 0x7c8(0x08)
	struct UStaticMeshComponent* SM_RupuStructure11_StaticMeshComponent0; // 0x7d0(0x08)
	struct UStaticMeshComponent* SM_RupuStructure10_StaticMeshComponent0; // 0x7d8(0x08)
	struct UStaticMeshComponent* SM_RupuStructure09_StaticMeshComponent0; // 0x7e0(0x08)
	struct UStaticMeshComponent* SM_RupuStructure07_StaticMeshComponent0; // 0x7e8(0x08)
	struct UStaticMeshComponent* SM_RupuStructure04_StaticMeshComponent0; // 0x7f0(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_11_StaticMeshComponent0; // 0x7f8(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_10_StaticMeshComponent0; // 0x800(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_9_StaticMeshComponent0; // 0x808(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_8_StaticMeshComponent0; // 0x810(0x08)
	struct UStaticMeshComponent* SM_TradingStationScaffoldingBig_01_StaticMeshComponent0; // 0x818(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_05_StaticMeshComponent0; // 0x820(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_5_StaticMeshComponent0; // 0x828(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_4_StaticMeshComponent0; // 0x830(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_02_StaticMeshComponent0; // 0x838(0x08)
	struct UStaticMeshComponent* CampMesh; // 0x840(0x08)
	struct UStaticMeshComponent* SM_FOL_FieldBush_6_StaticMeshComponent0; // 0x848(0x08)
};

