// BlueprintGeneratedClass LargeTransporterWalker.LargeTransporterWalker_C
// Size: 0x146a (Inherited: 0xf38)
struct ALargeTransporterWalker_C : AMistWalker {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xf38(0x08)
	struct UCapsuleComponent* GarbageCollision1; // 0xf40(0x08)
	struct UCapsuleComponent* GarbageCollision4; // 0xf48(0x08)
	struct UStaticMeshComponent* SM_LargeTransporterWalker_BackCargo; // 0xf50(0x08)
	struct UStaticMeshComponent* SM_LargeTransporterWalker_FrontCargo; // 0xf58(0x08)
	struct UStaticMeshComponent* SM_LargeTransporterWalker_Packing; // 0xf60(0x08)
	struct UStaticMeshComponent* SM_LargeTransporterWalker_Collision_PlayerOnly; // 0xf68(0x08)
	struct UStaticMeshComponent* SM_LargeTransporterWalker_Collision_NoBuilding; // 0xf70(0x08)
	struct UStaticMeshComponent* SM_LargeTransporterWalker; // 0xf78(0x08)
	struct UCapsuleComponent* GarbageCollision6; // 0xf80(0x08)
	struct UCapsuleComponent* GarbageCollision5; // 0xf88(0x08)
	struct UCapsuleComponent* GarbageCollision3; // 0xf90(0x08)
	struct UCapsuleComponent* GarbageCollision2; // 0xf98(0x08)
	struct UStaticMeshComponent* SM_LegsAttachment_02; // 0xfa0(0x08)
	struct UStaticMeshComponent* SM_LegsAttachment_03; // 0xfa8(0x08)
	struct USceneComponent* Scene; // 0xfb0(0x08)
	struct UAudioComponent* WaterLoop; // 0xfb8(0x08)
	struct UWalkerSparePartsCraftingStation_C* WalkerSparePartsCraftingStation; // 0xfc0(0x08)
	struct UMistWalkerSprintTorqueComponent* MistWalkerSprintTorque; // 0xfc8(0x08)
	struct UWalkerWaterContainer_C* WalkerWaterContainer; // 0xfd0(0x08)
	struct UWalkerHatchContainer_C* WalkerHatchContainer; // 0xfd8(0x08)
	struct UWalkerCargoContainer_C* WalkerCargoFrontContainer; // 0xfe0(0x08)
	struct UTorqueContainerComponent_C* TorqueContainer; // 0xfe8(0x08)
	struct UAudioComponent* InteriorSoundSocket1; // 0xff0(0x08)
	struct UAudioComponent* InteriorSoundSocket4; // 0xff8(0x08)
	struct UAudioComponent* InteriorSoundSocket2; // 0x1000(0x08)
	struct UAudioComponent* InteriorSoundSocket3; // 0x1008(0x08)
	struct UBoxComponent* InteriorMixTrigger; // 0x1010(0x08)
	struct UAudioComponent* OverheadSocket; // 0x1018(0x08)
	struct UBoxComponent* OverheadTrigger; // 0x1020(0x08)
	struct UWalkerCollisionSoundComponent_C* WalkerCollisionSoundComponent; // 0x1028(0x08)
	struct UWalkerSoundComponent_C* WalkerSoundComponent; // 0x1030(0x08)
	struct UMistWalkerPartSocketComponent* LeftLegSocket; // 0x1038(0x08)
	struct UMistWalkerPartSocketComponent* RightWingSocket; // 0x1040(0x08)
	struct UMistWalkerPartSocketComponent* LeftWingSocket; // 0x1048(0x08)
	struct UMistWalkerPartSocketComponent* RightLegSocket; // 0x1050(0x08)
	struct UStaticMeshComponent* humanSkull; // 0x1058(0x08)
	struct UStaticMeshComponent* SM_bowl2; // 0x1060(0x08)
	struct UStaticMeshComponent* wheel_broken11; // 0x1068(0x08)
	struct UStaticMeshComponent* SM_bowl11; // 0x1070(0x08)
	struct UStaticMeshComponent* SM_bowl1; // 0x1078(0x08)
	struct UStaticMeshComponent* SM_bowl; // 0x1080(0x08)
	struct UStaticMeshComponent* wheel_broken1; // 0x1088(0x08)
	struct UStaticMeshComponent* SM_rope_bunch_curved111; // 0x1090(0x08)
	struct UStaticMeshComponent* SM_rope_bunch_curved11; // 0x1098(0x08)
	struct UStaticMeshComponent* SM_rope_soft_arch22; // 0x10a0(0x08)
	struct UStaticMeshComponent* SM_Shelf_Damaged_013; // 0x10a8(0x08)
	struct UStaticMeshComponent* SM_PimpingBarrel_01313; // 0x10b0(0x08)
	struct UStaticMeshComponent* SM_Shelf_Damaged_0111; // 0x10b8(0x08)
	struct UStaticMeshComponent* SM_Package_01221; // 0x10c0(0x08)
	struct UStaticMeshComponent* SM_PimpingBarrel_01312; // 0x10c8(0x08)
	struct UStaticMeshComponent* SM_Bag_0113124; // 0x10d0(0x08)
	struct UStaticMeshComponent* SM_Bag_0113122421; // 0x10d8(0x08)
	struct UStaticMeshComponent* SM_Bag_011312242; // 0x10e0(0x08)
	struct UStaticMeshComponent* SM_Shelf_Damaged_0121; // 0x10e8(0x08)
	struct UStaticMeshComponent* SM_Shelf_Damaged_012; // 0x10f0(0x08)
	struct UStaticMeshComponent* SM_Bag_0113123; // 0x10f8(0x08)
	struct UStaticMeshComponent* SM_Barrel_Big_012; // 0x1100(0x08)
	struct UStaticMeshComponent* SM_Bag_011312231; // 0x1108(0x08)
	struct UStaticMeshComponent* SM_Bag_011212; // 0x1110(0x08)
	struct UStaticMeshComponent* SM_Bag_011312241; // 0x1118(0x08)
	struct UStaticMeshComponent* SM_Package_01311111112; // 0x1120(0x08)
	struct UStaticMeshComponent* SM_Bag_01131224; // 0x1128(0x08)
	struct UStaticMeshComponent* SM_Bag_01131223; // 0x1130(0x08)
	struct UStaticMeshComponent* SM_PimpingBarrel_01311; // 0x1138(0x08)
	struct UStaticMeshComponent* SM_Package_01311111121; // 0x1140(0x08)
	struct UStaticMeshComponent* SM_Package_01311111111; // 0x1148(0x08)
	struct UStaticMeshComponent* SM_PimpingBarrel_0121; // 0x1150(0x08)
	struct UStaticMeshComponent* SM_Bag_01131221; // 0x1158(0x08)
	struct UStaticMeshComponent* SM_Package_0131111112; // 0x1160(0x08)
	struct UStaticMeshComponent* SM_Barrel_Big_011; // 0x1168(0x08)
	struct UStaticMeshComponent* SM_Container_011; // 0x1170(0x08)
	struct UStaticMeshComponent* SM_Package_0131111111; // 0x1178(0x08)
	struct UStaticMeshComponent* SM_PimpingBarrel_0131; // 0x1180(0x08)
	struct UStaticMeshComponent* SM_Package_01311121; // 0x1188(0x08)
	struct UStaticMeshComponent* SM_Bag_0113121; // 0x1190(0x08)
	struct UStaticMeshComponent* SM_PimpingBarrel_013; // 0x1198(0x08)
	struct UStaticMeshComponent* SM_Bag_011312; // 0x11a0(0x08)
	struct UStaticMeshComponent* SM_Package_013111111; // 0x11a8(0x08)
	struct UStaticMeshComponent* SM_Bag_011311; // 0x11b0(0x08)
	struct UStaticMeshComponent* SM_Container_01; // 0x11b8(0x08)
	struct UStaticMeshComponent* SM_Bag_01131; // 0x11c0(0x08)
	struct UStaticMeshComponent* SM_Package_01311111; // 0x11c8(0x08)
	struct UStaticMeshComponent* SM_Package_0131112; // 0x11d0(0x08)
	struct UStaticMeshComponent* SM_PimpingBarrel_012; // 0x11d8(0x08)
	struct UStaticMeshComponent* SM_Package_013112; // 0x11e0(0x08)
	struct UStaticMeshComponent* SM_Package_0131111; // 0x11e8(0x08)
	struct UStaticMeshComponent* SM_Barrel_Big_01; // 0x11f0(0x08)
	struct UStaticMeshComponent* SM_Bag_0113; // 0x11f8(0x08)
	struct UStaticMeshComponent* SM_urn_big4; // 0x1200(0x08)
	struct UStaticMeshComponent* SM_Package_013111; // 0x1208(0x08)
	struct UStaticMeshComponent* SM_Package_01311; // 0x1210(0x08)
	struct UStaticMeshComponent* SM_Shelf_Damaged_011; // 0x1218(0x08)
	struct UStaticMeshComponent* SM_Bag_011211; // 0x1220(0x08)
	struct UStaticMeshComponent* SM_Bag_0111111111; // 0x1228(0x08)
	struct UStaticMeshComponent* SM_pot11; // 0x1230(0x08)
	struct UStaticMeshComponent* SM_PimpingBarrel_01111; // 0x1238(0x08)
	struct UStaticMeshComponent* SM_urn_big3; // 0x1240(0x08)
	struct UStaticMeshComponent* SM_Bag_01111112; // 0x1248(0x08)
	struct UStaticMeshComponent* SM_Package_011121121; // 0x1250(0x08)
	struct UStaticMeshComponent* SM_Package_01211; // 0x1258(0x08)
	struct UStaticMeshComponent* SM_Bag_01121; // 0x1260(0x08)
	struct UStaticMeshComponent* SM_sack2v41111; // 0x1268(0x08)
	struct UStaticMeshComponent* SM_sack2v411; // 0x1270(0x08)
	struct UStaticMeshComponent* SM_rope_soft_arch211; // 0x1278(0x08)
	struct UStaticMeshComponent* SM_rope_soft_arch21; // 0x1280(0x08)
	struct UStaticMeshComponent* SM_sack221; // 0x1288(0x08)
	struct UStaticMeshComponent* SM_sack22; // 0x1290(0x08)
	struct UStaticMeshComponent* SM_sack21; // 0x1298(0x08)
	struct UStaticMeshComponent* SM_rope_soft_arch2; // 0x12a0(0x08)
	struct UStaticMeshComponent* SM_Bag_011111112; // 0x12a8(0x08)
	struct UStaticMeshComponent* SM_Bag_011111111; // 0x12b0(0x08)
	struct UStaticMeshComponent* SM_urn_big11; // 0x12b8(0x08)
	struct UStaticMeshComponent* SM_urn_big2; // 0x12c0(0x08)
	struct UStaticMeshComponent* SM_rope_bunch_mast_b; // 0x12c8(0x08)
	struct UStaticMeshComponent* SM_rope_bunch_curved1; // 0x12d0(0x08)
	struct UStaticMeshComponent* SM_rope_bunch_curved; // 0x12d8(0x08)
	struct UStaticMeshComponent* SM_Package_0122; // 0x12e0(0x08)
	struct UStaticMeshComponent* SM_PimpingBasket_011; // 0x12e8(0x08)
	struct UStaticMeshComponent* SM_sack2v41; // 0x12f0(0x08)
	struct UStaticMeshComponent* SM_rope_soft_arch1; // 0x12f8(0x08)
	struct UStaticMeshComponent* SM_rope_soft_arch; // 0x1300(0x08)
	struct UStaticMeshComponent* SM_sack2v4; // 0x1308(0x08)
	struct UStaticMeshComponent* SM_sack2; // 0x1310(0x08)
	struct UStaticMeshComponent* SM_Shelf_Damaged_01; // 0x1318(0x08)
	struct UStaticMeshComponent* SM_PimpingBarrel_0111; // 0x1320(0x08)
	struct UStaticMeshComponent* SM_Package_0131; // 0x1328(0x08)
	struct UStaticMeshComponent* SM_Package_01112112; // 0x1330(0x08)
	struct UStaticMeshComponent* SM_Bag_01111111; // 0x1338(0x08)
	struct UStaticMeshComponent* SM_Bag_0111111; // 0x1340(0x08)
	struct UStaticMeshComponent* SM_Package_01112111; // 0x1348(0x08)
	struct UStaticMeshComponent* SM_Bag_0112; // 0x1350(0x08)
	struct UStaticMeshComponent* SM_PimpingBarrel_011; // 0x1358(0x08)
	struct UStaticMeshComponent* SM_Bag_011112; // 0x1360(0x08)
	struct UStaticMeshComponent* SM_Package_01113; // 0x1368(0x08)
	struct UStaticMeshComponent* SM_Package_0111211; // 0x1370(0x08)
	struct UStaticMeshComponent* SM_Package_011121; // 0x1378(0x08)
	struct UStaticMeshComponent* SM_Package_01112; // 0x1380(0x08)
	struct UStaticMeshComponent* SM_Bag_011111; // 0x1388(0x08)
	struct UStaticMeshComponent* SM_Package_01111; // 0x1390(0x08)
	struct UStaticMeshComponent* SM_Bag_01111; // 0x1398(0x08)
	struct UStaticMeshComponent* SM_urn_big1; // 0x13a0(0x08)
	struct UStaticMeshComponent* SM_Bag_0111; // 0x13a8(0x08)
	struct UStaticMeshComponent* SM_Package_0111; // 0x13b0(0x08)
	struct UStaticMeshComponent* SM_Package_013; // 0x13b8(0x08)
	struct UStaticMeshComponent* SM_Package_0121; // 0x13c0(0x08)
	struct UStaticMeshComponent* SM_pot1; // 0x13c8(0x08)
	struct UStaticMeshComponent* SM_Package_012; // 0x13d0(0x08)
	struct UStaticMeshComponent* SM_urn_big; // 0x13d8(0x08)
	struct UStaticMeshComponent* SM_Bag_011; // 0x13e0(0x08)
	struct UStaticMeshComponent* SM_Package_011; // 0x13e8(0x08)
	struct UStaticMeshComponent* SM_Package_01; // 0x13f0(0x08)
	struct UStaticMeshComponent* SM_Bag_01; // 0x13f8(0x08)
	struct UStaticMeshComponent* SM_PimpingBasket_01; // 0x1400(0x08)
	struct UStaticMeshComponent* SM_PimpingBarrel_01; // 0x1408(0x08)
	struct UStaticMeshComponent* SM_sack2v4111; // 0x1410(0x08)
	struct UMistInteractableInventoryComponent* CargoFrontInventoryInteractable; // 0x1418(0x08)
	struct UMistSoundNotifyListenerComponent* MistSoundNotifyListener; // 0x1420(0x08)
	struct UMistPackingInteractableComponent* MistPackingInteractable; // 0x1428(0x08)
	struct UMistPackingComponent* MistPacking; // 0x1430(0x08)
	struct UMistInteractableInventoryComponent* CargoBackInventoryInteractable; // 0x1438(0x08)
	struct UMistMapIconProviderComponent* MistMapIconProvider; // 0x1440(0x08)
	bool OverheadActive; // 0x1448(0x01)
	bool IsInside; // 0x1449(0x01)
	char pad_144A[0x2]; // 0x144a(0x02)
	float CurrentTilt; // 0x144c(0x04)
	float PrevTilt; // 0x1450(0x04)
	char pad_1454[0x4]; // 0x1454(0x04)
	struct UAudioComponent* WalkerInWaterLoop; // 0x1458(0x08)
	bool Walker Start Moving SFX Fired; // 0x1460(0x01)
	char pad_1461[0x3]; // 0x1461(0x03)
	float TimeInAir; // 0x1464(0x04)
	bool HullBroke; // 0x1468(0x01)
	bool ListenerIsInRange; // 0x1469(0x01)

	void HowLongIsInAir(); // Function LargeTransporterWalker.LargeTransporterWalker_C.HowLongIsInAir // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__OverheadTrigger_K2Node_ComponentBoundEvent_10_ComponentTriggerSignature__DelegateSignature(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function LargeTransporterWalker.LargeTransporterWalker_C.BndEvt__OverheadTrigger_K2Node_ComponentBoundEvent_10_ComponentTriggerSignature__DelegateSignature // (BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__InteriorMixTrigger_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function LargeTransporterWalker.LargeTransporterWalker_C.BndEvt__InteriorMixTrigger_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature // (BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__InteriorMixTrigger_K2Node_ComponentBoundEvent_7_ComponentTriggerSignature__DelegateSignature(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function LargeTransporterWalker.LargeTransporterWalker_C.BndEvt__InteriorMixTrigger_K2Node_ComponentBoundEvent_7_ComponentTriggerSignature__DelegateSignature // (BlueprintEvent) // @ game+0x163f1c0
	void CheckForTilt(); // Function LargeTransporterWalker.LargeTransporterWalker_C.CheckForTilt // (BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void CheckingWater(); // Function LargeTransporterWalker.LargeTransporterWalker_C.CheckingWater // (BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void CheckIfIsInAir(); // Function LargeTransporterWalker.LargeTransporterWalker_C.CheckIfIsInAir // (BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void OnWalkerDamage(float PrevHealth, float NewHealth, float MaximumHealth); // Function LargeTransporterWalker.LargeTransporterWalker_C.OnWalkerDamage // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__MistSoundNotifyListener_K2Node_ComponentBoundEvent_1_SoundNotifyEvent__DelegateSignature(struct USkeletalMeshComponent* MeshComponent, struct UAnimSequenceBase* Animation, struct FName& NotifyName, float VolumeMultiplier); // Function LargeTransporterWalker.LargeTransporterWalker_C.BndEvt__MistSoundNotifyListener_K2Node_ComponentBoundEvent_1_SoundNotifyEvent__DelegateSignature // (HasOutParms|BlueprintEvent) // @ game+0x163f1c0
	void CheckIfListenerIsInRange(); // Function LargeTransporterWalker.LargeTransporterWalker_C.CheckIfListenerIsInRange // (BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void ReceiveBeginPlay(); // Function LargeTransporterWalker.LargeTransporterWalker_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x163f1c0
	void ExecuteUbergraph_LargeTransporterWalker(int32_t EntryPoint); // Function LargeTransporterWalker.LargeTransporterWalker_C.ExecuteUbergraph_LargeTransporterWalker // (Final|UbergraphFunction|HasDefaults) // @ game+0x163f1c0
};

