// BlueprintGeneratedClass LegsArmored.LegsArmored_C
// Size: 0x770 (Inherited: 0x730)
struct ALegsArmored_C : AWalkerLegsDefault_C {
	struct UMistSkeletalMeshComponent* SkeletalMesh2; // 0x730(0x08)
	struct UMistSkeletalMeshComponent* SkeletalMesh1; // 0x738(0x08)
	struct UMistSkeletalMeshComponent* SkeletalMesh; // 0x740(0x08)
	struct UStaticMeshComponent* SM_LegsAttachmentRightFront; // 0x748(0x08)
	struct UStaticMeshComponent* SM_LegsAttachmentRightBack; // 0x750(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x758(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x760(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x768(0x08)
};

