// BlueprintGeneratedClass MediumMonkeyCamp_02.MediumMonkeyCamp_02_C
// Size: 0x5d8 (Inherited: 0x500)
struct AMediumMonkeyCamp_02_C : AMistMobCamp {
	struct UCampTotem_C* CampTotem; // 0x500(0x08)
	struct UCampChest_C* CampChest1; // 0x508(0x08)
	struct UCampChest_C* CampChest; // 0x510(0x08)
	struct UStaticMeshComponent* SM_RupuTotemFlags; // 0x518(0x08)
	struct UStaticMeshComponent* SM_RupuCampFlags_02; // 0x520(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh3; // 0x528(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh4; // 0x530(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh2; // 0x538(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh1; // 0x540(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh; // 0x548(0x08)
	struct UStaticMeshComponent* a2; // 0x550(0x08)
	struct UStaticMeshComponent* a3; // 0x558(0x08)
	struct UStaticMeshComponent* a1; // 0x560(0x08)
	struct UStaticMeshComponent* A; // 0x568(0x08)
	struct UStaticMeshComponent* SM_RupuCampFlags_05; // 0x570(0x08)
	struct UStaticMeshComponent* SM_RupuCampFlags_04; // 0x578(0x08)
	struct UStaticMeshComponent* SM_RupuCampFlags_03; // 0x580(0x08)
	struct UStaticMeshComponent* SM_RupuCampFlags_01; // 0x588(0x08)
	struct UMistWorldObjectAdjustmentsComponent* MistWorldObjectAdjustments; // 0x590(0x08)
	struct UStaticMeshComponent* SM_RupuTotem; // 0x598(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x5a0(0x08)
	struct UStaticMeshComponent* SM_RupuCamp_03; // 0x5a8(0x08)
	struct UStaticMeshComponent* SM_RupuCamp_02; // 0x5b0(0x08)
	struct UStaticMeshComponent* SM_RupuCamp_01; // 0x5b8(0x08)
	struct USceneComponent* MobSpawnLocation3; // 0x5c0(0x08)
	struct USceneComponent* MobSpawnLocation1; // 0x5c8(0x08)
	struct USceneComponent* MobSpawnLocation2; // 0x5d0(0x08)
};

