// BlueprintGeneratedClass MediumMediumRupuCamp_01.MediumMediumRupuCamp_01_C
// Size: 0x779 (Inherited: 0x514)
struct AMediumMediumRupuCamp_01_C : AMistMobCamp_Base_C {
	char pad_514[0x4]; // 0x514(0x04)
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x518(0x08)
	struct UStaticMeshComponent* VT_Decal14; // 0x520(0x08)
	struct UStaticMeshComponent* VT_Decal13; // 0x528(0x08)
	struct UStaticMeshComponent* VT_Decal4; // 0x530(0x08)
	struct UStaticMeshComponent* VT_Decal3; // 0x538(0x08)
	struct UStaticMeshComponent* VT_Decal2; // 0x540(0x08)
	struct UStaticMeshComponent* VT_Decal1; // 0x548(0x08)
	struct UStaticMeshComponent* SM_RupuCamp_02_Collision; // 0x550(0x08)
	struct UStaticMeshComponent* SM_RupuCamp_01_Collision; // 0x558(0x08)
	struct UCampTotem_C* CampTotem; // 0x560(0x08)
	struct UStaticMeshComponent* SM_RupuStructure09; // 0x568(0x08)
	struct UStaticMeshComponent* SM_RupuStructure11b1; // 0x570(0x08)
	struct UStaticMeshComponent* SM_RupuStructure11a1; // 0x578(0x08)
	struct UStaticMeshComponent* SM_RupuStructure11b; // 0x580(0x08)
	struct UStaticMeshComponent* SM_RupuStructure11a; // 0x588(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x590(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x598(0x08)
	struct UStaticMeshComponent* SM_RupuCampFlags_02; // 0x5a0(0x08)
	struct UStaticMeshComponent* SM_RupuTotemFlags; // 0x5a8(0x08)
	struct UStaticMeshComponent* SM_RupuCampFlags_01; // 0x5b0(0x08)
	struct UBoxComponent* TriggerCamp; // 0x5b8(0x08)
	struct ULootableAttackableUrnComponent_C* LootableAttackableUrnComponent3; // 0x5c0(0x08)
	struct UBoxComponent* Trigger_RC1_01; // 0x5c8(0x08)
	struct UBoxComponent* Trigger_RC2_04; // 0x5d0(0x08)
	struct UStaticMeshComponent* SM_RupuCamp_03_wood; // 0x5d8(0x08)
	struct UStaticMeshComponent* SM_RupuCamp_02_wood; // 0x5e0(0x08)
	struct UCampMonkeyVine_C* CampMonkeyVine3; // 0x5e8(0x08)
	struct UCampMonkeyVine_C* CampMonkeyVine2; // 0x5f0(0x08)
	struct UCampMonkeyVine_C* CampMonkeyVine1; // 0x5f8(0x08)
	struct ULootableAttackableUrnComponent_C* LootableAttackableUrnComponent; // 0x600(0x08)
	struct ULootableAttackableUrnComponent_C* LootableAttackableUrnComponent2; // 0x608(0x08)
	struct USceneComponent* Scene1; // 0x610(0x08)
	struct ULootableAttackableUrnComponent_C* LootableAttackableUrnComponent1; // 0x618(0x08)
	struct USceneComponent* Scene; // 0x620(0x08)
	struct UStaticMeshComponent* SM_RupuStructure018; // 0x628(0x08)
	struct UStaticMeshComponent* SM_RupuStructure012; // 0x630(0x08)
	struct UMistWorldObjectAdjustmentsComponent* MistWorldObjectAdjustments; // 0x638(0x08)
	struct UStaticMeshComponent* SM_RupuStructure019; // 0x640(0x08)
	struct UStaticMeshComponent* SM_RupuStructure017; // 0x648(0x08)
	struct UStaticMeshComponent* SM_RupuStructure016; // 0x650(0x08)
	struct UMobSpawnLocation_C* MobSpawnLocation3; // 0x658(0x08)
	struct UMobSpawnLocation_C* MobSpawnLocation2; // 0x660(0x08)
	struct UStaticMeshComponent* SM_RupuStructure10; // 0x668(0x08)
	struct UStaticMeshComponent* SM_RupuMeats1; // 0x670(0x08)
	struct UStaticMeshComponent* SM_RupuStructure015; // 0x678(0x08)
	struct UStaticMeshComponent* SM_BonesPile; // 0x680(0x08)
	struct UStaticMeshComponent* SM_BonesPile4; // 0x688(0x08)
	struct UStaticMeshComponent* SM_BonesPile3; // 0x690(0x08)
	struct UStaticMeshComponent* SM_BonesPile2; // 0x698(0x08)
	struct UStaticMeshComponent* SM_RupuTotem; // 0x6a0(0x08)
	struct UStaticMeshComponent* SM_RupuStructure014; // 0x6a8(0x08)
	struct UStaticMeshComponent* SM_RupuStructure013; // 0x6b0(0x08)
	struct UStaticMeshComponent* SM_RupuStructure22; // 0x6b8(0x08)
	struct UStaticMeshComponent* SM_RupuStructure21; // 0x6c0(0x08)
	struct UStaticMeshComponent* SM_RupuStructure20; // 0x6c8(0x08)
	struct UStaticMeshComponent* SM_RupuStructure19; // 0x6d0(0x08)
	struct UStaticMeshComponent* SM_RupuStructure18; // 0x6d8(0x08)
	struct UStaticMeshComponent* SM_RupuStructure08; // 0x6e0(0x08)
	struct UStaticMeshComponent* SM_RupuStructure06; // 0x6e8(0x08)
	struct UStaticMeshComponent* SM_RupuCampfire3; // 0x6f0(0x08)
	struct UStaticMeshComponent* SM_RupuCamp_01; // 0x6f8(0x08)
	struct UMobSpawnLocation_C* MobSpawnLocation1; // 0x700(0x08)
	struct UMobSpawnLocation_C* MobSpawnLocation; // 0x708(0x08)
	struct UStaticMeshComponent* SM_RupuStructure011; // 0x710(0x08)
	struct UStaticMeshComponent* SM_RupuStructure17; // 0x718(0x08)
	struct UStaticMeshComponent* SM_RupuStructure16; // 0x720(0x08)
	struct UStaticMeshComponent* SM_RupuStructure15; // 0x728(0x08)
	struct UStaticMeshComponent* SM_RupuStructure14; // 0x730(0x08)
	struct UStaticMeshComponent* SM_RupuStructure12; // 0x738(0x08)
	struct UStaticMeshComponent* SM_RupuStructure07; // 0x740(0x08)
	struct UStaticMeshComponent* SM_RupuStructure05; // 0x748(0x08)
	struct UStaticMeshComponent* SM_RupuStructure04; // 0x750(0x08)
	struct UStaticMeshComponent* SM_RupuStructure03; // 0x758(0x08)
	struct UStaticMeshComponent* SM_RupuMeats; // 0x760(0x08)
	struct UStaticMeshComponent* SM_RupuCampfire; // 0x768(0x08)
	struct UStaticMeshComponent* SM_RupuCamp_02; // 0x770(0x08)
	bool ProximitySoundSpawned; // 0x778(0x01)

	void BndEvt__Trigger_RC2_04_K2Node_ComponentBoundEvent_0_ComponentBeginActorTriggerSignature__DelegateSignature(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function MediumMediumRupuCamp_01.MediumMediumRupuCamp_01_C.BndEvt__Trigger_RC2_04_K2Node_ComponentBoundEvent_0_ComponentBeginActorTriggerSignature__DelegateSignature // (BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__Trigger_RC2_04_K2Node_ComponentBoundEvent_1_ComponentEndActorTriggerSignature__DelegateSignature(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function MediumMediumRupuCamp_01.MediumMediumRupuCamp_01_C.BndEvt__Trigger_RC2_04_K2Node_ComponentBoundEvent_1_ComponentEndActorTriggerSignature__DelegateSignature // (BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__Trigger_RC1_01_K2Node_ComponentBoundEvent_2_ComponentBeginActorTriggerSignature__DelegateSignature(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function MediumMediumRupuCamp_01.MediumMediumRupuCamp_01_C.BndEvt__Trigger_RC1_01_K2Node_ComponentBoundEvent_2_ComponentBeginActorTriggerSignature__DelegateSignature // (BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__Trigger_RC1_01_K2Node_ComponentBoundEvent_3_ComponentEndActorTriggerSignature__DelegateSignature(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function MediumMediumRupuCamp_01.MediumMediumRupuCamp_01_C.BndEvt__Trigger_RC1_01_K2Node_ComponentBoundEvent_3_ComponentEndActorTriggerSignature__DelegateSignature // (BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__TriggerCamp_K2Node_ComponentBoundEvent_4_ComponentBeginActorTriggerSignature__DelegateSignature(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function MediumMediumRupuCamp_01.MediumMediumRupuCamp_01_C.BndEvt__TriggerCamp_K2Node_ComponentBoundEvent_4_ComponentBeginActorTriggerSignature__DelegateSignature // (BlueprintEvent) // @ game+0x163f1c0
	void ExecuteUbergraph_MediumMediumRupuCamp_01(int32_t EntryPoint); // Function MediumMediumRupuCamp_01.MediumMediumRupuCamp_01_C.ExecuteUbergraph_MediumMediumRupuCamp_01 // (Final|UbergraphFunction) // @ game+0x163f1c0
};

