// BlueprintGeneratedClass MediumSmallRupuCamp_01.MediumSmallRupuCamp_01_C
// Size: 0x668 (Inherited: 0x514)
struct AMediumSmallRupuCamp_01_C : AMistMobCamp_Base_C {
	char pad_514[0x4]; // 0x514(0x04)
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x518(0x08)
	struct UStaticMeshComponent* VT_Decal4; // 0x520(0x08)
	struct UStaticMeshComponent* VT_Decal3; // 0x528(0x08)
	struct UStaticMeshComponent* VT_Decal2; // 0x530(0x08)
	struct UStaticMeshComponent* VT_Decal14; // 0x538(0x08)
	struct UStaticMeshComponent* VT_Decal1; // 0x540(0x08)
	struct UStaticMeshComponent* SM_RupuCamp_02_Collision1; // 0x548(0x08)
	struct UStaticMeshComponent* SM_RupuCamp_02_Collision; // 0x550(0x08)
	struct UStaticMeshComponent* SM_RupuCampFlags_03; // 0x558(0x08)
	struct UStaticMeshComponent* SM_RupuCampFlags_02; // 0x560(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x568(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x570(0x08)
	struct ULootableAttackableUrnComponent_C* LootableAttackableUrnComponent2; // 0x578(0x08)
	struct UBoxComponent* Trigger_RC2_06; // 0x580(0x08)
	struct UBoxComponent* Trigger_RC2_05; // 0x588(0x08)
	struct UStaticMeshComponent* StaticMesh1_wood; // 0x590(0x08)
	struct UStaticMeshComponent* SM_RupuCamp_03_wood; // 0x598(0x08)
	struct UCampMonkeyVine_C* CampMonkeyVine2; // 0x5a0(0x08)
	struct UCampMonkeyVine_C* CampMonkeyVine1; // 0x5a8(0x08)
	struct ULootableAttackableUrnComponent_C* LootableAttackableUrnComponent; // 0x5b0(0x08)
	struct USceneComponent* Scene; // 0x5b8(0x08)
	struct ULootableAttackableUrnComponent_C* LootableAttackableUrnComponent1; // 0x5c0(0x08)
	struct UStaticMeshComponent* SM_RupuStructure09; // 0x5c8(0x08)
	struct UStaticMeshComponent* SM_RupuPile; // 0x5d0(0x08)
	struct UMistWorldObjectAdjustmentsComponent* MistWorldObjectAdjustments; // 0x5d8(0x08)
	struct UMobSpawnLocation_C* MobSpawnLocation1; // 0x5e0(0x08)
	struct UMobSpawnLocation_C* MobSpawnLocation; // 0x5e8(0x08)
	struct UStaticMeshComponent* SM_RupuStructure011; // 0x5f0(0x08)
	struct UStaticMeshComponent* SM_RupuStructure17; // 0x5f8(0x08)
	struct UStaticMeshComponent* SM_RupuStructure16; // 0x600(0x08)
	struct UStaticMeshComponent* SM_RupuStructure15; // 0x608(0x08)
	struct UStaticMeshComponent* SM_RupuStructure14; // 0x610(0x08)
	struct UStaticMeshComponent* SM_RupuStructure12; // 0x618(0x08)
	struct UStaticMeshComponent* SM_RupuStructure07; // 0x620(0x08)
	struct UStaticMeshComponent* SM_RupuStructure05; // 0x628(0x08)
	struct UStaticMeshComponent* SM_RupuStructure04; // 0x630(0x08)
	struct UStaticMeshComponent* SM_RupuStructure03; // 0x638(0x08)
	struct UStaticMeshComponent* SM_RupuMeats; // 0x640(0x08)
	struct UStaticMeshComponent* SM_RupuCampfire2; // 0x648(0x08)
	struct UStaticMeshComponent* SM_RupuCampfire; // 0x650(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x658(0x08)
	struct UStaticMeshComponent* SM_RupuCamp_02; // 0x660(0x08)

	void BndEvt__Trigger_RC2_05_K2Node_ComponentBoundEvent_0_ComponentBeginActorTriggerSignature__DelegateSignature(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function MediumSmallRupuCamp_01.MediumSmallRupuCamp_01_C.BndEvt__Trigger_RC2_05_K2Node_ComponentBoundEvent_0_ComponentBeginActorTriggerSignature__DelegateSignature // (BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__Trigger_RC2_06_K2Node_ComponentBoundEvent_1_ComponentBeginActorTriggerSignature__DelegateSignature(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function MediumSmallRupuCamp_01.MediumSmallRupuCamp_01_C.BndEvt__Trigger_RC2_06_K2Node_ComponentBoundEvent_1_ComponentBeginActorTriggerSignature__DelegateSignature // (BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__Trigger_RC2_05_K2Node_ComponentBoundEvent_2_ComponentEndActorTriggerSignature__DelegateSignature(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function MediumSmallRupuCamp_01.MediumSmallRupuCamp_01_C.BndEvt__Trigger_RC2_05_K2Node_ComponentBoundEvent_2_ComponentEndActorTriggerSignature__DelegateSignature // (BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__Trigger_RC2_06_K2Node_ComponentBoundEvent_3_ComponentEndActorTriggerSignature__DelegateSignature(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function MediumSmallRupuCamp_01.MediumSmallRupuCamp_01_C.BndEvt__Trigger_RC2_06_K2Node_ComponentBoundEvent_3_ComponentEndActorTriggerSignature__DelegateSignature // (BlueprintEvent) // @ game+0x163f1c0
	void ExecuteUbergraph_MediumSmallRupuCamp_01(int32_t EntryPoint); // Function MediumSmallRupuCamp_01.MediumSmallRupuCamp_01_C.ExecuteUbergraph_MediumSmallRupuCamp_01 // (Final|UbergraphFunction) // @ game+0x163f1c0
};

