// BlueprintGeneratedClass PyramidFinal.PyramidFinal_C
// Size: 0xe98 (Inherited: 0x3f0)
struct APyramidFinal_C : AMistBasePersistentActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3f0(0x08)
	struct ULootableBreakableWoodenBoxComponent_C* LootableBreakableWoodenBoxComponent4; // 0x3f8(0x08)
	struct ULootableBackpackComponent_C* LootableBackpackComponent5; // 0x400(0x08)
	struct ULootableAttackableUrnComponent_C* LootableAttackableUrnComponent8; // 0x408(0x08)
	struct ULootableAttackableUrnComponent_C* LootableAttackableUrnComponent7; // 0x410(0x08)
	struct ULootableBreakableWoodenBoxComponent_C* LootableBreakableWoodenBoxComponent3; // 0x418(0x08)
	struct ULootableBackpackComponent_C* LootableBackpackComponent4; // 0x420(0x08)
	struct ULootableBackpackComponent_C* LootableBackpackComponent3; // 0x428(0x08)
	struct ULootableAttackableUrnComponent_C* LootableAttackableUrnComponent6; // 0x430(0x08)
	struct ULootableBrokenBarrelComponent_C* LootableBrokenBarrelComponent1; // 0x438(0x08)
	struct ULootableAttackableUrnComponent_C* LootableAttackableUrnComponent5; // 0x440(0x08)
	struct ULootableBrokenBarrelComponent_C* LootableBrokenBarrelComponent; // 0x448(0x08)
	struct ULootableBackpackComponent_C* LootableBackpackComponent2; // 0x450(0x08)
	struct ULootableAttackableUrnComponent_C* LootableAttackableUrnComponent4; // 0x458(0x08)
	struct ULootableAttackableUrnComponent_C* LootableAttackableUrnComponent3; // 0x460(0x08)
	struct ULootableBreakableWoodenBoxComponent_C* LootableBreakableWoodenBoxComponent2; // 0x468(0x08)
	struct ULootableAttackableUrnComponent_C* LootableAttackableUrnComponent2; // 0x470(0x08)
	struct ULootableAttackableUrnComponent_C* LootableAttackableUrnComponent1; // 0x478(0x08)
	struct ULootableBackpackComponent_C* LootableBackpackComponent1; // 0x480(0x08)
	struct ULootableBackpackComponent_C* LootableBackpackComponent; // 0x488(0x08)
	struct ULootableBreakableWoodenBoxComponent_C* LootableBreakableWoodenBoxComponent1; // 0x490(0x08)
	struct ULootableAttackableUrnComponent_C* LootableAttackableUrnComponent; // 0x498(0x08)
	struct ULootableBreakableWoodenBoxComponent_C* LootableBreakableWoodenBoxComponent; // 0x4a0(0x08)
	struct UMistLootableMeshComponent* MistLootableMesh4; // 0x4a8(0x08)
	struct UMistMapIconProviderComponent* MistMapIconProvider; // 0x4b0(0x08)
	struct UBoxComponent* AncientCraftingSite; // 0x4b8(0x08)
	struct USceneComponent* RupuSpawn14; // 0x4c0(0x08)
	struct USceneComponent* RupuSpawn13; // 0x4c8(0x08)
	struct USceneComponent* RupuSpawn12; // 0x4d0(0x08)
	struct USceneComponent* RupuSpawn11; // 0x4d8(0x08)
	struct USceneComponent* RupuSpawn10; // 0x4e0(0x08)
	struct USceneComponent* RupuSpawn9; // 0x4e8(0x08)
	struct USceneComponent* RupuSpawn8; // 0x4f0(0x08)
	struct USceneComponent* RupuSpawn7; // 0x4f8(0x08)
	struct USceneComponent* RupuSpawn6; // 0x500(0x08)
	struct USceneComponent* RupuSpawn5; // 0x508(0x08)
	struct USceneComponent* RupuSpawn4; // 0x510(0x08)
	struct USceneComponent* RupuSpawn3; // 0x518(0x08)
	struct USceneComponent* RupuSpawn2; // 0x520(0x08)
	struct USceneComponent* RupuSpawn1; // 0x528(0x08)
	struct USceneComponent* RupuSpawn; // 0x530(0x08)
	struct USceneComponent* RupuSpawns; // 0x538(0x08)
	struct USceneComponent* LootMeshes; // 0x540(0x08)
	struct UGeometryCacheComponent* Particle; // 0x548(0x08)
	struct USceneComponent* Audio; // 0x550(0x08)
	struct UStaticMeshComponent* SM_Skeleton_Pose_017; // 0x558(0x08)
	struct UStaticMeshComponent* SM_Skeleton_Pose_016; // 0x560(0x08)
	struct UStaticMeshComponent* SM_AudioTriggerINT; // 0x568(0x08)
	struct UStaticMeshComponent* SM_AudioTriggerEXT; // 0x570(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_03; // 0x578(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_072; // 0x580(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_051; // 0x588(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_071; // 0x590(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_070; // 0x598(0x08)
	struct UStaticMeshComponent* ST_CatclawAcacia26; // 0x5a0(0x08)
	struct UStaticMeshComponent* ST_CatclawAcacia25; // 0x5a8(0x08)
	struct UStaticMeshComponent* ST_CatclawAcacia24; // 0x5b0(0x08)
	struct UStaticMeshComponent* ST_CatclawAcacia23; // 0x5b8(0x08)
	struct UStaticMeshComponent* ST_CatclawAcacia22; // 0x5c0(0x08)
	struct UStaticMeshComponent* ST_CatclawAcacia21; // 0x5c8(0x08)
	struct UStaticMeshComponent* ST_CatclawAcacia20; // 0x5d0(0x08)
	struct UStaticMeshComponent* SM_PyramidInteriorRocks_03; // 0x5d8(0x08)
	struct UStaticMeshComponent* SM_PyramidInteriorRocks_02; // 0x5e0(0x08)
	struct UStaticMeshComponent* SM_PyramidInteriorRocks_01; // 0x5e8(0x08)
	struct UChildActorComponent* SpawnFallingDownParticle6; // 0x5f0(0x08)
	struct UChildActorComponent* SpawnFallingDownParticle5; // 0x5f8(0x08)
	struct UChildActorComponent* SpawnFallingDownParticle4; // 0x600(0x08)
	struct UChildActorComponent* SpawnFallingDownParticle3; // 0x608(0x08)
	struct UChildActorComponent* SpawnFallingDownParticle7; // 0x610(0x08)
	struct UChildActorComponent* SpawnFallingDownParticle1; // 0x618(0x08)
	struct UChildActorComponent* SpawnFallingDownParticle2; // 0x620(0x08)
	struct UChildActorComponent* ShapeComponentTest; // 0x628(0x08)
	struct UChildActorComponent* SpawnFallingDownParticle; // 0x630(0x08)
	struct UStaticMeshComponent* SM_PyramidTunnels_03; // 0x638(0x08)
	struct UStaticMeshComponent* SM_PyramidTunnels_02; // 0x640(0x08)
	struct UStaticMeshComponent* SM_PyramidTunnels_01; // 0x648(0x08)
	struct UStaticMeshComponent* SM_PyramidInterior_03; // 0x650(0x08)
	struct UStaticMeshComponent* SM_PyramidInterior_02; // 0x658(0x08)
	struct UStaticMeshComponent* SM_PyramidInterior_01; // 0x660(0x08)
	struct UStaticMeshComponent* SM_PyramidInteriorFloor_04; // 0x668(0x08)
	struct UStaticMeshComponent* SM_PyramidInteriorFloor_03; // 0x670(0x08)
	struct UStaticMeshComponent* SM_PyramidInteriorFloor_02; // 0x678(0x08)
	struct UStaticMeshComponent* SM_PyramidInteriorFloor_01; // 0x680(0x08)
	struct UStaticMeshComponent* SM_PyramidRocks; // 0x688(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorShell1; // 0x690(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorFull1; // 0x698(0x08)
	struct UStaticMeshComponent* SM_PyramidInteriorBlocksFloor_01; // 0x6a0(0x08)
	struct UStaticMeshComponent* SM_PyramidCracksLight1; // 0x6a8(0x08)
	struct UStaticMeshComponent* SM_PyramidInteriorBlocksCenter; // 0x6b0(0x08)
	struct UStaticMeshComponent* SM_PyramidInteriorBlocksFloor_03; // 0x6b8(0x08)
	struct UStaticMeshComponent* SM_PyramidInteriorBlocksFloor_02; // 0x6c0(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorDamaged1; // 0x6c8(0x08)
	struct UStaticMeshComponent* SM_PyramidGodlightsTunnels; // 0x6d0(0x08)
	struct UStaticMeshComponent* SM_PyramidGodlightsCenter; // 0x6d8(0x08)
	struct UStaticMeshComponent* SM_PyramidGodlightsCracks; // 0x6e0(0x08)
	struct USceneComponent* MainMeshes; // 0x6e8(0x08)
	struct UStaticMeshComponent* Cone; // 0x6f0(0x08)
	struct UParticleSystemComponent* PS_DustFloating_01_Cone; // 0x6f8(0x08)
	struct USceneComponent* Effects; // 0x700(0x08)
	struct UStaticMeshComponent* SM_PyramidInteriorBlocksCollision; // 0x708(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorFullCollision; // 0x710(0x08)
	struct UStaticMeshComponent* SM_PyramidWallsCollision; // 0x718(0x08)
	struct UStaticMeshComponent* SM_PyramidInteriorCollision; // 0x720(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorShellCollision; // 0x728(0x08)
	struct USceneComponent* Collisions; // 0x730(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_050; // 0x738(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_049; // 0x740(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_048; // 0x748(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_047; // 0x750(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_046; // 0x758(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_045; // 0x760(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_044; // 0x768(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_043; // 0x770(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_042; // 0x778(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_040; // 0x780(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_038; // 0x788(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_037; // 0x790(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_036; // 0x798(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_035; // 0x7a0(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_034; // 0x7a8(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_033; // 0x7b0(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_032; // 0x7b8(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_031; // 0x7c0(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_030; // 0x7c8(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_029; // 0x7d0(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_028; // 0x7d8(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_027; // 0x7e0(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_026; // 0x7e8(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_04; // 0x7f0(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_024; // 0x7f8(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_023; // 0x800(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_022; // 0x808(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_021; // 0x810(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_020; // 0x818(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_019; // 0x820(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_018; // 0x828(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_017; // 0x830(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_016; // 0x838(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_015; // 0x840(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_014; // 0x848(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_013; // 0x850(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_012; // 0x858(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_011; // 0x860(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_010; // 0x868(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_09; // 0x870(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_08; // 0x878(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_07; // 0x880(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_06; // 0x888(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_01; // 0x890(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_02; // 0x898(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_05; // 0x8a0(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_025; // 0x8a8(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_052; // 0x8b0(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_053; // 0x8b8(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_054; // 0x8c0(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_055; // 0x8c8(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_064; // 0x8d0(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_065; // 0x8d8(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_067; // 0x8e0(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_066; // 0x8e8(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_056; // 0x8f0(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_063; // 0x8f8(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_062; // 0x900(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_061; // 0x908(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_060; // 0x910(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_059; // 0x918(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_058; // 0x920(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_057; // 0x928(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorBlock_068; // 0x930(0x08)
	struct USceneComponent* LabirynthParts; // 0x938(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorRocks_12; // 0x940(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorRocks_11; // 0x948(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorRocks_09; // 0x950(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorRocks_08; // 0x958(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorRocks_07; // 0x960(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorRocks_14; // 0x968(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorRocks_05; // 0x970(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorRocks_04; // 0x978(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorRocks_03; // 0x980(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorRocks_02; // 0x988(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorRocks_01; // 0x990(0x08)
	struct UStaticMeshComponent* SM_PyramidExteriorRocks_06; // 0x998(0x08)
	struct USceneComponent* LittleRocks; // 0x9a0(0x08)
	struct UPointLightComponent* PointLight22; // 0x9a8(0x08)
	struct UPointLightComponent* PointLight18; // 0x9b0(0x08)
	struct USpotLightComponent* SpotLight9; // 0x9b8(0x08)
	struct UPointLightComponent* PointLight23; // 0x9c0(0x08)
	struct UPointLightComponent* PointLight3; // 0x9c8(0x08)
	struct UPointLightComponent* PointLight26; // 0x9d0(0x08)
	struct UPointLightComponent* PointLight30; // 0x9d8(0x08)
	struct USpotLightComponent* SpotLight39; // 0x9e0(0x08)
	struct USpotLightComponent* SpotLight38; // 0x9e8(0x08)
	struct USpotLightComponent* SpotLight37; // 0x9f0(0x08)
	struct USpotLightComponent* SpotLight36; // 0x9f8(0x08)
	struct USpotLightComponent* SpotLight35; // 0xa00(0x08)
	struct USpotLightComponent* SpotLight34; // 0xa08(0x08)
	struct USpotLightComponent* SpotLight33; // 0xa10(0x08)
	struct USpotLightComponent* SpotLight32; // 0xa18(0x08)
	struct USpotLightComponent* SpotLight31; // 0xa20(0x08)
	struct USpotLightComponent* SpotLight30; // 0xa28(0x08)
	struct USpotLightComponent* SpotLight29; // 0xa30(0x08)
	struct USpotLightComponent* SpotLight28; // 0xa38(0x08)
	struct USpotLightComponent* SpotLight27; // 0xa40(0x08)
	struct USpotLightComponent* SpotLight26; // 0xa48(0x08)
	struct USpotLightComponent* SpotLight25; // 0xa50(0x08)
	struct USpotLightComponent* SpotLight24; // 0xa58(0x08)
	struct USpotLightComponent* SpotLight40; // 0xa60(0x08)
	struct USpotLightComponent* SpotLight22; // 0xa68(0x08)
	struct USpotLightComponent* SpotLight21; // 0xa70(0x08)
	struct USpotLightComponent* SpotLight20; // 0xa78(0x08)
	struct USpotLightComponent* SpotLight19; // 0xa80(0x08)
	struct USpotLightComponent* SpotLight18; // 0xa88(0x08)
	struct USpotLightComponent* SpotLight17; // 0xa90(0x08)
	struct USpotLightComponent* SpotLight16; // 0xa98(0x08)
	struct USpotLightComponent* SpotLight15; // 0xaa0(0x08)
	struct USpotLightComponent* SpotLight14; // 0xaa8(0x08)
	struct USpotLightComponent* SpotLight13; // 0xab0(0x08)
	struct UPointLightComponent* PointLight28; // 0xab8(0x08)
	struct UPointLightComponent* PointLight27; // 0xac0(0x08)
	struct USpotLightComponent* SpotLight12; // 0xac8(0x08)
	struct USpotLightComponent* SpotLight11; // 0xad0(0x08)
	struct UPointLightComponent* PointLight25; // 0xad8(0x08)
	struct USpotLightComponent* SpotLight10; // 0xae0(0x08)
	struct USpotLightComponent* SpotLight23; // 0xae8(0x08)
	struct USceneComponent* Lights; // 0xaf0(0x08)
	struct UStaticMeshComponent* ST_CatclawAcacia19; // 0xaf8(0x08)
	struct UStaticMeshComponent* ST_CatclawAcacia18; // 0xb00(0x08)
	struct UStaticMeshComponent* ST_CatclawAcacia17; // 0xb08(0x08)
	struct UStaticMeshComponent* ST_CatclawAcacia16; // 0xb10(0x08)
	struct UStaticMeshComponent* ST_CatclawAcacia15; // 0xb18(0x08)
	struct UStaticMeshComponent* ST_CatclawAcacia14; // 0xb20(0x08)
	struct UStaticMeshComponent* ST_CatclawAcacia13; // 0xb28(0x08)
	struct UStaticMeshComponent* ST_CatclawAcacia12; // 0xb30(0x08)
	struct UStaticMeshComponent* ST_CatclawAcacia11; // 0xb38(0x08)
	struct UStaticMeshComponent* SM_PyramidFallPlants; // 0xb40(0x08)
	struct UStaticMeshComponent* ST_CatclawAcacia10; // 0xb48(0x08)
	struct UStaticMeshComponent* ST_CatclawAcacia9; // 0xb50(0x08)
	struct UStaticMeshComponent* ST_CatclawAcacia8; // 0xb58(0x08)
	struct UStaticMeshComponent* ST_CatclawAcacia7; // 0xb60(0x08)
	struct UStaticMeshComponent* ST_CatclawAcacia6; // 0xb68(0x08)
	struct UStaticMeshComponent* ST_CatclawAcacia5; // 0xb70(0x08)
	struct UStaticMeshComponent* ST_CatclawAcacia4; // 0xb78(0x08)
	struct UStaticMeshComponent* ST_CatclawAcacia3; // 0xb80(0x08)
	struct UStaticMeshComponent* SM_DesertBush_04; // 0xb88(0x08)
	struct UStaticMeshComponent* SM_DesertBush_03; // 0xb90(0x08)
	struct UStaticMeshComponent* SM_DesertBush_02; // 0xb98(0x08)
	struct UStaticMeshComponent* SM_DesertBush_01; // 0xba0(0x08)
	struct UStaticMeshComponent* ST_CatclawAcacia2; // 0xba8(0x08)
	struct UStaticMeshComponent* ST_CatclawAcacia1; // 0xbb0(0x08)
	struct UStaticMeshComponent* ST_CatclawAcacia; // 0xbb8(0x08)
	struct UStaticMeshComponent* grass054; // 0xbc0(0x08)
	struct UStaticMeshComponent* grass053; // 0xbc8(0x08)
	struct UStaticMeshComponent* grass052; // 0xbd0(0x08)
	struct UStaticMeshComponent* grass048; // 0xbd8(0x08)
	struct UStaticMeshComponent* grass047; // 0xbe0(0x08)
	struct UStaticMeshComponent* grass046; // 0xbe8(0x08)
	struct UStaticMeshComponent* grass045; // 0xbf0(0x08)
	struct UStaticMeshComponent* grass044; // 0xbf8(0x08)
	struct UStaticMeshComponent* grass043; // 0xc00(0x08)
	struct UStaticMeshComponent* grass042; // 0xc08(0x08)
	struct UStaticMeshComponent* grass041; // 0xc10(0x08)
	struct UStaticMeshComponent* grass040; // 0xc18(0x08)
	struct UStaticMeshComponent* grass027; // 0xc20(0x08)
	struct UStaticMeshComponent* grass026; // 0xc28(0x08)
	struct UStaticMeshComponent* grass025; // 0xc30(0x08)
	struct UStaticMeshComponent* grass024; // 0xc38(0x08)
	struct UStaticMeshComponent* grass023; // 0xc40(0x08)
	struct UStaticMeshComponent* SM_GroundVegetationB_013; // 0xc48(0x08)
	struct UStaticMeshComponent* grass022; // 0xc50(0x08)
	struct UStaticMeshComponent* grass021; // 0xc58(0x08)
	struct UStaticMeshComponent* grass020; // 0xc60(0x08)
	struct UStaticMeshComponent* grass019; // 0xc68(0x08)
	struct UStaticMeshComponent* grass018; // 0xc70(0x08)
	struct UStaticMeshComponent* grass017; // 0xc78(0x08)
	struct UStaticMeshComponent* grass016; // 0xc80(0x08)
	struct UStaticMeshComponent* grass015; // 0xc88(0x08)
	struct UStaticMeshComponent* grass014; // 0xc90(0x08)
	struct UStaticMeshComponent* grass013; // 0xc98(0x08)
	struct UStaticMeshComponent* grass012; // 0xca0(0x08)
	struct UStaticMeshComponent* grass010; // 0xca8(0x08)
	struct UStaticMeshComponent* grass09; // 0xcb0(0x08)
	struct UStaticMeshComponent* SM_GroundVegetationB_012; // 0xcb8(0x08)
	struct UStaticMeshComponent* grass011; // 0xcc0(0x08)
	struct UStaticMeshComponent* SM_GroundVegetationB_011; // 0xcc8(0x08)
	struct UStaticMeshComponent* SM_GroundVegetationB_010; // 0xcd0(0x08)
	struct UStaticMeshComponent* grass08; // 0xcd8(0x08)
	struct UStaticMeshComponent* grass07; // 0xce0(0x08)
	struct UStaticMeshComponent* SM_GroundVegetationB_09; // 0xce8(0x08)
	struct UStaticMeshComponent* SM_GroundVegetationB_08; // 0xcf0(0x08)
	struct UStaticMeshComponent* SM_GroundVegetationB_07; // 0xcf8(0x08)
	struct UStaticMeshComponent* SM_GroundVegetationB_06; // 0xd00(0x08)
	struct UStaticMeshComponent* grass06; // 0xd08(0x08)
	struct UStaticMeshComponent* SM_GroundVegetationB_05; // 0xd10(0x08)
	struct UStaticMeshComponent* SM_GroundVegetationB_04; // 0xd18(0x08)
	struct UStaticMeshComponent* SM_GroundVegetationB_03; // 0xd20(0x08)
	struct UStaticMeshComponent* SM_Skeleton_Pose_015; // 0xd28(0x08)
	struct UStaticMeshComponent* SM_Skeleton_Pose_013; // 0xd30(0x08)
	struct UStaticMeshComponent* SM_Skeleton_Pose_012; // 0xd38(0x08)
	struct UStaticMeshComponent* SM_Skeleton_Pile_010; // 0xd40(0x08)
	struct UStaticMeshComponent* SM_Skeleton_Pose_011; // 0xd48(0x08)
	struct UStaticMeshComponent* SM_Skeleton_Pose_010; // 0xd50(0x08)
	struct UStaticMeshComponent* SM_Skeleton_Pose_09; // 0xd58(0x08)
	struct UStaticMeshComponent* SM_Skeleton_Pose_08; // 0xd60(0x08)
	struct UStaticMeshComponent* SM_Skeleton_Pose_07; // 0xd68(0x08)
	struct UStaticMeshComponent* SM_Skeleton_Pile_09; // 0xd70(0x08)
	struct UStaticMeshComponent* SM_Skeleton_Pose_06; // 0xd78(0x08)
	struct UStaticMeshComponent* SM_Skeleton_Pose_05; // 0xd80(0x08)
	struct UStaticMeshComponent* SM_Skeleton_Pile_08; // 0xd88(0x08)
	struct UStaticMeshComponent* SM_Skeleton_Pose_01; // 0xd90(0x08)
	struct UStaticMeshComponent* SM_Skeleton_Pile_07; // 0xd98(0x08)
	struct UStaticMeshComponent* SM_SkeletonFull_022; // 0xda0(0x08)
	struct UStaticMeshComponent* SM_SkeletonFull_021; // 0xda8(0x08)
	struct UStaticMeshComponent* SM_SkeletonFull_020; // 0xdb0(0x08)
	struct UStaticMeshComponent* SM_SkeletonFull_019; // 0xdb8(0x08)
	struct UStaticMeshComponent* SM_SkeletonFull_018; // 0xdc0(0x08)
	struct UStaticMeshComponent* SM_SkeletonFull_017; // 0xdc8(0x08)
	struct UStaticMeshComponent* SM_SkeletonFull_016; // 0xdd0(0x08)
	struct UStaticMeshComponent* SM_SkeletonFull_015; // 0xdd8(0x08)
	struct UStaticMeshComponent* SM_SkeletonFull_014; // 0xde0(0x08)
	struct UStaticMeshComponent* SM_SkeletonFull_013; // 0xde8(0x08)
	struct UStaticMeshComponent* SM_SkeletonFull_012; // 0xdf0(0x08)
	struct UStaticMeshComponent* SM_SkeletonFull_011; // 0xdf8(0x08)
	struct UStaticMeshComponent* SM_Skeleton_Pile_06; // 0xe00(0x08)
	struct UStaticMeshComponent* SM_Skeleton_Pile_05; // 0xe08(0x08)
	struct UStaticMeshComponent* SM_SkeletonFull_010; // 0xe10(0x08)
	struct UStaticMeshComponent* SM_Skeleton_Pose_03; // 0xe18(0x08)
	struct UStaticMeshComponent* SM_Skeleton_Pose_02; // 0xe20(0x08)
	struct UStaticMeshComponent* SM_SkeletonFull_09; // 0xe28(0x08)
	struct UStaticMeshComponent* SM_SkeletonFull_08; // 0xe30(0x08)
	struct UStaticMeshComponent* SM_SkeletonFull_07; // 0xe38(0x08)
	struct UStaticMeshComponent* SM_SkeletonFull_06; // 0xe40(0x08)
	struct UStaticMeshComponent* SM_SkeletonFull_05; // 0xe48(0x08)
	struct UStaticMeshComponent* SM_SkeletonFull_04; // 0xe50(0x08)
	struct UStaticMeshComponent* SM_SkeletonFull_03; // 0xe58(0x08)
	struct UStaticMeshComponent* SM_SkeletonFull_02; // 0xe60(0x08)
	struct UStaticMeshComponent* SM_SkeletonFull_01; // 0xe68(0x08)
	struct UBoxComponent* PimpingStuff; // 0xe70(0x08)
	struct USceneComponent* Pivot; // 0xe78(0x08)
	struct USceneComponent* Scene1; // 0xe80(0x08)
	bool IsInPyramid; // 0xe88(0x01)
	char pad_E89[0x7]; // 0xe89(0x07)
	struct UAudioComponent* PyramidAmbiance; // 0xe90(0x08)

	void SpawnRupu(struct USceneComponent* Sender); // Function PyramidFinal.PyramidFinal_C.SpawnRupu // (Public|HasDefaults|BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void ApplyDamage(struct USceneComponent* Sender); // Function PyramidFinal.PyramidFinal_C.ApplyDamage // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void NewFunction_1(); // Function PyramidFinal.PyramidFinal_C.NewFunction_1 // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__SpotLight_K2Node_ComponentBoundEvent_0_PhysicsVolumeChanged__DelegateSignature(struct APhysicsVolume* NewVolume); // Function PyramidFinal.PyramidFinal_C.BndEvt__SpotLight_K2Node_ComponentBoundEvent_0_PhysicsVolumeChanged__DelegateSignature // (BlueprintEvent) // @ game+0x163f1c0
