// AnimBlueprintGeneratedClass RupuTurretABP.RupuTurretABP_C
// Size: 0x1f32 (Inherited: 0x270)
struct URupuTurretABP_C : UAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x270(0x08)
	char pad_278[0x8]; // 0x278(0x08)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_2; // 0x280(0x1e0)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x460(0x20)
	struct FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK; // 0x480(0x1e0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0x660(0xa0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18; // 0x700(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17; // 0x728(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16; // 0x750(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15; // 0x778(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14; // 0x7a0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13; // 0x7c8(0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x7f0(0xf0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x8e0(0x30)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x910(0xf0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0xa00(0x30)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12; // 0xa30(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11; // 0xa58(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0xa80(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0xaf8(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0xb70(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0xc10(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0xc40(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0xcb8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0xce8(0xb0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0xd98(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0xe38(0xa0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10; // 0xed8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9; // 0xf00(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0xf28(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0xfa0(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x1018(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x10b8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x10e8(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x1160(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x1190(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x1240(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x12b8(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x1358(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x13f8(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x1470(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x14e8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x1518(0xb0)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0x15c8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0x15f0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0x1618(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x1640(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x1668(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x1690(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x16b8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x16e0(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x1708(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x1780(0x30)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3; // 0x17b0(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x17f8(0x30)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x1828(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x18a0(0x30)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2; // 0x18d0(0x48)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x1918(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x1948(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x19e8(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x1a60(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x1ad8(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x1b08(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x1bb8(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x1c70(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x1c98(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x1d58(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x1d80(0x20)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x1da0(0x30)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x1dd0(0xa0)
	struct FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator; // 0x1e70(0x48)
	bool Jump_L; // 0x1eb8(0x01)
	bool Jump_R; // 0x1eb9(0x01)
	char pad_1EBA[0x2]; // 0x1eba(0x02)
	struct FVector HandR_Loc; // 0x1ebc(0x0c)
	struct FRotator HandR_Rot; // 0x1ec8(0x0c)
	struct FVector HandL_Loc; // 0x1ed4(0x0c)
	struct FRotator HandL_Rot; // 0x1ee0(0x0c)
	float Hand_Alpha_2; // 0x1eec(0x04)
	float Hand_Alpha_3; // 0x1ef0(0x04)
	bool RT_Shot; // 0x1ef4(0x01)
	char pad_1EF5[0x3]; // 0x1ef5(0x03)
	float ShotProgress; // 0x1ef8(0x04)
	bool IdleSwitch; // 0x1efc(0x01)
	char pad_1EFD[0x3]; // 0x1efd(0x03)
	float IK_Alpha_Time; // 0x1f00(0x04)
	char pad_1F04[0x4]; // 0x1f04(0x04)
	struct AAutoTurret_C* TurretBP; // 0x1f08(0x08)
	float Loc_AngularDist; // 0x1f10(0x04)
	float Steps_LR_PR; // 0x1f14(0x04)
	bool HasTarget; // 0x1f18(0x01)
	char pad_1F19[0x3]; // 0x1f19(0x03)
	float LAD_treshold; // 0x1f1c(0x04)
	bool LocLoadinTimer; // 0x1f20(0x01)
	char pad_1F21[0x3]; // 0x1f21(0x03)
	float LocReloadProgress; // 0x1f24(0x04)
	float Loc_Ang_Dist_Tresh; // 0x1f28(0x04)
	bool LocHasAmmo; // 0x1f2c(0x01)
	bool RH_Alpha; // 0x1f2d(0x01)
	bool LH_Alpha; // 0x1f2e(0x01)
	bool NoAmmo_Feedback; // 0x1f2f(0x01)
	bool IsLoaded; // 0x1f30(0x01)
	bool LoadingRock; // 0x1f31(0x01)

	void AnimGraph(struct FPoseLink& AnimGraph); // Function RupuTurretABP.RupuTurretABP_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void L_Hand_Alpha(); // Function RupuTurretABP.RupuTurretABP_C.L_Hand_Alpha // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void R_Hand_Alpha(); // Function RupuTurretABP.RupuTurretABP_C.R_Hand_Alpha // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void L_Hand_FInterpAlpha0(); // Function RupuTurretABP.RupuTurretABP_C.L_Hand_FInterpAlpha0 // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void R_hand_FInterpAlpha0(); // Function RupuTurretABP.RupuTurretABP_C.R_hand_FInterpAlpha0 // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void L_Hand_FInterpAlpha1(); // Function RupuTurretABP.RupuTurretABP_C.L_Hand_FInterpAlpha1 // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void R_hand_FInterpAlpha1(); // Function RupuTurretABP.RupuTurretABP_C.R_hand_FInterpAlpha1 // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void AnimNotify_NoAmmo_Stop(); // Function RupuTurretABP.RupuTurretABP_C.AnimNotify_NoAmmo_Stop // (BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void AnimNotify_NoAmmo_Start(); // Function RupuTurretABP.RupuTurretABP_C.AnimNotify_NoAmmo_Start // (BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RupuTurretABP_AnimGraphNode_TransitionResult_E1D252974F737C93EFB81196AAD3E669(); // Function RupuTurretABP.RupuTurretABP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_RupuTurretABP_AnimGraphNode_TransitionResult_E1D252974F737C93EFB81196AAD3E669 // (BlueprintEvent) // @ game+0x163f1c0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RupuTurretABP_AnimGraphNode_TransitionResult_CB7C0C11463B89F295EC2D99C9AB2AAC(); // Function RupuTurretABP.RupuTurretABP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_RupuTurretABP_AnimGraphNode_TransitionResult_CB7C0C11463B89F295EC2D99C9AB2AAC // (BlueprintEvent) // @ game+0x163f1c0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RupuTurretABP_AnimGraphNode_TransitionResult_A46E5EA3496E420112558183BF60ACB1(); // Function RupuTurretABP.RupuTurretABP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_RupuTurretABP_AnimGraphNode_TransitionResult_A46E5EA3496E420112558183BF60ACB1 // (BlueprintEvent) // @ game+0x163f1c0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RupuTurretABP_AnimGraphNode_TransitionResult_A5A46D1C48340645F91A86A12273C5C0(); // Function RupuTurretABP.RupuTurretABP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_RupuTurretABP_AnimGraphNode_TransitionResult_A5A46D1C48340645F91A86A12273C5C0 // (BlueprintEvent) // @ game+0x163f1c0
	void BlueprintInitializeAnimation(); // Function RupuTurretABP.RupuTurretABP_C.BlueprintInitializeAnimation // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function RupuTurretABP.RupuTurretABP_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RupuTurretABP_AnimGraphNode_TransitionResult_952BBE6E4F465C2DF0BF038F4DC182C2(); // Function RupuTurretABP.RupuTurretABP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_RupuTurretABP_AnimGraphNode_TransitionResult_952BBE6E4F465C2DF0BF038F4DC182C2 // (BlueprintEvent) // @ game+0x163f1c0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RupuTurretABP_AnimGraphNode_SequenceEvaluator_DBD1394840974F1F3E8438BDFD6AEFCB(); // Function RupuTurretABP.RupuTurretABP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_RupuTurretABP_AnimGraphNode_SequenceEvaluator_DBD1394840974F1F3E8438BDFD6AEFCB // (BlueprintEvent) // @ game+0x163f1c0
	void AnimNotify_TurretLoaded(); // Function RupuTurretABP.RupuTurretABP_C.AnimNotify_TurretLoaded // (BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RupuTurretABP_AnimGraphNode_TransitionResult_8778EA6D4E735FC4FB1E1AAED4B7D232(); // Function RupuTurretABP.RupuTurretABP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_RupuTurretABP_AnimGraphNode_TransitionResult_8778EA6D4E735FC4FB1E1AAED4B7D232 // (BlueprintEvent) // @ game+0x163f1c0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RupuTurretABP_AnimGraphNode_TransitionResult_C116997E443466E6D7407BA364E7681A(); // Function RupuTurretABP.RupuTurretABP_C.EvaluateGraphExposedInputs_ExecuteUbergraph_RupuTurretABP_AnimGraphNode_TransitionResult_C116997E443466E6D7407BA364E7681A // (BlueprintEvent) // @ game+0x163f1c0
	void ExecuteUbergraph_RupuTurretABP(int32_t EntryPoint); // Function RupuTurretABP.RupuTurretABP_C.ExecuteUbergraph_RupuTurretABP // (Final|UbergraphFunction|HasDefaults) // @ game+0x163f1c0
};

