// BlueprintGeneratedClass RupuSoundTypeAsset.RupuSoundTypeAsset_C
// Size: 0x78 (Inherited: 0x30)
struct URupuSoundTypeAsset_C : UPrimaryDataAsset {
	struct USoundCue* RupuJog; // 0x30(0x08)
	struct USoundCue* RupuHurtLight; // 0x38(0x08)
	struct USoundCue* RupuHurtMed; // 0x40(0x08)
	struct USoundCue* RupuHurtHeavy; // 0x48(0x08)
	struct USoundCue* RupuDeath; // 0x50(0x08)
	struct USoundCue* RupuAttack; // 0x58(0x08)
	struct USoundCue* RupuGroundHits; // 0x60(0x08)
	struct USoundCue* RupuScream; // 0x68(0x08)
	struct USoundCue* RupuSprint; // 0x70(0x08)
};

