// BlueprintGeneratedClass SkywalkerPassengerSeatChildActor.SkywalkerPassengerSeatChildActor_C
// Size: 0x420 (Inherited: 0x3c0)
struct ASkywalkerPassengerSeatChildActor_C : AActor {
	struct UBoxComponent* Box; // 0x3c0(0x08)
	struct USceneComponent* Detach1; // 0x3c8(0x08)
	struct USceneComponent* Detach; // 0x3d0(0x08)
	struct USceneComponent* Detach2; // 0x3d8(0x08)
	struct USceneComponent* PassengerAttach; // 0x3e0(0x08)
	struct UCameraComponent* Camera; // 0x3e8(0x08)
	struct USceneComponent* RightOffset; // 0x3f0(0x08)
	struct USceneComponent* LeftOffset; // 0x3f8(0x08)
	struct UPlayerCameraSpringArm_C* SpringArm; // 0x400(0x08)
	struct UMistInteractableComponent* PassengerInteractable; // 0x408(0x08)
	struct UMistMannedGimbalControlComponent* PassengerSeatControl; // 0x410(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x418(0x08)
};

