// UserDefinedStruct SLootsiteMeshInfo.SLootSiteMeshInfo
// Size: 0x38 (Inherited: 0x00)
struct FSLootSiteMeshInfo {
	struct FVector LinearVelocity_27_3D0FA81042B02950633217BFC7944F3D; // 0x00(0x0c)
	struct FVector LinearVelocityNoise_28_71AB24384D415F2888F0B5A6C1DDD141; // 0x0c(0x0c)
	float LinearDampen_17_FC4775214FF45080F19C7B9B3D93F4A7; // 0x18(0x04)
	float MinLinearSpeed_29_910C4F8A498B3917BA3D94B43AB5DDDF; // 0x1c(0x04)
	struct FVector AngularVelocity_6_AC5E945C4BC22370F8F53895D849BCDD; // 0x20(0x0c)
	float AngularDampen_19_F5F3B9A844B508BABEBDD5AC42A9A0AF; // 0x2c(0x04)
	float MinAngularSpeed_14_94BB51564781FFA003C3CC926B027C3A; // 0x30(0x04)
	float StopUpdateHeight_23_7CF520E74FBE5F879B4E79B145059528; // 0x34(0x04)
};

