// BlueprintGeneratedClass SmallMonkeyCamp_02.SmallMonkeyCamp_02_C
// Size: 0x5a0 (Inherited: 0x500)
struct ASmallMonkeyCamp_02_C : AMistMobCamp {
	struct UCampTotem_C* CampTotem; // 0x500(0x08)
	struct UStaticMeshComponent* StaticMesh3; // 0x508(0x08)
	struct UStaticMeshComponent* StaticMesh2; // 0x510(0x08)
	struct UStaticMeshComponent* StaticMesh1; // 0x518(0x08)
	struct UStaticMeshComponent* SM_RupuTotemFlags; // 0x520(0x08)
	struct UStaticMeshComponent* SM_RupuCampFlags_02; // 0x528(0x08)
	struct UStaticMeshComponent* SM_RupuCampFlags_03; // 0x530(0x08)
	struct UStaticMeshComponent* SM_RupuCampFlags_04; // 0x538(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh3; // 0x540(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh2; // 0x548(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh1; // 0x550(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh; // 0x558(0x08)
	struct UStaticMeshComponent* SM_RupuTotem; // 0x560(0x08)
	struct UCampChest_C* CampChest1; // 0x568(0x08)
	struct UCampChest_C* CampChest; // 0x570(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x578(0x08)
	struct UStaticMeshComponent* SM_RupuCamp_02; // 0x580(0x08)
	struct UStaticMeshComponent* SM_RupuCamp_03; // 0x588(0x08)
	struct USceneComponent* MobSpawnLocation2; // 0x590(0x08)
	struct USceneComponent* MobSpawnLocation1; // 0x598(0x08)
};

