// BlueprintGeneratedClass TradingStation_LightsMerged.TradingStation_LightsMerged_C
// Size: 0xb28 (Inherited: 0x4b0)
struct ATradingStation_LightsMerged_C : AENV_Lamp_Base_C {
	struct USceneComponent* ENV_Lamp_8_DefaultSceneRoot; // 0x4b0(0x08)
	struct USceneComponent* ENV_Lamp_6_DefaultSceneRoot; // 0x4b8(0x08)
	struct USceneComponent* ENV_Lamp_7_DefaultSceneRoot; // 0x4c0(0x08)
	struct USceneComponent* ENV_Lamp_9_DefaultSceneRoot; // 0x4c8(0x08)
	struct UStaticMeshComponent* ENV_Lamp_7_SM_Lamp04; // 0x4d0(0x08)
	struct UPointLightComponent* ENV_Lamp_7_PointLight1; // 0x4d8(0x08)
	struct UStaticMeshComponent* ENV_Lamp_6_SM_Lamp04; // 0x4e0(0x08)
	struct UPointLightComponent* ENV_Lamp_6_PointLight1; // 0x4e8(0x08)
	struct UNiagaraComponent* ENV_Lamp_6_Niagara; // 0x4f0(0x08)
	struct UNiagaraComponent* ENV_Lamp_7_Niagara; // 0x4f8(0x08)
	struct UPointLightComponent* ENV_Lamp_8_PointLight1; // 0x500(0x08)
	struct UNiagaraComponent* ENV_Lamp_8_Niagara; // 0x508(0x08)
	struct UStaticMeshComponent* ENV_Lamp_8_SM_Lamp04; // 0x510(0x08)
	struct UPointLightComponent* ENV_Lamp_9_PointLight1; // 0x518(0x08)
	struct UNiagaraComponent* ENV_Lamp_9_Niagara; // 0x520(0x08)
	struct UStaticMeshComponent* ENV_Lamp_9_SM_Lamp04; // 0x528(0x08)
	struct UNiagaraComponent* NS_TradingStation_FarLampsGlow_NiagaraComponent0; // 0x530(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable27_SM_Lamp_03_Reel; // 0x538(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable27_NiagaraLampGlow; // 0x540(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable27_SM_Lamp_03_Ropes; // 0x548(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable27_NiagaraLampDustCloud; // 0x550(0x08)
	struct UPointLightComponent* ENV_Lamp_3_Addjustable27_PointLight1; // 0x558(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable27_SM_Lamp_03_Lampshade; // 0x560(0x08)
	struct USceneComponent* ENV_Lamp_3_Addjustable27_DefaultSceneRoot; // 0x568(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable26_SM_Lamp_03_Reel; // 0x570(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable26_NiagaraLampGlow; // 0x578(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable26_SM_Lamp_03_Ropes; // 0x580(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable26_NiagaraLampDustCloud; // 0x588(0x08)
	struct UPointLightComponent* ENV_Lamp_3_Addjustable26_PointLight1; // 0x590(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable26_SM_Lamp_03_Lampshade; // 0x598(0x08)
	struct USceneComponent* ENV_Lamp_3_Addjustable26_DefaultSceneRoot; // 0x5a0(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable25_SM_Lamp_03_Reel; // 0x5a8(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable25_NiagaraLampGlow; // 0x5b0(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable25_SM_Lamp_03_Ropes; // 0x5b8(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable25_NiagaraLampDustCloud; // 0x5c0(0x08)
	struct UPointLightComponent* ENV_Lamp_3_Addjustable25_PointLight1; // 0x5c8(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable25_SM_Lamp_03_Lampshade; // 0x5d0(0x08)
	struct USceneComponent* ENV_Lamp_3_Addjustable25_DefaultSceneRoot; // 0x5d8(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable24_SM_Lamp_03_Reel; // 0x5e0(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable24_NiagaraLampGlow; // 0x5e8(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable24_SM_Lamp_03_Ropes; // 0x5f0(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable24_NiagaraLampDustCloud; // 0x5f8(0x08)
	struct UPointLightComponent* ENV_Lamp_3_Addjustable24_PointLight1; // 0x600(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable24_SM_Lamp_03_Lampshade; // 0x608(0x08)
	struct USceneComponent* ENV_Lamp_3_Addjustable24_DefaultSceneRoot; // 0x610(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable23_SM_Lamp_03_Reel; // 0x618(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable23_NiagaraLampGlow; // 0x620(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable23_SM_Lamp_03_Ropes; // 0x628(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable23_NiagaraLampDustCloud; // 0x630(0x08)
	struct UPointLightComponent* ENV_Lamp_3_Addjustable23_PointLight1; // 0x638(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable23_SM_Lamp_03_Lampshade; // 0x640(0x08)
	struct USceneComponent* ENV_Lamp_3_Addjustable23_DefaultSceneRoot; // 0x648(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable22_SM_Lamp_03_Reel; // 0x650(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable22_NiagaraLampGlow; // 0x658(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable22_SM_Lamp_03_Ropes; // 0x660(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable22_NiagaraLampDustCloud; // 0x668(0x08)
	struct UPointLightComponent* ENV_Lamp_3_Addjustable22_PointLight1; // 0x670(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable22_SM_Lamp_03_Lampshade; // 0x678(0x08)
	struct USceneComponent* ENV_Lamp_3_Addjustable22_DefaultSceneRoot; // 0x680(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable21_SM_Lamp_03_Reel; // 0x688(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable21_NiagaraLampGlow; // 0x690(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable21_SM_Lamp_03_Ropes; // 0x698(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable21_NiagaraLampDustCloud; // 0x6a0(0x08)
	struct UPointLightComponent* ENV_Lamp_3_Addjustable21_PointLight1; // 0x6a8(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable21_SM_Lamp_03_Lampshade; // 0x6b0(0x08)
	struct USceneComponent* ENV_Lamp_3_Addjustable21_DefaultSceneRoot; // 0x6b8(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable20_SM_Lamp_03_Reel; // 0x6c0(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable20_NiagaraLampGlow; // 0x6c8(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable20_SM_Lamp_03_Ropes; // 0x6d0(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable20_NiagaraLampDustCloud; // 0x6d8(0x08)
	struct UPointLightComponent* ENV_Lamp_3_Addjustable20_PointLight1; // 0x6e0(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable20_SM_Lamp_03_Lampshade; // 0x6e8(0x08)
	struct USceneComponent* ENV_Lamp_3_Addjustable20_DefaultSceneRoot; // 0x6f0(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable19_SM_Lamp_03_Reel; // 0x6f8(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable19_NiagaraLampGlow; // 0x700(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable19_SM_Lamp_03_Ropes; // 0x708(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable19_NiagaraLampDustCloud; // 0x710(0x08)
	struct UPointLightComponent* ENV_Lamp_3_Addjustable19_PointLight1; // 0x718(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable19_SM_Lamp_03_Lampshade; // 0x720(0x08)
	struct USceneComponent* ENV_Lamp_3_Addjustable19_DefaultSceneRoot; // 0x728(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable18_SM_Lamp_03_Reel; // 0x730(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable18_NiagaraLampGlow; // 0x738(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable18_SM_Lamp_03_Ropes; // 0x740(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable18_NiagaraLampDustCloud; // 0x748(0x08)
	struct UPointLightComponent* ENV_Lamp_3_Addjustable18_PointLight1; // 0x750(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable18_SM_Lamp_03_Lampshade; // 0x758(0x08)
	struct USceneComponent* ENV_Lamp_3_Addjustable18_DefaultSceneRoot; // 0x760(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable17_SM_Lamp_03_Reel; // 0x768(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable17_NiagaraLampGlow; // 0x770(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable17_SM_Lamp_03_Ropes; // 0x778(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable17_NiagaraLampDustCloud; // 0x780(0x08)
	struct UPointLightComponent* ENV_Lamp_3_Addjustable17_PointLight1; // 0x788(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable17_SM_Lamp_03_Lampshade; // 0x790(0x08)
	struct USceneComponent* ENV_Lamp_3_Addjustable17_DefaultSceneRoot; // 0x798(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable16_SM_Lamp_03_Reel; // 0x7a0(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable16_NiagaraLampGlow; // 0x7a8(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable16_SM_Lamp_03_Ropes; // 0x7b0(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable16_NiagaraLampDustCloud; // 0x7b8(0x08)
	struct UPointLightComponent* ENV_Lamp_3_Addjustable16_PointLight1; // 0x7c0(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable16_SM_Lamp_03_Lampshade; // 0x7c8(0x08)
	struct USceneComponent* ENV_Lamp_3_Addjustable16_DefaultSceneRoot; // 0x7d0(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable15_SM_Lamp_03_Reel; // 0x7d8(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable15_NiagaraLampGlow; // 0x7e0(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable15_SM_Lamp_03_Ropes; // 0x7e8(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable15_NiagaraLampDustCloud; // 0x7f0(0x08)
	struct UPointLightComponent* ENV_Lamp_3_Addjustable15_PointLight1; // 0x7f8(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable15_SM_Lamp_03_Lampshade; // 0x800(0x08)
	struct USceneComponent* ENV_Lamp_3_Addjustable15_DefaultSceneRoot; // 0x808(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable14_SM_Lamp_03_Reel; // 0x810(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable14_NiagaraLampGlow; // 0x818(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable14_SM_Lamp_03_Ropes; // 0x820(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable14_NiagaraLampDustCloud; // 0x828(0x08)
	struct UPointLightComponent* ENV_Lamp_3_Addjustable14_PointLight1; // 0x830(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable14_SM_Lamp_03_Lampshade; // 0x838(0x08)
	struct USceneComponent* ENV_Lamp_3_Addjustable14_DefaultSceneRoot; // 0x840(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable13_SM_Lamp_03_Reel; // 0x848(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable13_NiagaraLampGlow; // 0x850(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable13_SM_Lamp_03_Ropes; // 0x858(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable13_NiagaraLampDustCloud; // 0x860(0x08)
	struct UPointLightComponent* ENV_Lamp_3_Addjustable13_PointLight1; // 0x868(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable13_SM_Lamp_03_Lampshade; // 0x870(0x08)
	struct USceneComponent* ENV_Lamp_3_Addjustable13_DefaultSceneRoot; // 0x878(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable12_SM_Lamp_03_Reel; // 0x880(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable12_NiagaraLampGlow; // 0x888(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable12_SM_Lamp_03_Ropes; // 0x890(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable12_NiagaraLampDustCloud; // 0x898(0x08)
	struct UPointLightComponent* ENV_Lamp_3_Addjustable12_PointLight1; // 0x8a0(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable12_SM_Lamp_03_Lampshade; // 0x8a8(0x08)
	struct USceneComponent* ENV_Lamp_3_Addjustable12_DefaultSceneRoot; // 0x8b0(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable11_SM_Lamp_03_Reel; // 0x8b8(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable11_NiagaraLampGlow; // 0x8c0(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable11_SM_Lamp_03_Ropes; // 0x8c8(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable11_NiagaraLampDustCloud; // 0x8d0(0x08)
	struct UPointLightComponent* ENV_Lamp_3_Addjustable11_PointLight1; // 0x8d8(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable11_SM_Lamp_03_Lampshade; // 0x8e0(0x08)
	struct USceneComponent* ENV_Lamp_3_Addjustable11_DefaultSceneRoot; // 0x8e8(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable10_SM_Lamp_03_Reel; // 0x8f0(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable10_NiagaraLampGlow; // 0x8f8(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable10_SM_Lamp_03_Ropes; // 0x900(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable10_NiagaraLampDustCloud; // 0x908(0x08)
	struct UPointLightComponent* ENV_Lamp_3_Addjustable10_PointLight1; // 0x910(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable10_SM_Lamp_03_Lampshade; // 0x918(0x08)
	struct USceneComponent* ENV_Lamp_3_Addjustable10_DefaultSceneRoot; // 0x920(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable9_SM_Lamp_03_Reel; // 0x928(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable9_NiagaraLampGlow; // 0x930(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable9_SM_Lamp_03_Ropes; // 0x938(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable9_NiagaraLampDustCloud; // 0x940(0x08)
	struct UPointLightComponent* ENV_Lamp_3_Addjustable9_PointLight1; // 0x948(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable9_SM_Lamp_03_Lampshade; // 0x950(0x08)
	struct USceneComponent* ENV_Lamp_3_Addjustable9_DefaultSceneRoot; // 0x958(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable8_SM_Lamp_03_Reel; // 0x960(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable8_NiagaraLampGlow; // 0x968(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable8_SM_Lamp_03_Ropes; // 0x970(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable8_NiagaraLampDustCloud; // 0x978(0x08)
	struct UPointLightComponent* ENV_Lamp_3_Addjustable8_PointLight1; // 0x980(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable8_SM_Lamp_03_Lampshade; // 0x988(0x08)
	struct USceneComponent* ENV_Lamp_3_Addjustable8_DefaultSceneRoot; // 0x990(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable7_SM_Lamp_03_Reel; // 0x998(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable7_NiagaraLampGlow; // 0x9a0(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable7_SM_Lamp_03_Ropes; // 0x9a8(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable7_NiagaraLampDustCloud; // 0x9b0(0x08)
	struct UPointLightComponent* ENV_Lamp_3_Addjustable7_PointLight1; // 0x9b8(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable7_SM_Lamp_03_Lampshade; // 0x9c0(0x08)
	struct USceneComponent* ENV_Lamp_3_Addjustable7_DefaultSceneRoot; // 0x9c8(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable6_SM_Lamp_03_Reel; // 0x9d0(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable6_NiagaraLampGlow; // 0x9d8(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable6_SM_Lamp_03_Ropes; // 0x9e0(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable6_NiagaraLampDustCloud; // 0x9e8(0x08)
	struct UPointLightComponent* ENV_Lamp_3_Addjustable6_PointLight1; // 0x9f0(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable6_SM_Lamp_03_Lampshade; // 0x9f8(0x08)
	struct USceneComponent* ENV_Lamp_3_Addjustable6_DefaultSceneRoot; // 0xa00(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable5_SM_Lamp_03_Reel; // 0xa08(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable5_NiagaraLampGlow; // 0xa10(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable5_SM_Lamp_03_Ropes; // 0xa18(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable5_NiagaraLampDustCloud; // 0xa20(0x08)
	struct UPointLightComponent* ENV_Lamp_3_Addjustable5_PointLight1; // 0xa28(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable5_SM_Lamp_03_Lampshade; // 0xa30(0x08)
	struct USceneComponent* ENV_Lamp_3_Addjustable5_DefaultSceneRoot; // 0xa38(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable4_SM_Lamp_03_Reel; // 0xa40(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable4_NiagaraLampGlow; // 0xa48(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable4_SM_Lamp_03_Ropes; // 0xa50(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable4_NiagaraLampDustCloud; // 0xa58(0x08)
	struct UPointLightComponent* ENV_Lamp_3_Addjustable4_PointLight1; // 0xa60(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable4_SM_Lamp_03_Lampshade; // 0xa68(0x08)
	struct USceneComponent* ENV_Lamp_3_Addjustable4_DefaultSceneRoot; // 0xa70(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable3_SM_Lamp_03_Reel; // 0xa78(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable3_NiagaraLampGlow; // 0xa80(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable3_SM_Lamp_03_Ropes; // 0xa88(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable3_NiagaraLampDustCloud; // 0xa90(0x08)
	struct UPointLightComponent* ENV_Lamp_3_Addjustable3_PointLight1; // 0xa98(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable3_SM_Lamp_03_Lampshade; // 0xaa0(0x08)
	struct USceneComponent* ENV_Lamp_3_Addjustable3_DefaultSceneRoot; // 0xaa8(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable2_SM_Lamp_03_Reel; // 0xab0(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable2_NiagaraLampGlow; // 0xab8(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable2_SM_Lamp_03_Ropes; // 0xac0(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable2_NiagaraLampDustCloud; // 0xac8(0x08)
	struct UPointLightComponent* ENV_Lamp_3_Addjustable2_PointLight1; // 0xad0(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable2_SM_Lamp_03_Lampshade; // 0xad8(0x08)
	struct USceneComponent* ENV_Lamp_3_Addjustable2_DefaultSceneRoot; // 0xae0(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable_SM_Lamp_03_Reel; // 0xae8(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable_NiagaraLampGlow; // 0xaf0(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable_SM_Lamp_03_Ropes; // 0xaf8(0x08)
	struct UNiagaraComponent* ENV_Lamp_3_Addjustable_NiagaraLampDustCloud; // 0xb00(0x08)
	struct UPointLightComponent* ENV_Lamp_3_Addjustable_PointLight1; // 0xb08(0x08)
	struct UStaticMeshComponent* ENV_Lamp_3_Addjustable_SM_Lamp_03_Lampshade; // 0xb10(0x08)
	struct USceneComponent* ENV_Lamp_3_Addjustable_DefaultSceneRoot; // 0xb18(0x08)
	struct USceneComponent* Actor_DefaultSceneRoot; // 0xb20(0x08)
};

