// BlueprintGeneratedClass WalkerGraveyard.WalkerGraveyard_C
// Size: 0x870 (Inherited: 0x3f0)
struct AWalkerGraveyard_C : AMistBasePersistentActor {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x3f0(0x08)
	struct UAudioComponent* Audio15; // 0x3f8(0x08)
	struct UAudioComponent* Audio14; // 0x400(0x08)
	struct UAudioComponent* Audio13; // 0x408(0x08)
	struct UAudioComponent* Audio12; // 0x410(0x08)
	struct UAudioComponent* Audio11; // 0x418(0x08)
	struct UAudioComponent* Audio10; // 0x420(0x08)
	struct UAudioComponent* Audio9; // 0x428(0x08)
	struct UAudioComponent* Audio8; // 0x430(0x08)
	struct UAudioComponent* Audio7; // 0x438(0x08)
	struct UAudioComponent* Audio6; // 0x440(0x08)
	struct UAudioComponent* Audio5; // 0x448(0x08)
	struct UAudioComponent* Audio4; // 0x450(0x08)
	struct UAudioComponent* Audio3; // 0x458(0x08)
	struct UAudioComponent* Audio2; // 0x460(0x08)
	struct UAudioComponent* Audio1; // 0x468(0x08)
	struct UAudioComponent* Audio0; // 0x470(0x08)
	struct UAudioComponent* WingFlapsPosition2; // 0x478(0x08)
	struct UAudioComponent* WingMechPosition2; // 0x480(0x08)
	struct USphereComponent* SoundTrigger12; // 0x488(0x08)
	struct UAudioComponent* WingFlapsPosition1; // 0x490(0x08)
	struct UAudioComponent* WingMechPosition1; // 0x498(0x08)
	struct USphereComponent* SoundTrigger; // 0x4a0(0x08)
	struct UAudioComponent* WingFlapsPosition; // 0x4a8(0x08)
	struct UAudioComponent* WingMechPosition; // 0x4b0(0x08)
	struct ULootableBrokenBarrelComponent_C* LootablePackageComponent_06; // 0x4b8(0x08)
	struct UMistMapIconProviderComponent* MistMapIconProvider; // 0x4c0(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_15; // 0x4c8(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_24; // 0x4d0(0x08)
	struct UStaticMeshComponent* BoxCollision_01; // 0x4d8(0x08)
	struct UStaticMeshComponent* SM_Heavylegs_03; // 0x4e0(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_23; // 0x4e8(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_22; // 0x4f0(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_16; // 0x4f8(0x08)
	struct UStaticMeshComponent* SM_CaravelaWalkerBackDeckFrame_01; // 0x500(0x08)
	struct UBoxComponent* WalkerGraveyard; // 0x508(0x08)
	struct UStaticMeshComponent* SM_SmallWalkerDestructable29_04; // 0x510(0x08)
	struct UStaticMeshComponent* SM_DestroyedWalker_04; // 0x518(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_08; // 0x520(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_07; // 0x528(0x08)
	struct USceneComponent* Lootable; // 0x530(0x08)
	struct ULootableBrokenBarrelComponent_C* LootablePackageComponent_04; // 0x538(0x08)
	struct ULootableBrokenBarrelComponent_C* LootablePackageComponent_03; // 0x540(0x08)
	struct ULootableBackpackComponent_C* LootableBagComponent_03; // 0x548(0x08)
	struct ULootableSkeletonComponent_C* LootableHumanRemains_02_Component_02; // 0x550(0x08)
	struct ULootableBreakableWoodenBoxComponent_C* LootableBreakableOldChestComponent_06; // 0x558(0x08)
	struct ULootableBreakableWoodenBoxComponent_C* LootableBreakableOldChestComponent_05; // 0x560(0x08)
	struct ULootableBackpackComponent_C* LootableBagComponent_02; // 0x568(0x08)
	struct ULootableBreakableWoodenBoxComponent_C* LootableBreakableOldChestComponent_04; // 0x570(0x08)
	struct ULootableBrokenBarrelComponent_C* LootablePackageComponent_02; // 0x578(0x08)
	struct ULootableSkeletonComponent_C* LootableHumanRemains_01_Component_02; // 0x580(0x08)
	struct ULootableBreakableWoodenBoxComponent_C* LootableBreakableOldChestComponent_03; // 0x588(0x08)
	struct ULootableBreakableWoodenBoxComponent_C* LootableBreakableOldChestComponent_02; // 0x590(0x08)
	struct ULootableBreakableWoodenBoxComponent_C* LootableBreakableOldChestComponent_07; // 0x598(0x08)
	struct ULootableBrokenBarrelComponent_C* LootablePackageComponent_05; // 0x5a0(0x08)
	struct ULootableBackpackComponent_C* LootableBagComponent_01; // 0x5a8(0x08)
	struct ULootableBrokenBarrelComponent_C* LootablePackageComponent_01; // 0x5b0(0x08)
	struct UStaticMeshComponent* SM_SmallWalkerDestructable29_01; // 0x5b8(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_03; // 0x5c0(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_13; // 0x5c8(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_01; // 0x5d0(0x08)
	struct ULootableSkeletonComponent_C* LootableHumanRemains_02_Component_01; // 0x5d8(0x08)
	struct UStaticMeshComponent* SM_DestroyedWalker_01; // 0x5e0(0x08)
	struct UStaticMeshComponent* SM_Heavylegs_02; // 0x5e8(0x08)
	struct UStaticMeshComponent* SM_WormwalkerCabinBraid_02; // 0x5f0(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_14; // 0x5f8(0x08)
	struct UStaticMeshComponent* SM_TradingStationScaffoldingBig_01_04; // 0x600(0x08)
	struct UStaticMeshComponent* SM_TradingStationScaffoldingBig_01_03; // 0x608(0x08)
	struct UStaticMeshComponent* SM_TradingStationScaffoldingBig_01_02; // 0x610(0x08)
	struct UStaticMeshComponent* SM_TradingStationDockArmDown_02; // 0x618(0x08)
	struct UStaticMeshComponent* SM_SecondTierWalker_02; // 0x620(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_09; // 0x628(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_06; // 0x630(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_05; // 0x638(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_04; // 0x640(0x08)
	struct UStaticMeshComponent* SM_TradingStationScaffoldingBig_01_01; // 0x648(0x08)
	struct UStaticMeshComponent* SM_HotspotKitbashElement_ThreeSticks_01_07; // 0x650(0x08)
	struct UStaticMeshComponent* SM_CaravelaWalkerBckDeckFloor_01; // 0x658(0x08)
	struct UStaticMeshComponent* SM_ShufflerWalker_02; // 0x660(0x08)
	struct UStaticMeshComponent* SM_TradingStationDockArmDown_01; // 0x668(0x08)
	struct UStaticMeshComponent* SM_ShufflerWalker_01; // 0x670(0x08)
	struct USkeletalMeshComponent* A_Wing_NC_Mountain_Slower_01; // 0x678(0x08)
	struct UStaticMeshComponent* SM_WormwalkerCabinBraid_03; // 0x680(0x08)
	struct UStaticMeshComponent* SM_DestroyedWalker_02; // 0x688(0x08)
	struct UStaticMeshComponent* SM_HotspotKitbashElement_ThreeSticks_01_06; // 0x690(0x08)
	struct UStaticMeshComponent* SM_SmallWalkerDestructable29_02; // 0x698(0x08)
	struct UStaticMeshComponent* SM_SmallWalkerDestructable29_03; // 0x6a0(0x08)
	struct USceneComponent* Scene11; // 0x6a8(0x08)
	struct USceneComponent* Scene10; // 0x6b0(0x08)
	struct USceneComponent* Scene9; // 0x6b8(0x08)
	struct USceneComponent* Scene8; // 0x6c0(0x08)
	struct UStaticMeshComponent* SM_TradingStationScaffoldingBig_01_05; // 0x6c8(0x08)
	struct UStaticMeshComponent* SM_TradingStationScaffoldingBig_01_06; // 0x6d0(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_02; // 0x6d8(0x08)
	struct UStaticMeshComponent* SM_Heavylegs_01; // 0x6e0(0x08)
	struct UStaticMeshComponent* SM_WormwalkerCabinBraid_01; // 0x6e8(0x08)
	struct UStaticMeshComponent* SM_SmallWalkerDestructable29_05; // 0x6f0(0x08)
	struct UStaticMeshComponent* SM_DestroyedWalker_05; // 0x6f8(0x08)
	struct ULootableSkeletonComponent_C* LootableHumanRemains_01_Component_01; // 0x700(0x08)
	struct UStaticMeshComponent* SM_SmallWalkerDestructable29_08; // 0x708(0x08)
	struct UStaticMeshComponent* SM_SmallWalkerDestructable29_09; // 0x710(0x08)
	struct UStaticMeshComponent* SM_HotspotKitbashElement_ThreeSticks_01_01; // 0x718(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_21; // 0x720(0x08)
	struct UStaticMeshComponent* SM_HotspotKitbashElement_ThreeSticks_01_05; // 0x728(0x08)
	struct UStaticMeshComponent* SM_HotspotKitbashElement_ThreeSticks_01_04; // 0x730(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_20; // 0x738(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_19; // 0x740(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_17; // 0x748(0x08)
	struct UStaticMeshComponent* SM_Heavylegs_05; // 0x750(0x08)
	struct USkeletalMeshComponent* SK_Wing_NC_Mountain_03; // 0x758(0x08)
	struct USkeletalMeshComponent* SK_Wing_NC_Mountain_02; // 0x760(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_18; // 0x768(0x08)
	struct UStaticMeshComponent* SM_SecondTierWalker_03; // 0x770(0x08)
	struct UStaticMeshComponent* SM_TradingStationBladeBase_11; // 0x778(0x08)
	struct UStaticMeshComponent* SM_DestroyedWalker_03; // 0x780(0x08)
	struct UStaticMeshComponent* SM_Heavylegs_04; // 0x788(0x08)
	struct UStaticMeshComponent* SM_SecondTierWalker_01; // 0x790(0x08)
	struct UStaticMeshComponent* SM_HotspotKitbashElement_ThreeSticks_01_03; // 0x798(0x08)
	struct ULootableBreakableWoodenBoxComponent_C* LootableBreakableOldChestComponent_01; // 0x7a0(0x08)
	struct UStaticMeshComponent* SM_WormwalkerCabinBraid_04; // 0x7a8(0x08)
	struct USceneComponent* Scene7; // 0x7b0(0x08)
	struct USceneComponent* Scene6; // 0x7b8(0x08)
	struct USceneComponent* Scene5; // 0x7c0(0x08)
	struct UStaticMeshComponent* SM_SmallWalkerDestructable29_11; // 0x7c8(0x08)
	struct USceneComponent* Scene4; // 0x7d0(0x08)
	struct USceneComponent* Scene3; // 0x7d8(0x08)
	struct UStaticMeshComponent* SM_SmallWalkerDestructable29_07; // 0x7e0(0x08)
	struct UStaticMeshComponent* SM_SmallWalkerDestructable29_06; // 0x7e8(0x08)
	struct UStaticMeshComponent* SM_HotspotKitbashElement_ThreeSticks_01_02; // 0x7f0(0x08)
	struct UStaticMeshComponent* SM_WormwalkerCabinBraid_05; // 0x7f8(0x08)
	struct UStaticMeshComponent* SM_CaravelaWalkerBackDeckFrame_02; // 0x800(0x08)
	struct UStaticMeshComponent* SM_Heavylegs_06; // 0x808(0x08)
	struct UStaticMeshComponent* SM_TradingStationScaffoldingBig_01_07; // 0x810(0x08)
	struct USceneComponent* Scene2; // 0x818(0x08)
	struct UMistWorldObjectAdjustmentsComponent* MistWorldObjectAdjustments; // 0x820(0x08)
	struct USceneComponent* Scene1; // 0x828(0x08)
	struct USceneComponent* Scene; // 0x830(0x08)
	struct USceneComponent* DefaultSceneRoot; // 0x838(0x08)
	struct UAudioComponent* WingFlaps; // 0x840(0x08)
	struct UAudioComponent* WingMech; // 0x848(0x08)
	struct UAudioComponent* WingFlaps1; // 0x850(0x08)
	struct UAudioComponent* WingMech1; // 0x858(0x08)
	struct UAudioComponent* WingFlaps2; // 0x860(0x08)
	struct UAudioComponent* WingMech2; // 0x868(0x08)

	void ReceiveBeginPlay(); // Function WalkerGraveyard.WalkerGraveyard_C.ReceiveBeginPlay // (Event|Protected|BlueprintEvent) // @ game+0x163f1c0
	void AudioCreakTrigger(); // Function WalkerGraveyard.WalkerGraveyard_C.AudioCreakTrigger // (BlueprintCallable|BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__SoundTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginActorTriggerSignature__DelegateSignature(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function WalkerGraveyard.WalkerGraveyard_C.BndEvt__SoundTrigger_K2Node_ComponentBoundEvent_3_ComponentBeginActorTriggerSignature__DelegateSignature // (BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__SoundTrigger_K2Node_ComponentBoundEvent_4_ComponentEndActorTriggerSignature__DelegateSignature(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function WalkerGraveyard.WalkerGraveyard_C.BndEvt__SoundTrigger_K2Node_ComponentBoundEvent_4_ComponentEndActorTriggerSignature__DelegateSignature // (BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__SoundTrigger1_K2Node_ComponentBoundEvent_0_ComponentBeginActorTriggerSignature__DelegateSignature(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function WalkerGraveyard.WalkerGraveyard_C.BndEvt__SoundTrigger1_K2Node_ComponentBoundEvent_0_ComponentBeginActorTriggerSignature__DelegateSignature // (BlueprintEvent) // @ game+0x163f1c0
	void BndEvt__SoundTrigger12_K2Node_ComponentBoundEvent_1_ComponentEndActorTriggerSignature__DelegateSignature(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function WalkerGraveyard.WalkerGraveyard_C.BndEvt__SoundTrigger12_K2Node_ComponentBoundEvent_1_ComponentEndActorTriggerSignature__DelegateSignature // (BlueprintEvent) // @ game+0x163f1c0
	void ExecuteUbergraph_WalkerGraveyard(int32_t EntryPoint); // Function WalkerGraveyard.WalkerGraveyard_C.ExecuteUbergraph_WalkerGraveyard // (Final|UbergraphFunction|HasDefaults) // @ game+0x163f1c0
};

