// BlueprintGeneratedClass WormTrader.WormTrader_C
// Size: 0x510 (Inherited: 0x408)
struct AWormTrader_C : ATrader_C {
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_PlamTree_03; // 0x408(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_PlamTree_02; // 0x410(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_PlamTree_01; // 0x418(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_PlamTree_04; // 0x420(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_01; // 0x428(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_02; // 0x430(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_03; // 0x438(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_04; // 0x440(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_05; // 0x448(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_06; // 0x450(0x08)
	struct UMistHarvestableMeshComponent* MistHarvestableMesh_Bush_07; // 0x458(0x08)
	struct UMistWorldObjectAdjustmentsComponent* MistWorldObjectAdjustments; // 0x460(0x08)
	struct UStaticMeshComponent* SM_RupuPile5_StaticMeshComponent0; // 0x468(0x08)
	struct UStaticMeshComponent* SM_RupuPile4_StaticMeshComponent0; // 0x470(0x08)
	struct UStaticMeshComponent* SM_RupuPile3_StaticMeshComponent0; // 0x478(0x08)
	struct UStaticMeshComponent* SM_RupuPile2_StaticMeshComponent0; // 0x480(0x08)
	struct UStaticMeshComponent* SM_Plank_Broken_4_StaticMeshComponent0; // 0x488(0x08)
	struct UStaticMeshComponent* SM_Plank_Broken_3_StaticMeshComponent0; // 0x490(0x08)
	struct UStaticMeshComponent* SM_Plank_Broken_02_StaticMeshComponent0; // 0x498(0x08)
	struct UStaticMeshComponent* SM_Plank_Broken_01_StaticMeshComponent0; // 0x4a0(0x08)
	struct UStaticMeshComponent* SM_LegsAttachmentLeft3_StaticMeshComponent0; // 0x4a8(0x08)
	struct UStaticMeshComponent* crate_a_StaticMeshComponent0; // 0x4b0(0x08)
	struct UStaticMeshComponent* crate_b_top_StaticMeshComponent0; // 0x4b8(0x08)
	struct UStaticMeshComponent* crate_b_StaticMeshComponent0; // 0x4c0(0x08)
	struct UStaticMeshComponent* crate_a3_StaticMeshComponent0; // 0x4c8(0x08)
	struct UStaticMeshComponent* crate_a2_StaticMeshComponent0; // 0x4d0(0x08)
	struct UStaticMeshComponent* Stand_c_StaticMeshComponent0; // 0x4d8(0x08)
	struct UNiagaraComponent* Niagara; // 0x4e0(0x08)
	struct UMistContainerComponent* Inputs; // 0x4e8(0x08)
	struct UMistContainerComponent* Outputs; // 0x4f0(0x08)
	struct UMistCraftingStationComponent* CraftingStation; // 0x4f8(0x08)
	struct USceneComponent* Flare2; // 0x500(0x08)
	struct USceneComponent* Flare1; // 0x508(0x08)
};

