#pragma once
#include "Foliage_classes.h"
#include "Mist_struct.h"
#include "UMG_classes.h"
#include "AIModule_classes.h"
#include "LevelSequence_classes.h"
#include "MinimapPlugin_classes.h"
#include "AnimationBudgetAllocator_classes.h"
#include "ReplicationGraph_classes.h"
#include "AssetRegistry_struct.h"


// Class Mist.MistEffectManagerBase
// Size: 0x3c8 (Inherited: 0x3c0)
struct AMistEffectManagerBase : AActor {
	float SkipUpdatesPlayerSpeedThreshold; // 0x3c0(0x04)
	bool bIgnoreSkippingUpdates; // 0x3c4(0x01)
	char pad_3C5[0x3]; // 0x3c5(0x03)
};

// Class Mist.AmbientEffectManager
// Size: 0x4b0 (Inherited: 0x3c8)
struct AAmbientEffectManager : AMistEffectManagerBase {
	struct TMap<struct FName, struct FFoliageParticleData> FoliageParticleData; // 0x3c8(0x50)
	struct TArray<struct FFoliageParticleInstanceData> FoliageParticleInstanceData; // 0x418(0x10)
	struct TMap<struct FName, struct FFoliageSoundData> FoliageSoundData; // 0x428(0x50)
	struct TArray<struct FFoliageSoundInstanceData> FoliageSoundInstanceData; // 0x478(0x10)
	float UpdateFrequencyRateSound; // 0x488(0x04)
	float UpdateFrequencyRateEmitters; // 0x48c(0x04)
	char pad_490[0x18]; // 0x490(0x18)
	struct UMistWeightMapCacheComponent* WeightMapCacheComponent; // 0x4a8(0x08)
};

// Class Mist.MistFoliageComponent
// Size: 0xca0 (Inherited: 0x9f0)
struct UMistFoliageComponent : UFoliageInstancedStaticMeshComponent {
	char pad_9F0[0x70]; // 0x9f0(0x70)
	struct UStaticMeshComponent* HighlightMeshComponent; // 0xa60(0x08)
	struct FText InteractionTextDisplay; // 0xa68(0x18)
	bool bCollisionOnClientOnly; // 0xa80(0x01)
	bool bDestructibleByRamming; // 0xa81(0x01)
	bool bRespawn; // 0xa82(0x01)
	char pad_A83[0x1]; // 0xa83(0x01)
	float RespawnInMin; // 0xa84(0x04)
	float RespawnInMax; // 0xa88(0x04)
	float RespawnDistanceFromActivePlayers; // 0xa8c(0x04)
	struct TArray<struct FMistFoliageHarvestingEntry> HarvestingEntries; // 0xa90(0x10)
	struct FMistInteractableProperties InteractableProperties; // 0xaa0(0x14)
	float MaxHealth; // 0xab4(0x04)
	float Armor; // 0xab8(0x04)
	char pad_ABC[0x4]; // 0xabc(0x04)
	struct UParticleSystem* ParticleSystem; // 0xac0(0x08)
	struct USoundBase* Sound; // 0xac8(0x08)
	char pad_AD0[0x70]; // 0xad0(0x70)
	struct TSet<int32_t> RemovedInstances; // 0xb40(0x50)
	struct AActor* ClientInstanceDestroyedActorClass; // 0xb90(0x08)
	char pad_B98[0xb0]; // 0xb98(0xb0)
	struct TMap<int32_t, struct AActor*> ServerInstanceActors; // 0xc48(0x50)
	char pad_C98[0x8]; // 0xc98(0x08)

	void SetInstanceValue(int32_t InstanceIndex, float Value); // Function Mist.MistFoliageComponent.SetInstanceValue // (Final|Native|Public|BlueprintCallable) // @ game+0x10fb5e0
	struct FHitResult ReplaceWithActorOnHit(struct AActor* ReplacementActor, struct FHitResult& OriginalImpact); // Function Mist.MistFoliageComponent.ReplaceWithActorOnHit // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x10fb460
	struct AActor* ReplaceWithActor(struct AActor* ReplacementActor, int32_t Item); // Function Mist.MistFoliageComponent.ReplaceWithActor // (Final|Native|Public|BlueprintCallable) // @ game+0x10fb3a0
	void ReceiveInteract(struct FMistInteraction& Interaction); // Function Mist.MistFoliageComponent.ReceiveInteract // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x163f1c0
	void ReceiveEndInteract(struct FMistInteraction& Interaction, bool bCanceled); // Function Mist.MistFoliageComponent.ReceiveEndInteract // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x163f1c0
	void ReceiveBeginInteract(struct FMistInteraction& Interaction); // Function Mist.MistFoliageComponent.ReceiveBeginInteract // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x163f1c0
	void OnInstanceReplacedWithActor(struct AActor* ReplacementActor); // Function Mist.MistFoliageComponent.OnInstanceReplacedWithActor // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void MulticastPlayEffects(struct FVector Location); // Function Mist.MistFoliageComponent.MulticastPlayEffects // (Final|Net|Native|Event|NetMulticast|Private|HasDefaults) // @ game+0x10fb2d0
	float ModifyDamage(float Damage, struct UDamageType* DamageType, struct AActor* DamageCauser); // Function Mist.MistFoliageComponent.ModifyDamage // (Native|Event|Public|BlueprintEvent) // @ game+0x10fb1c0
	void HandleRadialDamage(struct UPrimitiveComponent* DamagedComponent, float Damage, struct UDamageType* DamageType, struct FVector Origin, struct FDamageSource& DamageSource, struct FHitResult& Hit); // Function Mist.MistFoliageComponent.HandleRadialDamage // (Final|Native|Private|HasOutParms|HasDefaults) // @ game+0x10faf40
	void HandlePointDamage(struct UPrimitiveComponent* DamagedComponent, float Damage, struct UDamageType* DamageType, struct FDamageSource& DamageSource, struct FHitResult& Hit); // Function Mist.MistFoliageComponent.HandlePointDamage // (Final|Native|Private|HasOutParms) // @ game+0x10fad50
	struct AActor* GetReplacedActor(int32_t Item); // Function Mist.MistFoliageComponent.GetReplacedActor // (Final|Native|Public|BlueprintCallable) // @ game+0x10faba0
	float GetInstanceValue(int32_t InstanceIndex); // Function Mist.MistFoliageComponent.GetInstanceValue // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10faa40
	struct FTransform GetInitialInstanceTransform(int32_t InstanceIndex, bool bWorldSpace); // Function Mist.MistFoliageComponent.GetInitialInstanceTransform // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x10fa940
	void DestroyInstance(int32_t InstanceIndex, bool bReplaceWithClientActor); // Function Mist.MistFoliageComponent.DestroyInstance // (Native|Public|BlueprintCallable) // @ game+0x10fa420
	void BroadcastRespawnInstance(int32_t InstanceIndex); // Function Mist.MistFoliageComponent.BroadcastRespawnInstance // (Final|Net|NetReliableNative|Event|Private) // @ game+0x10fa390
	void BroadcastDestroyInstanceSkipReplaceActor(int32_t InstanceIndex); // Function Mist.MistFoliageComponent.BroadcastDestroyInstanceSkipReplaceActor // (Final|Net|NetReliableNative|Event|Private) // @ game+0x10fa300
	void BroadcastDestroyInstance(int32_t InstanceIndex); // Function Mist.MistFoliageComponent.BroadcastDestroyInstance // (Final|Net|NetReliableNative|Event|Private) // @ game+0x10fa270
};

// Class Mist.AnimalSpawner
// Size: 0xcb0 (Inherited: 0xca0)
struct UAnimalSpawner : UMistFoliageComponent {
	int32_t Population; // 0xca0(0x04)
	int32_t MaxPopulation; // 0xca4(0x04)
	struct AMistAnimal* Animal; // 0xca8(0x08)

	void HandleAnimalStateChanged(struct AMistCharacter* Character, enum class EMistCharacterState PrevState, enum class EMistCharacterState NewState); // Function Mist.AnimalSpawner.HandleAnimalStateChanged // (Final|Native|Private) // @ game+0x10867f0
};

// Class Mist.VirtualLandscapeLayer
// Size: 0x68 (Inherited: 0x30)
struct UVirtualLandscapeLayer : UPrimaryDataAsset {
	struct FMistLandscapeLayersList IncludedLayers; // 0x30(0x10)
	struct TArray<struct UVirtualLandscapeLayer*> IncludedLayerGroups; // 0x40(0x10)
	struct FMistLandscapeLayersList ExcludedLayers; // 0x50(0x10)
	int32_t QualitySeed; // 0x60(0x04)
	float QualityThreshold; // 0x64(0x04)
};

// Class Mist.GroundLandscapeLayer
// Size: 0x88 (Inherited: 0x68)
struct UGroundLandscapeLayer : UVirtualLandscapeLayer {
	float WalkerSandinessAffection; // 0x68(0x04)
	bool GenerateRippleEffect; // 0x6c(0x01)
	bool BlockBuildingNearby; // 0x6d(0x01)
	char pad_6E[0x2]; // 0x6e(0x02)
	struct FText BlockBuildingNearbyWarning; // 0x70(0x18)
};

// Class Mist.MistMannedControlAnimInstance
// Size: 0x280 (Inherited: 0x270)
struct UMistMannedControlAnimInstance : UAnimInstance {
	int32_t CurrentLOD; // 0x268(0x04)
	struct UMistMannedControlComponent* CachedControlComponent; // 0x270(0x08)
	char pad_27C[0x4]; // 0x27c(0x04)

	struct UMistMannedControlComponent* GetControlComponent(); // Function Mist.MistMannedControlAnimInstance.GetControlComponent // (Final|Native|Protected|BlueprintCallable) // @ game+0x1130ef0
};

// Class Mist.HoistControlAnimInstance
// Size: 0x2a0 (Inherited: 0x280)
struct UHoistControlAnimInstance : UMistMannedControlAnimInstance {
	bool bIsManned; // 0x278(0x01)
	float ReelingSpeed; // 0x27c(0x04)
	bool bReloading; // 0x280(0x01)
	bool bFiring; // 0x281(0x01)
	float ReloadMultiplier; // 0x284(0x04)
	float ReelPosition; // 0x288(0x04)
	char pad_28F[0x1]; // 0x28f(0x01)
	struct UAnimSequence* ReelInAnimation; // 0x290(0x08)
	struct UAnimSequence* ReloadAnimation; // 0x298(0x08)
};

// Class Mist.MistQuest
// Size: 0x38 (Inherited: 0x28)
struct UMistQuest : UObject {
	struct AMistOasisPlayerState* PlayerState; // 0x28(0x08)
	struct AMistPlayer* ControlledPlayer; // 0x30(0x08)

	struct AMistOasisPlayerState* GetPlayerState(); // Function Mist.MistQuest.GetPlayerState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1180900
	struct AMistPlayer* GetPlayer(); // Function Mist.MistQuest.GetPlayer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11808e0
};

// Class Mist.MistTutorialQuest
// Size: 0x110 (Inherited: 0x38)
struct UMistTutorialQuest : UMistQuest {
	struct TArray<struct FMistQuestSubtask> Subtasks; // 0x38(0x10)
	struct FText Description; // 0x48(0x18)
	struct FText LoreText; // 0x60(0x18)
	struct FText SubtitleText; // 0x78(0x18)
	bool bSoundPlayed; // 0x90(0x01)
	char pad_91[0x7]; // 0x91(0x07)
	struct TArray<struct FItemToHarvest> ItemsToHarvest; // 0x98(0x10)
	struct TArray<struct FTechToUnlock> TechsToUnlock; // 0xa8(0x10)
	struct TMap<struct UMistItemTemplate*, struct FName> ItemsToEquip; // 0xb8(0x50)
	struct UMistTutorialComponent* TutorialComponent; // 0x108(0x08)

	void SetSubtaskProgress(struct FName SubtaskName, int32_t Count, bool IsServer); // Function Mist.MistTutorialQuest.SetSubtaskProgress // (Final|Native|Protected|BlueprintCallable|Const) // @ game+0x11c59e0
	void ReceiveUncontrolled(struct AMistPlayer* Player); // Function Mist.MistTutorialQuest.ReceiveUncontrolled // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void ReceiveControlled(struct AMistPlayer* Player); // Function Mist.MistTutorialQuest.ReceiveControlled // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void OnTechUnlocked(struct AMistOasisPlayerState* Sender); // Function Mist.MistTutorialQuest.OnTechUnlocked // (Event|Protected|BlueprintEvent) // @ game+0x163f1c0
	void OnQuestStart(); // Function Mist.MistTutorialQuest.OnQuestStart // (Event|Protected|BlueprintEvent) // @ game+0x163f1c0
	void OnQuestFinished(); // Function Mist.MistTutorialQuest.OnQuestFinished // (Event|Protected|BlueprintEvent) // @ game+0x163f1c0
	void NativeTechTreeUnlocked(struct AMistOasisPlayerState* Sender); // Function Mist.MistTutorialQuest.NativeTechTreeUnlocked // (Native|Protected) // @ game+0x11c54f0
	bool IsSubtaskFinished(struct FName SubtaskName); // Function Mist.MistTutorialQuest.IsSubtaskFinished // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x11c5460
	void IncrementSubtaskProgress(struct FName SubtaskName, bool IsServer); // Function Mist.MistTutorialQuest.IncrementSubtaskProgress // (Final|Native|Protected|BlueprintCallable|Const) // @ game+0x11c5390
	void HandleInventoryUpdate(); // Function Mist.MistTutorialQuest.HandleInventoryUpdate // (Native|Protected) // @ game+0x11c4dd0
	void HandleEquipmentUpdate(struct UMistEquipmentComponent* Sender, enum class EEquipmentSlot Slot); // Function Mist.MistTutorialQuest.HandleEquipmentUpdate // (Native|Protected) // @ game+0x11c4af0
	int32_t GetSubtaskProgress(struct FName SubtaskName); // Function Mist.MistTutorialQuest.GetSubtaskProgress // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x11c4920
	void FinishSubtaskProgress(struct FName SubtaskName); // Function Mist.MistTutorialQuest.FinishSubtaskProgress // (Final|Native|Protected|BlueprintCallable|Const) // @ game+0x11c48a0
	void FinishCurrentQuest(); // Function Mist.MistTutorialQuest.FinishCurrentQuest // (Final|Native|Protected|BlueprintCallable|Const) // @ game+0x11c4880
	bool AreAllSubtasksFinished(); // Function Mist.MistTutorialQuest.AreAllSubtasksFinished // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x11c45f0
	void AddSubtaskProgress(struct FName SubtaskName, int32_t Count, bool IsServer); // Function Mist.MistTutorialQuest.AddSubtaskProgress // (Final|Native|Protected|BlueprintCallable|Const) // @ game+0x11c44f0
};

// Class Mist.MistAcceptFlotillaQuestQuest
// Size: 0x118 (Inherited: 0x110)
struct UMistAcceptFlotillaQuestQuest : UMistTutorialQuest {
	struct FName AcceptQuestTaskName; // 0x110(0x08)
};

// Class Mist.MistAccountAuthDataManager
// Size: 0x148 (Inherited: 0x28)
struct UMistAccountAuthDataManager : UObject {
	int32_t TokenRefreshInterval; // 0x28(0x04)
	char pad_2C[0xcc]; // 0x2c(0xcc)
	struct UMistBackendHttpClient* BackendClient; // 0xf8(0x08)
	struct UMistDataManager* DataManager; // 0x100(0x08)
	char pad_108[0x40]; // 0x108(0x40)
};

// Class Mist.MistAccountCharacterData
// Size: 0x110 (Inherited: 0x28)
struct UMistAccountCharacterData : UObject {
	char pad_28[0xe8]; // 0x28(0xe8)
};

// Class Mist.MistAccountCharacterListItemData
// Size: 0x58 (Inherited: 0x28)
struct UMistAccountCharacterListItemData : UObject {
	char pad_28[0x30]; // 0x28(0x30)
};

// Class Mist.MistAccountCharacterListData
// Size: 0x158 (Inherited: 0x28)
struct UMistAccountCharacterListData : UObject {
	char pad_28[0x70]; // 0x28(0x70)
	struct TArray<struct UMistAccountCharacterListItemData*> Items; // 0x98(0x10)
	char pad_A8[0x30]; // 0xa8(0x30)
	struct UMistBackendHttpClient* BackendClient; // 0xd8(0x08)
	struct UMistDataManager* DataManager; // 0xe0(0x08)
	struct UMistAccountDataManager* AccountDataManager; // 0xe8(0x08)
	char pad_F0[0x68]; // 0xf0(0x68)
};

// Class Mist.MistAccountCreateCharacterData
// Size: 0x128 (Inherited: 0x28)
struct UMistAccountCreateCharacterData : UObject {
	char pad_28[0xe8]; // 0x28(0xe8)
	struct UMistBackendHttpClient* BackendClient; // 0x110(0x08)
	char pad_118[0x10]; // 0x118(0x10)
};

// Class Mist.MistAccountDeleteCharacterData
// Size: 0xc8 (Inherited: 0x28)
struct UMistAccountDeleteCharacterData : UObject {
	char pad_28[0x88]; // 0x28(0x88)
	struct UMistBackendHttpClient* BackendClient; // 0xb0(0x08)
	char pad_B8[0x10]; // 0xb8(0x10)
};

// Class Mist.MistAccountDataManager
// Size: 0xb0 (Inherited: 0x28)
struct UMistAccountDataManager : UObject {
	struct UMistBackendHttpClient* BackendClient; // 0x28(0x08)
	struct UMistDataManager* DataManager; // 0x30(0x08)
	struct UMistAccountCharacterListData* CharacterListData; // 0x38(0x08)
	struct TMap<int64_t, struct UMistAccountRealmCharacterData*> RealmCharacterDataItems; // 0x40(0x50)
	char pad_90[0x20]; // 0x90(0x20)
};

// Class Mist.MistAccountRealmCharacterData
// Size: 0x130 (Inherited: 0x28)
struct UMistAccountRealmCharacterData : UObject {
	char pad_28[0x78]; // 0x28(0x78)
	struct UMistAccountRealmData* Realm; // 0xa0(0x08)
	struct UMistAccountCharacterData* Character; // 0xa8(0x08)
	char pad_B0[0x8]; // 0xb0(0x08)
	struct UMistBackendHttpClient* BackendClient; // 0xb8(0x08)
	char pad_C0[0x70]; // 0xc0(0x70)
};

// Class Mist.MistAccountRealmRegionSpawnTileData
// Size: 0x50 (Inherited: 0x28)
struct UMistAccountRealmRegionSpawnTileData : UObject {
	char pad_28[0x28]; // 0x28(0x28)
};

// Class Mist.MistAccountRealmRegionData
// Size: 0xc8 (Inherited: 0x28)
struct UMistAccountRealmRegionData : UObject {
	char pad_28[0x90]; // 0x28(0x90)
	struct TArray<struct UMistAccountRealmRegionSpawnTileData*> SpawnTiles; // 0xb8(0x10)
};

// Class Mist.MistAccountRealmData
// Size: 0x110 (Inherited: 0x28)
struct UMistAccountRealmData : UObject {
	char pad_28[0xa8]; // 0x28(0xa8)
	struct TArray<struct UMistAccountRealmRegionData*> Regions; // 0xd0(0x10)
	char pad_E0[0x30]; // 0xe0(0x30)
};

// Class Mist.MistPlayerControllerComponent
// Size: 0x108 (Inherited: 0xf0)
struct UMistPlayerControllerComponent : UActorComponent {
	struct AMistOasisPlayerController* PlayerControllerOwner; // 0xf0(0x08)
	struct AMistPlayer* ControlledPlayer; // 0xf8(0x08)
	char pad_100[0x8]; // 0x100(0x08)
};

// Class Mist.MistAchievementComponent
// Size: 0x2d8 (Inherited: 0x108)
struct UMistAchievementComponent : UMistPlayerControllerComponent {
	struct FMistAchievement FirstWalkerAchievement; // 0x108(0x10)
	struct FMistAchievement BattleFanWalkerBoost; // 0x118(0x10)
	struct TMap<struct TSoftClassPtr<UObject>, struct FMistAchievement> BuildAchievements; // 0x128(0x50)
	struct TMap<struct TSoftClassPtr<UObject>, struct FMistAchievementStat> KillAchievementStats; // 0x178(0x50)
	struct FMistAchievement WormHunterAchievement; // 0x1c8(0x10)
	struct FMistAchievement WormSlayerAchievement; // 0x1d8(0x10)
	struct FMistAchievement LeaveDropZoneAchievement; // 0x1e8(0x10)
	struct FMistAchievement TutorialFinishedAchievement; // 0x1f8(0x10)
	struct FMistAchievementStat BlockAchievementStat; // 0x208(0x28)
	struct FMistAchievementStat AttackAchievementStat; // 0x230(0x28)
	struct FMistAchievement CombatMasterAchievement; // 0x258(0x10)
	struct TMap<struct AActor*, struct FMistAchievementStat> LootableActorAchievementStats; // 0x268(0x50)
	struct UMistAchievementSubsystem* AchievementSubsystem; // 0x2b8(0x08)
	char pad_2C0[0x18]; // 0x2c0(0x18)

	void HandleThirstChanged(struct UMistPlayerThirstComponent* StaminaComponent, float Thirst, float PrevThirst); // Function Mist.MistAchievementComponent.HandleThirstChanged // (Final|Native|Private) // @ game+0x108bce0
	void HandleTargetKilled(struct APawn* Target); // Function Mist.MistAchievementComponent.HandleTargetKilled // (Final|Native|Private) // @ game+0x108bc60
	void HandlePlayerTechUnlocked(struct AMistOasisPlayerState* Sender); // Function Mist.MistAchievementComponent.HandlePlayerTechUnlocked // (Final|Native|Private) // @ game+0x108b940
	void HandleInteract(struct FMistInteraction& Interaction); // Function Mist.MistAchievementComponent.HandleInteract // (Final|Native|Private|HasOutParms) // @ game+0x108b7e0
	void HandleHitReceived(struct FMeleeHitInfo HitInfo); // Function Mist.MistAchievementComponent.HandleHitReceived // (Final|Native|Private) // @ game+0x108b620
	void HandleHitDealt(struct FMeleeHitInfo HitInfo); // Function Mist.MistAchievementComponent.HandleHitDealt // (Final|Native|Private) // @ game+0x108b460
	void ClientUnlockAchievement(struct FMistAchievement Achievement); // Function Mist.MistAchievementComponent.ClientUnlockAchievement // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x108b060
	void ClientSetTechtreeUnlocksAchievementStat(struct FString Value); // Function Mist.MistAchievementComponent.ClientSetTechtreeUnlocksAchievementStat // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x108afc0
	void ClientSetAchievementStat(struct FMistAchievementStat AchievementStat, double Value, enum class EMistAchievementStatModificationType Type); // Function Mist.MistAchievementComponent.ClientSetAchievementStat // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x108ae80
	void ClientIncrementHitAchievement(bool bBlock); // Function Mist.MistAchievementComponent.ClientIncrementHitAchievement // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x108adf0
	void ClientIncrementAchievementStat(struct FMistAchievementStat AchievementStat); // Function Mist.MistAchievementComponent.ClientIncrementAchievementStat // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x108ad30
	void AchievementEvent__DelegateSignature(struct FName WrittenAchievementName, float WrittenProgress); // DelegateFunction Mist.MistAchievementComponent.AchievementEvent__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x163f1c0
};

// Class Mist.MistAchievementSubsystem
// Size: 0x68 (Inherited: 0x30)
struct UMistAchievementSubsystem : UGameInstanceSubsystem {
	char pad_30[0x38]; // 0x30(0x38)
};

// Class Mist.MistUIWidget
// Size: 0x2c0 (Inherited: 0x230)
struct UMistUIWidget : UUserWidget {
	struct UMistBaseToolTipWidget* ToolTipWidgetClass; // 0x230(0x08)
	char pad_238[0x8]; // 0x238(0x08)
	struct TArray<struct FMistTooltipInfo> TooltipWidgets; // 0x240(0x10)
	bool bFocusableWithMouse; // 0x250(0x01)
	char pad_251[0x7]; // 0x251(0x07)
	struct TMap<int32_t, struct UWidget*> OverriddenDefaultTooltipWidgets; // 0x258(0x50)
	char pad_2A8[0x8]; // 0x2a8(0x08)
	bool bIsBreadcrumbable; // 0x2b0(0x01)
	bool bPreventToolTipOverlaps; // 0x2b1(0x01)
	char pad_2B2[0xe]; // 0x2b2(0x0e)

	void TryRedraw(); // Function Mist.MistUIWidget.TryRedraw // (Final|Native|Public|BlueprintCallable) // @ game+0x11ca5c0
	void ReceiveRedraw(); // Function Mist.MistUIWidget.ReceiveRedraw // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	struct UWidget* GetDefaultSelectedWidget(); // Function Mist.MistUIWidget.GetDefaultSelectedWidget // (Native|Public|BlueprintCallable) // @ game+0x11c9680
	struct UWidget* CreateToolTipWidget(); // Function Mist.MistUIWidget.CreateToolTipWidget // (Native|Protected) // @ game+0x11c93e0
	struct UWidget* CreateGenericToolTipWidget_10(); // Function Mist.MistUIWidget.CreateGenericToolTipWidget_10 // (Final|Native|Private) // @ game+0x11c93a0
	struct UWidget* CreateGenericToolTipWidget_9(); // Function Mist.MistUIWidget.CreateGenericToolTipWidget_9 // (Final|Native|Private) // @ game+0x11c9360
	struct UWidget* CreateGenericToolTipWidget_8(); // Function Mist.MistUIWidget.CreateGenericToolTipWidget_8 // (Final|Native|Private) // @ game+0x11c9320
	struct UWidget* CreateGenericToolTipWidget_7(); // Function Mist.MistUIWidget.CreateGenericToolTipWidget_7 // (Final|Native|Private) // @ game+0x11c92e0
	struct UWidget* CreateGenericToolTipWidget_6(); // Function Mist.MistUIWidget.CreateGenericToolTipWidget_6 // (Final|Native|Private) // @ game+0x11c92a0
	struct UWidget* CreateGenericToolTipWidget_5(); // Function Mist.MistUIWidget.CreateGenericToolTipWidget_5 // (Final|Native|Private) // @ game+0x11c9260
	struct UWidget* CreateGenericToolTipWidget_4(); // Function Mist.MistUIWidget.CreateGenericToolTipWidget_4 // (Final|Native|Private) // @ game+0x11c9220
	struct UWidget* CreateGenericToolTipWidget_3(); // Function Mist.MistUIWidget.CreateGenericToolTipWidget_3 // (Final|Native|Private) // @ game+0x11c91e0
	struct UWidget* CreateGenericToolTipWidget_2(); // Function Mist.MistUIWidget.CreateGenericToolTipWidget_2 // (Final|Native|Private) // @ game+0x11c91a0
	struct UWidget* CreateGenericToolTipWidget_1(); // Function Mist.MistUIWidget.CreateGenericToolTipWidget_1 // (Final|Native|Private) // @ game+0x11c9170
};

// Class Mist.MistBaseToolTipWidget
// Size: 0x2e0 (Inherited: 0x2c0)
struct UMistBaseToolTipWidget : UMistUIWidget {
	char pad_2C0[0x20]; // 0x2c0(0x20)
};

// Class Mist.MistActionHintToolTipWidget
// Size: 0x318 (Inherited: 0x2e0)
struct UMistActionHintToolTipWidget : UMistBaseToolTipWidget {
	struct UTextBlock* ToolTipTextWidget; // 0x2e0(0x08)
	struct UPanelWidget* ActionHintPanelWidget; // 0x2e8(0x08)
	struct UPanelWidget* ProgressPanelWidget; // 0x2f0(0x08)
	struct UPanelWidget* ErrorPanelWidget; // 0x2f8(0x08)
	struct UTextBlock* ActionHintTextWidget; // 0x300(0x08)
	struct UTextBlock* ProgressTextWidget; // 0x308(0x08)
	struct UTextBlock* ErrorTextWidget; // 0x310(0x08)
};

// Class Mist.MistStatusEffect
// Size: 0xe0 (Inherited: 0x28)
struct UMistStatusEffect : UObject {
	enum class EMistStatusEffectStackingMode StackingMode; // 0x28(0x01)
	bool bAffectedByVitaminPower; // 0x29(0x01)
	bool bHasDescription; // 0x2a(0x01)
	bool bReplicateToAllPlayers; // 0x2b(0x01)
	bool bIsCancelledByDamage; // 0x2c(0x01)
	char pad_2D[0x3]; // 0x2d(0x03)
	float CancelDamageThreshold; // 0x30(0x04)
	bool bPermanent; // 0x34(0x01)
	char pad_35[0x3]; // 0x35(0x03)
	float Duration; // 0x38(0x04)
	float Interval; // 0x3c(0x04)
	bool bAffectedByTimeElapsed; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
	struct UMistVitaminItemTemplate* RequiredVitamin; // 0x48(0x08)
	struct FRuntimeFloatCurve MagnitudeTimeCurve; // 0x50(0x88)
	float MagnitudeTimeScale; // 0xd8(0x04)
	char pad_DC[0x4]; // 0xdc(0x04)
};

// Class Mist.MistBaseModifierStatusEffect
// Size: 0xf0 (Inherited: 0xe0)
struct UMistBaseModifierStatusEffect : UMistStatusEffect {
	enum class EMistModifierType ModifierType; // 0xe0(0x01)
	char pad_E1[0x3]; // 0xe1(0x03)
	float Value; // 0xe4(0x04)
	struct UCurveFloat* EffectModByMagnitude; // 0xe8(0x08)
};

// Class Mist.MistActionModifierStatusEffect
// Size: 0xf8 (Inherited: 0xf0)
struct UMistActionModifierStatusEffect : UMistBaseModifierStatusEffect {
	enum class EMistActionModifier ActionType; // 0xf0(0x01)
	char pad_F1[0x7]; // 0xf1(0x07)
};

// Class Mist.MistHUDWidget
// Size: 0x2e0 (Inherited: 0x2c0)
struct UMistHUDWidget : UMistUIWidget {
	enum class EMistHUDElementFlags HUDFlag; // 0x2c0(0x04)
	enum class ESlateVisibility DefaultVisibility; // 0x2c4(0x01)
	char pad_2C5[0x3]; // 0x2c5(0x03)
	struct UWidget* MainWidget; // 0x2c8(0x08)
	struct AMistPlayer* BoundPlayer; // 0x2d0(0x08)
	char pad_2D8[0x8]; // 0x2d8(0x08)
};

// Class Mist.MistActiveVitaminsWidget
// Size: 0x2e8 (Inherited: 0x2e0)
struct UMistActiveVitaminsWidget : UMistHUDWidget {
	struct UHorizontalBox* VitaminListWidget; // 0x2e0(0x08)

	void HandleActiveVitaminsChanged(struct UMistVitaminUserComponent* Sender); // Function Mist.MistActiveVitaminsWidget.HandleActiveVitaminsChanged // (Final|Native|Private) // @ game+0x108b100
};

// Class Mist.MistUIDragDropWidget
// Size: 0x308 (Inherited: 0x2c0)
struct UMistUIDragDropWidget : UMistUIWidget {
	char pad_2C0[0x30]; // 0x2c0(0x30)
	struct UMistHoldButtonWidget* ProxyHoldButtonWidget; // 0x2f0(0x08)
	bool bSupportsDrag; // 0x2f8(0x01)
	char pad_2F9[0x7]; // 0x2f9(0x07)
	struct UMistUIDragDropOperation* DragOperation; // 0x300(0x08)

	void HandleButtonClicked(); // Function Mist.MistUIDragDropWidget.HandleButtonClicked // (Native|Protected) // @ game+0x11c49f0
};

// Class Mist.MistItemSlotWidget
// Size: 0x4d8 (Inherited: 0x308)
struct UMistItemSlotWidget : UMistUIDragDropWidget {
	struct FSlateSound DragSound; // 0x308(0x18)
	struct FSlateSound DropSound; // 0x320(0x18)
	struct FSlateSound UnequipSound; // 0x338(0x18)
	struct FLinearColor DraggedOverColor; // 0x350(0x10)
	struct FLinearColor DefaultColor; // 0x360(0x10)
	struct UTexture2D* NoItemTexture; // 0x370(0x08)
	struct UMistBasicItemIconWidget* IconWidget; // 0x378(0x08)
	struct UImage* NoItemOverlayWidget; // 0x380(0x08)
	struct UBorder* ItemSlotBackground; // 0x388(0x08)
	struct UGridPanel* ItemSlotPopupContainer; // 0x390(0x08)
	struct UGridPanel* ItemSlotPopupContainerOverride; // 0x398(0x08)
	struct UWidget* ProtectedSlotMark; // 0x3a0(0x08)
	struct UImage* FilteredOutWidget; // 0x3a8(0x08)
	struct UWidget* NewItemIndicatorWidget; // 0x3b0(0x08)
	struct UWidget* CantBeDraggedToIndicatorWidget; // 0x3b8(0x08)
	struct UWidget* DraggedIndicatorWidget; // 0x3c0(0x08)
	struct UTextBlock* StackSizeTextWidget; // 0x3c8(0x08)
	float BackgroundOpacity; // 0x3d0(0x04)
	bool bIsFilteredOut; // 0x3d4(0x01)
	bool bTrackNewStatus; // 0x3d5(0x01)
	bool bShowStackSize; // 0x3d6(0x01)
	char pad_3D7[0x1]; // 0x3d7(0x01)
	struct FMistItem Item; // 0x3d8(0x18)
	int32_t Count; // 0x3f0(0x04)
	char pad_3F4[0x4]; // 0x3f4(0x04)
	struct FMistInventoryOperationSource Source; // 0x3f8(0x38)
	struct FMistInventoryOperationTarget Target; // 0x430(0x20)
	char pad_450[0x88]; // 0x450(0x88)

	void PlayUnHoveredAnimation(); // Function Mist.MistItemSlotWidget.PlayUnHoveredAnimation // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void PlayHoveredAnimation(); // Function Mist.MistItemSlotWidget.PlayHoveredAnimation // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
};

// Class Mist.MistActiveVitaminWidget
// Size: 0x500 (Inherited: 0x4d8)
struct UMistActiveVitaminWidget : UMistItemSlotWidget {
	struct UProgressBar* ProgressBarWidget; // 0x4d8(0x08)
	struct FMistActiveVitamin ActiveVitamin; // 0x4e0(0x18)
	char pad_4F8[0x8]; // 0x4f8(0x08)
};

// Class Mist.MistActorAttachmentComponent
// Size: 0x128 (Inherited: 0xf0)
struct UMistActorAttachmentComponent : UActorComponent {
	char pad_F0[0x20]; // 0xf0(0x20)
	struct USceneComponent* ParentComponent; // 0x110(0x08)
	int32_t ParentIndex; // 0x118(0x04)
	char pad_11C[0xc]; // 0x11c(0x0c)

	void HandleStructurePartInstanceRemoved(struct FTransform& Transform, int32_t ItemIndex); // Function Mist.MistActorAttachmentComponent.HandleStructurePartInstanceRemoved // (Final|Native|Private|HasOutParms|HasDefaults) // @ game+0x108bb40
	void HandleParentActorDestroyed(struct AActor* DestroyedActor); // Function Mist.MistActorAttachmentComponent.HandleParentActorDestroyed // (Final|Native|Private) // @ game+0x108b8c0
	void HandleFoliageInstanceReplaced(struct UMistFoliageComponent* Component, int32_t InstanceIndex, struct AActor* ReplacementActor); // Function Mist.MistActorAttachmentComponent.HandleFoliageInstanceReplaced // (Final|Native|Private) // @ game+0x108b360
	void HandleFoliageInstanceRemoved(struct UMistFoliageComponent* Component, int32_t InstanceIndex); // Function Mist.MistActorAttachmentComponent.HandleFoliageInstanceRemoved // (Final|Native|Private) // @ game+0x108b2a0
};

// Class Mist.MistUIScreen
// Size: 0x3a0 (Inherited: 0x2c0)
struct UMistUIScreen : UMistUIWidget {
	char pad_2C0[0x70]; // 0x2c0(0x70)
	struct FSlateSound OpenedSound; // 0x330(0x18)
	struct FSlateSound ClosedSound; // 0x348(0x18)
	bool bApplyUIScreenMix; // 0x360(0x01)
	char pad_361[0x3]; // 0x361(0x03)
	uint32_t HUDFlags; // 0x364(0x04)
	char pad_368[0x20]; // 0x368(0x20)
	struct TArray<struct UObject*> KeepAliveObjects; // 0x388(0x10)
	char pad_398[0x8]; // 0x398(0x08)

	void CloseWithEscape(); // Function Mist.MistUIScreen.CloseWithEscape // (Native|Protected) // @ game+0x11c49f0
	void Close(); // Function Mist.MistUIScreen.Close // (Native|Public|BlueprintCallable) // @ game+0x10a4190
};

// Class Mist.MistActorSelectionScreen
// Size: 0x428 (Inherited: 0x3a0)
struct UMistActorSelectionScreen : UMistUIScreen {
	char pad_3A0[0x50]; // 0x3a0(0x50)
	struct FMistInteraction SelectedInteraction; // 0x3f0(0x18)
	struct UMistInteractorComponent* InteractorComponent; // 0x408(0x08)
	char pad_410[0x18]; // 0x410(0x18)
};

// Class Mist.MistActorSpawningManager
// Size: 0x28 (Inherited: 0x28)
struct UMistActorSpawningManager : UInterface {
};

// Class Mist.MistUIDialog
// Size: 0x3c0 (Inherited: 0x3a0)
struct UMistUIDialog : UMistUIScreen {
	char pad_3A0[0x18]; // 0x3a0(0x18)
	enum class EMistDialogResult DialogResult; // 0x3b8(0x01)
	char pad_3B9[0x7]; // 0x3b9(0x07)
};

// Class Mist.MistAdminKickBanPlayerDialog
// Size: 0x3d0 (Inherited: 0x3c0)
struct UMistAdminKickBanPlayerDialog : UMistUIDialog {
	struct UScrollBox* PlayerListWidget; // 0x3c0(0x08)
	struct UMistBaseButtonWidget* CloseButtonWidget; // 0x3c8(0x08)
};

// Class Mist.MistAdminKickBanPlayerWidget
// Size: 0x310 (Inherited: 0x2c0)
struct UMistAdminKickBanPlayerWidget : UMistUIWidget {
	struct UTextBlock* PlayerNameWidget; // 0x2c0(0x08)
	struct UTextBlock* UniqueIdWidget; // 0x2c8(0x08)
	struct UMistBaseButtonWidget* BanButtonWidget; // 0x2d0(0x08)
	struct UMistBaseButtonWidget* KickButtonWidget; // 0x2d8(0x08)
	char pad_2E0[0x30]; // 0x2e0(0x30)
};

// Class Mist.MistAiAggroComponent
// Size: 0x118 (Inherited: 0xf0)
struct UMistAiAggroComponent : UActorComponent {
	float DistanceAggroChangeSpeed; // 0xf0(0x04)
	float DynamicAggroGainSpeed; // 0xf4(0x04)
	float DynamicAggroLossSpeed; // 0xf8(0x04)
	float FirstHitAggroBonus; // 0xfc(0x04)
	char pad_100[0x18]; // 0x100(0x18)

	void HandleReceiveAnyDamage(struct AActor* DamagedActor, float Damage, struct UDamageType* DamageType, struct FDamageSource& DamageSource); // Function Mist.MistAiAggroComponent.HandleReceiveAnyDamage // (Final|Native|Protected|HasOutParms) // @ game+0x108b9c0
};

// Class Mist.MistAiAggroComponentExperimental
// Size: 0x150 (Inherited: 0x118)
struct UMistAiAggroComponentExperimental : UMistAiAggroComponent {
	float EngageAggro; // 0x118(0x04)
	struct FVector2D DistanceAggroValueRange; // 0x11c(0x08)
	struct FVector2D DynamicAggroValueRange; // 0x124(0x08)
	char pad_12C[0x4]; // 0x12c(0x04)
	struct TArray<struct FTargetDescription> AllowedTargetTypes; // 0x130(0x10)
	struct TArray<struct AActor*> ExcludedActors; // 0x140(0x10)

	void RemoveExcludedActor(struct AActor* Target); // Function Mist.MistAiAggroComponentExperimental.RemoveExcludedActor // (Final|Native|Public) // @ game+0x108bec0
};

// Class Mist.MistAiBehaviorHandler
// Size: 0x30 (Inherited: 0x30)
struct UMistAiBehaviorHandler : UDataAsset {

	void UpdateBehavior(struct AMistMobController* Controller); // Function Mist.MistAiBehaviorHandler.UpdateBehavior // (Native|Event|Public|BlueprintEvent) // @ game+0x108bf40
	void HandleBehaviorSucceeded(struct AMistMobController* Controller); // Function Mist.MistAiBehaviorHandler.HandleBehaviorSucceeded // (Native|Event|Public|BlueprintEvent) // @ game+0x108b210
	void HandleBehaviorFailed(struct AMistMobController* Controller); // Function Mist.MistAiBehaviorHandler.HandleBehaviorFailed // (Native|Event|Public|BlueprintEvent) // @ game+0x108b180
	void BehaviorStarted(struct AMistMobController* Controller); // Function Mist.MistAiBehaviorHandler.BehaviorStarted // (Native|Event|Public|BlueprintEvent) // @ game+0x108abe0
};

// Class Mist.MistAiMeleeControlComponent
// Size: 0x1b8 (Inherited: 0xf0)
struct UMistAiMeleeControlComponent : UActorComponent {
	struct FCombatAnimTrack QueuedAction; // 0xf0(0x38)
	char pad_128[0x10]; // 0x128(0x10)
	struct UMistMeleeCombatComponent* CachedCombatComponent; // 0x138(0x08)
	struct FName StartingState; // 0x140(0x08)
	char pad_148[0x10]; // 0x148(0x10)
	struct AMistCharacter* OwnerMob; // 0x158(0x08)
	struct AMistCharacter* CurrentTarget; // 0x160(0x08)
	struct UMistMeleeCombatComponent* TargetCombatComponent; // 0x168(0x08)
	char pad_170[0x18]; // 0x170(0x18)
	float ChanceToBlockAttack; // 0x188(0x04)
	float ChanceToBlockAttackCorrectly; // 0x18c(0x04)
	float MinReactionTime; // 0x190(0x04)
	float MaxReactionTime; // 0x194(0x04)
	float MinAttackReadyHold; // 0x198(0x04)
	float MinAttackReadyHoldNoDanger; // 0x19c(0x04)
	float MaxAttackReadyHold; // 0x1a0(0x04)
	float MinWaitPostAttack; // 0x1a4(0x04)
	float MaxWaitPostAttack; // 0x1a8(0x04)
	char pad_1AC[0xc]; // 0x1ac(0x0c)

	void UpdateState(); // Function Mist.MistAiMeleeControlComponent.UpdateState // (Native|Event|Protected|BlueprintEvent) // @ game+0x108bfd0
};

// Class Mist.MistAiMeleeBlockComponent
// Size: 0x1b8 (Inherited: 0x1b8)
struct UMistAiMeleeBlockComponent : UMistAiMeleeControlComponent {
};

// Class Mist.MistAiMeleeSingleActionComponent
// Size: 0x1c0 (Inherited: 0x1b8)
struct UMistAiMeleeSingleActionComponent : UMistAiMeleeControlComponent {
	char pad_1B8[0x8]; // 0x1b8(0x08)
};

// Class Mist.AiScanComponent
// Size: 0x170 (Inherited: 0xf0)
struct UAiScanComponent : UActorComponent {
	float StrengthRatioToAttackAlone; // 0xf0(0x04)
	float GroupStrengthMultiplier; // 0xf4(0x04)
	float StrengthRatioToRunAway; // 0xf8(0x04)
	float ShortDistanceStrengthMultiplier; // 0xfc(0x04)
	float MediumDistance; // 0x100(0x04)
	float LongDistanceStrengthMultiplier; // 0x104(0x04)
	float FightTimeoutWithoutHits; // 0x108(0x04)
	float TimeToIgnoreTargetAfterGivingUp; // 0x10c(0x04)
	float DistanceToGiveUpFight; // 0x110(0x04)
	float RoamingRadius; // 0x114(0x04)
	float VisionRange; // 0x118(0x04)
	float CachedStrengthEstimation; // 0x11c(0x04)
	struct TMap<struct AActor*, struct FMistMobEnemyEntry> VisibleTargets; // 0x120(0x50)
};

// Class Mist.AiScanPlayersComponent
// Size: 0x170 (Inherited: 0x170)
struct UAiScanPlayersComponent : UAiScanComponent {
};

// Class Mist.MistAmbientSoundComponent
// Size: 0x110 (Inherited: 0xf0)
struct UMistAmbientSoundComponent : UActorComponent {
	struct TArray<struct FMistAmbietSoundSettings> SoundSettings; // 0xf0(0x10)
	struct USoundAttenuation* Attenuation; // 0x100(0x08)
	struct USoundConcurrency* Concurrency; // 0x108(0x08)

	void PlaySoundForBiome(struct USoundBase* Sound, struct FMistSoundInstanceParams& Params); // Function Mist.MistAmbientSoundComponent.PlaySoundForBiome // (Native|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x108bde0
	bool CheckBiomes(struct TArray<struct FName>& BiomeNames); // Function Mist.MistAmbientSoundComponent.CheckBiomes // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x108ac70
};

// Class Mist.MistContainerComponent
// Size: 0x2e0 (Inherited: 0xf0)
struct UMistContainerComponent : UActorComponent {
	char pad_F0[0x90]; // 0xf0(0x90)
	struct FMulticastInlineDelegate OnContainerSlotUpdated; // 0x180(0x10)
	struct UMistItemCategory* DefaultAllowedItems; // 0x190(0x08)
	struct UTexture2D* CustomSlotBackgroundImage; // 0x198(0x08)
	struct TSet<struct UMistItemTemplate*> AllowedItems; // 0x1a0(0x50)
	struct UMistItemCategoryGroup* AllowedCategoryGroup; // 0x1f0(0x08)
	struct TArray<struct FMistContainerSlotInitialItem> InitialItems; // 0x1f8(0x10)
	int32_t MaxStackSizeOverride; // 0x208(0x04)
	int32_t Priority; // 0x20c(0x04)
	int32_t InitialCapacity; // 0x210(0x04)
	int32_t NumOfProtectedSlots; // 0x214(0x04)
	struct TArray<struct FMistContainerSlot> Slots; // 0x218(0x10)
	struct FText Name; // 0x228(0x18)
	bool bCanTake; // 0x240(0x01)
	bool bCanPut; // 0x241(0x01)
	bool bCheckClanOwnership; // 0x242(0x01)
	bool bIgnoreClanCheckWhenBelowHalfHp; // 0x243(0x01)
	float CustomHpIgnore; // 0x244(0x04)
	struct TSet<struct AMistPlayer*> UserPlayers; // 0x248(0x50)
	bool bUseClaim; // 0x298(0x01)
	bool bAllowLiquidAutoConsumption; // 0x299(0x01)
	bool bPrivate; // 0x29a(0x01)
	bool bAutoSize; // 0x29b(0x01)
	bool bAllowAllItems; // 0x29c(0x01)
	bool bForbidUntargetedTransfer; // 0x29d(0x01)
	bool bPersistSlotCountChanges; // 0x29e(0x01)
	bool bCanBeIgnited; // 0x29f(0x01)
	struct FMistComponentReference DistanceCheckComponentRef; // 0x2a0(0x28)
	float MaxOpenDistance; // 0x2c8(0x04)
	char pad_2CC[0x4]; // 0x2cc(0x04)
	bool bSubjectToExplosions; // 0x2d0(0x01)
	char pad_2D1[0x3]; // 0x2d1(0x03)
	int32_t OverrideMaxSlotsPerRow; // 0x2d4(0x04)
	char pad_2D8[0x8]; // 0x2d8(0x08)

	void MistContainerSlotUpdated__DelegateSignature(int32_t Slot, struct UMistItemTemplate* Template); // DelegateFunction Mist.MistContainerComponent.MistContainerSlotUpdated__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x163f1c0
	bool IsEmpty(); // Function Mist.MistContainerComponent.IsEmpty // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10d9a70
	bool HasSpaceForItems(struct FMistItem& Item, int32_t Count); // Function Mist.MistContainerComponent.HasSpaceForItems // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x10d9980
	void HandleUserPlayerDestroyed(struct AActor* DestroyedActor); // Function Mist.MistContainerComponent.HandleUserPlayerDestroyed // (Final|Native|Public) // @ game+0x10d9900
	int32_t GetTotalItemCount(); // Function Mist.MistContainerComponent.GetTotalItemCount // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10d9150
	int32_t GetNonEmptySlotCount(); // Function Mist.MistContainerComponent.GetNonEmptySlotCount // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10d9120
	int32_t GetItemCount(struct UMistItemTemplate* Template); // Function Mist.MistContainerComponent.GetItemCount // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10d9090
	int32_t GetItemCapacity(struct FMistItem& Item); // Function Mist.MistContainerComponent.GetItemCapacity // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x10d8fe0
	int32_t GetItemAvailableSpace(struct FMistItem& Item); // Function Mist.MistContainerComponent.GetItemAvailableSpace // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x10d8f30
};

// Class Mist.MistAmmoContainerComponent
// Size: 0x2f0 (Inherited: 0x2e0)
struct UMistAmmoContainerComponent : UMistContainerComponent {
	struct AMistWalker* Walker; // 0x2e0(0x08)
	char pad_2E8[0x8]; // 0x2e8(0x08)

	void HandleNetRemoved(); // Function Mist.MistAmmoContainerComponent.HandleNetRemoved // (Final|Native|Private) // @ game+0x108b8a0
	void HandleNetAttached(); // Function Mist.MistAmmoContainerComponent.HandleNetAttached // (Final|Native|Private) // @ game+0x108b880
};

// Class Mist.MistCharacter
// Size: 0x970 (Inherited: 0x660)
struct AMistCharacter : ACharacter {
	char pad_660[0x40]; // 0x660(0x40)
	struct FMulticastInlineDelegate OnControlledObjectChangedBP; // 0x6a0(0x10)
	char pad_6B0[0x60]; // 0x6b0(0x60)
	struct FMulticastInlineDelegate OnDownedTimer; // 0x710(0x10)
	char pad_720[0x28]; // 0x720(0x28)
	enum class EMistCharacterGender Gender; // 0x748(0x01)
	char pad_749[0x7]; // 0x749(0x07)
	struct UMistCollisionGroupComponent* CollisionGroupComponent; // 0x750(0x08)
	struct UMistCharacterHealthComponent* HealthComponent; // 0x758(0x08)
	struct UMistMannedControlComponent* MannedComponent; // 0x760(0x08)
	struct UMistStatusEffectPlayerComponent* StatusEffectComponent; // 0x768(0x08)
	float CorpseLifeSpan; // 0x770(0x04)
	float DownedDuration; // 0x774(0x04)
	float DownedDurationPvp; // 0x778(0x04)
	float DownedHpPercent; // 0x77c(0x04)
	float RevivedHpPercent; // 0x780(0x04)
	float PostReviveInstaKillDuration; // 0x784(0x04)
	struct AMistDropBag* DropBagOverride; // 0x788(0x08)
	float WeightThreshold; // 0x790(0x04)
	char pad_794[0x4]; // 0x794(0x04)
	struct TArray<struct FName> HeadHitBones; // 0x798(0x10)
	struct TArray<struct FName> TorsoHitBones; // 0x7a8(0x10)
	struct TArray<struct FName> LegsHitBones; // 0x7b8(0x10)
	float CollisionEscapeDuration; // 0x7c8(0x04)
	float VelForce; // 0x7cc(0x04)
	enum class EMistCharacterState State; // 0x7d0(0x01)
	char pad_7D1[0x7]; // 0x7d1(0x07)
	struct AActor* TombstoneActorClass; // 0x7d8(0x08)
	float LookAngle; // 0x7e0(0x04)
	struct FVector Acceleration; // 0x7e4(0x0c)
	struct FRotator DesiredRotation; // 0x7f0(0x0c)
	char pad_7FC[0x4]; // 0x7fc(0x04)
	struct AMistCharacter* KnockoutInstigator; // 0x800(0x08)
	struct AMistOasisPlayerState* KnockoutPlayerStateInstigator; // 0x808(0x08)
	float KnockoutTime; // 0x810(0x04)
	float KnockoutDuration; // 0x814(0x04)
	char pad_818[0x4]; // 0x818(0x04)
	bool IsInWater; // 0x81c(0x01)
	bool IsInLava; // 0x81d(0x01)
	char pad_81E[0x2]; // 0x81e(0x02)
	float MinDeltaMove; // 0x820(0x04)
	float NormalizeScale; // 0x824(0x04)
	float MoveSiteAngle; // 0x828(0x04)
	float LastSpeedInWater; // 0x82c(0x04)
	struct FVector RipplePosition; // 0x830(0x0c)
	char pad_83C[0x4]; // 0x83c(0x04)
	struct UMistVirtualCollisionBodiesComponent* VirtualCollisionComponent; // 0x840(0x08)
	struct USphereComponent* CombatCollision; // 0x848(0x08)
	struct UCapsuleComponent* PhysicsImpactTrigger; // 0x850(0x08)
	struct UCapsuleComponent* TriggererCapsuleComponent; // 0x858(0x08)
	char pad_860[0x18]; // 0x860(0x18)
	struct AMistWalker* TriggerFilteredWalker; // 0x878(0x08)
	int32_t ExperienceAwardAmount; // 0x880(0x04)
	int32_t MoneyAwardAmount; // 0x884(0x04)
	float CachedWeight; // 0x888(0x04)
	char pad_88C[0x4]; // 0x88c(0x04)
	struct AMistWalker* MovementBaseWalker; // 0x890(0x08)
	struct UMistFoliageComponent* MovementBaseFoliage; // 0x898(0x08)
	char pad_8A0[0x10]; // 0x8a0(0x10)
	struct FMistCharacterAttachInfo AttachInfo; // 0x8b0(0x28)
	float SprintPreventionEndTime; // 0x8d8(0x04)
	char pad_8DC[0x4]; // 0x8dc(0x04)
	struct AMistWorldDataHolder* CachedWorldDataHolder; // 0x8e0(0x08)
	char pad_8E8[0x78]; // 0x8e8(0x78)
	struct UMistMeleeCombatComponent* CachedCombatComponent; // 0x960(0x08)
	char pad_968[0x8]; // 0x968(0x08)

	void StartOverlappingWater(float WaterZPosition, bool bIsLava); // Function Mist.MistCharacter.StartOverlappingWater // (Final|Native|Public|BlueprintCallable) // @ game+0x10b21c0
	bool SpendMoney(int32_t Amount); // Function Mist.MistCharacter.SpendMoney // (Native|Public|BlueprintCallable) // @ game+0x10b2120
	void SetCharacterSpeedInWater(float Speed); // Function Mist.MistCharacter.SetCharacterSpeedInWater // (Final|Native|Public|BlueprintCallable) // @ game+0x10b20a0
	void ServerRequestAnimationEvent(struct FMistAnimEventRequest Event); // Function Mist.MistCharacter.ServerRequestAnimationEvent // (Net|Native|Event|Public|NetServer) // @ game+0x10b1f90
	void RippleDuringStep(struct FVector Position, struct UParticleSystem* WaterSplash, struct AActor* ThisActor, float SpeedScale, float VelocityMultiply); // Function Mist.MistCharacter.RippleDuringStep // (Native|Public|HasDefaults|BlueprintCallable) // @ game+0x10b1d40
	void RemoveItemOfClass(struct UMistItemTemplate* ItemClass, int32_t Quantity, struct UMistContainerComponent* Container); // Function Mist.MistCharacter.RemoveItemOfClass // (Final|Native|Public|BlueprintCallable) // @ game+0x10b1c40
	void ReceiveStateChanged(enum class EMistCharacterState PrevState, enum class EMistCharacterState NewState); // Function Mist.MistCharacter.ReceiveStateChanged // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void ReceiveDownedTimer(float TimeLeft); // Function Mist.MistCharacter.ReceiveDownedTimer // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void OnRep_WeightThreshold(); // Function Mist.MistCharacter.OnRep_WeightThreshold // (Final|Native|Protected) // @ game+0x10b1b80
	void OnRep_State(enum class EMistCharacterState PrevState); // Function Mist.MistCharacter.OnRep_State // (Final|Native|Private) // @ game+0x10b1bc0
	void OnRep_SprintPreventionEndTime(); // Function Mist.MistCharacter.OnRep_SprintPreventionEndTime // (Final|Native|Private) // @ game+0x10b1ba0
	void OnRep_CachedWeight(); // Function Mist.MistCharacter.OnRep_CachedWeight // (Final|Native|Protected) // @ game+0x10b1b80
	void MulticastRequestAnimationEvent(struct FMistAnimEventRequest Event); // Function Mist.MistCharacter.MulticastRequestAnimationEvent // (Net|Native|Event|NetMulticast|Public) // @ game+0x10b1a70
	void KillTarget__DelegateSignature(struct APawn* Target); // DelegateFunction Mist.MistCharacter.KillTarget__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x163f1c0
	void InternalUpdateAttachment(); // Function Mist.MistCharacter.InternalUpdateAttachment // (Final|Native|Private) // @ game+0x10b19c0
	bool HasItemOfClass(struct UMistItemTemplate* ItemClass, int32_t Quantity, struct UMistContainerComponent* Container); // Function Mist.MistCharacter.HasItemOfClass // (Final|Native|Public|BlueprintCallable) // @ game+0x10b18c0
	void HandlePhysicsImpactTriggerEnd(struct UPrimitiveComponent* TriggerComponent, struct UPrimitiveComponent* OtherComponent, int32_t OtherBodyIndex); // Function Mist.MistCharacter.HandlePhysicsImpactTriggerEnd // (Final|Native|Public) // @ game+0x10b16c0
	void HandlePhysicsImpactTriggerBegin(struct UPrimitiveComponent* TriggerComponent, struct UPrimitiveComponent* OtherComponent, int32_t OtherBodyIndex); // Function Mist.MistCharacter.HandlePhysicsImpactTriggerBegin // (Final|Native|Public) // @ game+0x10b15c0
	bool HandleHitByNet(struct AMistNetProjectile* Net); // Function Mist.MistCharacter.HandleHitByNet // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void HandleBaseFoliageInstanceRemoved(struct UMistFoliageComponent* Component, int32_t InstanceIndex); // Function Mist.MistCharacter.HandleBaseFoliageInstanceRemoved // (Final|Native|Private) // @ game+0x10b1380
	float GetWaterOverlapDepth(); // Function Mist.MistCharacter.GetWaterOverlapDepth // (Final|Native|Public|BlueprintCallable) // @ game+0x10b1350
	int32_t GetItemCountOfClass(struct UMistItemTemplate* ItemClass, struct UMistContainerComponent* Container); // Function Mist.MistCharacter.GetItemCountOfClass // (Final|Native|Public|BlueprintCallable) // @ game+0x10b1290
	float GetEncumbrance(); // Function Mist.MistCharacter.GetEncumbrance // (Final|Native|Public|BlueprintCallable) // @ game+0x10b1260
	int64_t GetClanId(); // Function Mist.MistCharacter.GetClanId // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10b1230
	struct FVector GetCharacterSpeedInWater(); // Function Mist.MistCharacter.GetCharacterSpeedInWater // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x10b11f0
	enum class EEquipmentSlot EquipItemOfClass(struct UMistEquipmentItemTemplate* ItemClass, bool bWield); // Function Mist.MistCharacter.EquipItemOfClass // (Final|Native|Public|BlueprintCallable) // @ game+0x10b1130
	void EndOverlappingWater(bool bIsLava); // Function Mist.MistCharacter.EndOverlappingWater // (Final|Native|Public|BlueprintCallable) // @ game+0x10b10a0
	void DownedTimerCallback(); // Function Mist.MistCharacter.DownedTimerCallback // (Native|Protected) // @ game+0x10b1080
	void DownedTimer__DelegateSignature(struct AMistCharacter* Character, float TimeLeft); // DelegateFunction Mist.MistCharacter.DownedTimer__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x163f1c0
	void ControlledObjectChangedBPEvent__DelegateSignature(struct AMistCharacter* InCharacter, struct UMistMannedControlComponent* InControllComponent); // DelegateFunction Mist.MistCharacter.ControlledObjectChangedBPEvent__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x163f1c0
	void ContinuosRipple(struct FVector Position, struct UParticleSystem* WaterSplash, struct AActor* ThisActor, float VelocityScale, float VelocityMultiply); // Function Mist.MistCharacter.ContinuosRipple // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x10b0ea0
	void AwardMoney(int32_t Amount); // Function Mist.MistCharacter.AwardMoney // (Native|Public|BlueprintCallable) // @ game+0x10b0e10
	void AwardExperience(int32_t Amount, bool bIsShared); // Function Mist.MistCharacter.AwardExperience // (Native|Public|BlueprintCallable) // @ game+0x10b0d40
	bool AddItemOfClass(struct UMistItemTemplate* ItemClass, int32_t Quantity, struct UMistContainerComponent* Container); // Function Mist.MistCharacter.AddItemOfClass // (Final|Native|Public|BlueprintCallable) // @ game+0x10b0b40
	bool AddItem(struct FMistItem ItemClass, int32_t Quantity, struct UMistContainerComponent* Container); // Function Mist.MistCharacter.AddItem // (Final|Native|Public|BlueprintCallable) // @ game+0x10b0a00
	struct UMistContainerComponent* AddContainer(struct UMistContainerComponent* ContainerClass); // Function Mist.MistCharacter.AddContainer // (Final|Native|Public|BlueprintCallable) // @ game+0x10b0970
};

// Class Mist.MistAnimal
// Size: 0x980 (Inherited: 0x970)
struct AMistAnimal : AMistCharacter {
	char pad_970[0x10]; // 0x970(0x10)
};

// Class Mist.MistAnimalBehavior
// Size: 0x30 (Inherited: 0x30)
struct UMistAnimalBehavior : UMistAiBehaviorHandler {
};

// Class Mist.MistMobController
// Size: 0x5f8 (Inherited: 0x4c0)
struct AMistMobController : AAIController {
	char pad_4C0[0x10]; // 0x4c0(0x10)
	struct AActor* CurrentTarget; // 0x4d0(0x08)
	struct TMap<struct FName, struct FMistAiBehavior> Behaviors; // 0x4d8(0x50)
	struct FName CurrentBehavior; // 0x528(0x08)
	float VisionRange; // 0x530(0x04)
	char pad_534[0x1]; // 0x534(0x01)
	bool bCanCallHelp; // 0x535(0x01)
	bool bCanBeCalled; // 0x536(0x01)
	char pad_537[0x1]; // 0x537(0x01)
	struct FName DefaultBehavior; // 0x538(0x08)
	struct TMap<struct AActor*, struct FMistMobEnemyEntry> VisibleTargets; // 0x540(0x50)
	struct TMap<struct AActor*, float> IgnoredTargets; // 0x590(0x50)
	char pad_5E0[0x8]; // 0x5e0(0x08)
	struct AActor* ControlledBy; // 0x5e8(0x08)
	char pad_5F0[0x8]; // 0x5f0(0x08)

	void StartBehavior(struct FName& Behavior, bool AcceptDefaultBT); // Function Mist.MistMobController.StartBehavior // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x11427c0
	void SetCurrentTarget(struct AActor* NewTarget); // Function Mist.MistMobController.SetCurrentTarget // (Native|Public|BlueprintCallable) // @ game+0x11425c0
	void SetControlledBy(struct AActor* NewControlledBy); // Function Mist.MistMobController.SetControlledBy // (Final|Native|Public|BlueprintCallable) // @ game+0x1142540
	void ReceiveReceivedMeleeHitFromActor(struct AActor* Source, float Damage); // Function Mist.MistMobController.ReceiveReceivedMeleeHitFromActor // (Final|Native|Protected) // @ game+0x11423b0
	void ReceiveDealtDamageToActor(struct AActor* Actor, float Damage); // Function Mist.MistMobController.ReceiveDealtDamageToActor // (Final|Native|Protected) // @ game+0x11422e0
	void ReceiveControlledByChanged(); // Function Mist.MistMobController.ReceiveControlledByChanged // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void LaunchAttackAlone(struct AActor* Target); // Function Mist.MistMobController.LaunchAttackAlone // (Native|Public|BlueprintCallable) // @ game+0x11421a0
	void HandleTakeAnyDamage(struct AActor* DamagedActor, float Damage, struct UDamageType* DamageType, struct FDamageSource& DamageSource); // Function Mist.MistMobController.HandleTakeAnyDamage // (Final|Native|Private|HasOutParms) // @ game+0x1142020
	void HandleStateChanged(struct APawn* InMob, enum class EMistCharacterState OldState, enum class EMistCharacterState NewState); // Function Mist.MistMobController.HandleStateChanged // (Native|Protected) // @ game+0x1141f20
	struct AActor* GetCurrentTarget(); // Function Mist.MistMobController.GetCurrentTarget // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x11418a0
	struct UMistAiBehaviorHandler* GetCurrentBehaviorHandler(); // Function Mist.MistMobController.GetCurrentBehaviorHandler // (Final|Native|Public|BlueprintCallable) // @ game+0x1141870
	struct AActor* GetControlledBy(); // Function Mist.MistMobController.GetControlledBy // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1141840
};

// Class Mist.MistAnimalMobController
// Size: 0x688 (Inherited: 0x5f8)
struct AMistAnimalMobController : AMistMobController {
	bool bIsEngagedInBehavior; // 0x5f8(0x01)
	char pad_5F9[0x3]; // 0x5f9(0x03)
	struct FVector InitialLocation; // 0x5fc(0x0c)
	struct UAiScanPlayersComponent* PlayerScan; // 0x608(0x08)
	struct FAiScanTarget CurrentTargetInfo; // 0x610(0x20)
	float PrecisionAgentRadiusMultiplier; // 0x630(0x04)
	float PrecisionAgentHalfHeightMultiplier; // 0x634(0x04)
	struct TMap<struct UMistPhysicalMobAttackArea*, bool> ActiveAttackAreas; // 0x638(0x50)

	void HandleAttackAreaContact(struct UMistPhysicalMobAttackArea* Sender, struct AActor* Target, bool bEntered); // Function Mist.MistAnimalMobController.HandleAttackAreaContact // (Native|Protected) // @ game+0x1092b30
};

// Class Mist.MistAnimationUtils
// Size: 0x28 (Inherited: 0x28)
struct UMistAnimationUtils : UBlueprintFunctionLibrary {

	void BreakMistAnimPosition(struct FMistAnimPosition& AnimPosition, float& Position, bool& Loop, bool& bBreakOut); // Function Mist.MistAnimationUtils.BreakMistAnimPosition // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x1092910
};

// Class Mist.MistAnimNotifiable
// Size: 0x28 (Inherited: 0x28)
struct UMistAnimNotifiable : UInterface {
};

// Class Mist.MistAnimNotify
// Size: 0x38 (Inherited: 0x38)
struct UMistAnimNotify : UAnimNotify {
};

// Class Mist.MistInteractionEndedAnimNotify
// Size: 0x38 (Inherited: 0x38)
struct UMistInteractionEndedAnimNotify : UAnimNotify {
};

// Class Mist.MistMeditationEndedAnimNotify
// Size: 0x38 (Inherited: 0x38)
struct UMistMeditationEndedAnimNotify : UAnimNotify {
};

// Class Mist.MistTurnEndedAnimNotifyState
// Size: 0x30 (Inherited: 0x30)
struct UMistTurnEndedAnimNotifyState : UAnimNotifyState {
};

// Class Mist.MistSlidingEndedAnimNotify
// Size: 0x38 (Inherited: 0x38)
struct UMistSlidingEndedAnimNotify : UAnimNotify {
};

// Class Mist.MistStandUpStartedAnimNotify
// Size: 0x38 (Inherited: 0x38)
struct UMistStandUpStartedAnimNotify : UAnimNotify {
};

// Class Mist.MistStandUpFinishedAnimNotify
// Size: 0x38 (Inherited: 0x38)
struct UMistStandUpFinishedAnimNotify : UAnimNotify {
};

// Class Mist.MistGrapplingHookShotFinished
// Size: 0x38 (Inherited: 0x38)
struct UMistGrapplingHookShotFinished : UAnimNotify {
};

// Class Mist.MistGrapplingHookReloadFinished
// Size: 0x38 (Inherited: 0x38)
struct UMistGrapplingHookReloadFinished : UAnimNotify {
};

// Class Mist.MistRootMotionCorrectionMarker
// Size: 0x40 (Inherited: 0x38)
struct UMistRootMotionCorrectionMarker : UAnimNotify {
	enum class ERootMotionCorrectionMarker MarkerType; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class Mist.MistItemUsageApplyEffects
// Size: 0x38 (Inherited: 0x38)
struct UMistItemUsageApplyEffects : UAnimNotify {
};

// Class Mist.MistFlareNotify
// Size: 0x40 (Inherited: 0x38)
struct UMistFlareNotify : UAnimNotify {
	enum class EItemUsageEvent ItemUsageEvent; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class Mist.MistAnimMetaData
// Size: 0x28 (Inherited: 0x28)
struct UMistAnimMetaData : UAnimMetaData {

	struct TArray<struct FVector> GetVectorParamsInternal(); // Function Mist.MistAnimMetaData.GetVectorParamsInternal // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x1092ab0
};

// Class Mist.MistLocomotionTypeBase
// Size: 0x190 (Inherited: 0x30)
struct UMistLocomotionTypeBase : UDataAsset {
	float SimilarityImportanceFactor; // 0x30(0x04)
	float DistanceImportanceFactor; // 0x34(0x04)
	float StanceSwitchDelay; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct TMap<int32_t, struct FMotionMatchingMetaData> SimilarityMap; // 0x40(0x50)
	struct TMap<struct UAnimSequence*, int32_t> AnimSequenceIndexMap; // 0x90(0x50)
	char pad_E0[0xb0]; // 0xe0(0xb0)
};

// Class Mist.MistLocomotionType
// Size: 0x7a0 (Inherited: 0x190)
struct UMistLocomotionType : UMistLocomotionTypeBase {
	char pad_190[0x118]; // 0x190(0x118)
	struct FMistStanceDirectionMap StanceDirectionMap; // 0x2a8(0x50)
	struct TMap<enum class ECombatStance, enum class ECombatDirection> AttackStanceDirectionMap; // 0x2f8(0x50)
	struct FMistStanceDirectionMap AttackDirectionStanceMap; // 0x348(0x50)
	struct FMistStanceDirectionMap AttackReadyStanceDirectionMap; // 0x398(0x50)
	struct FMistStanceDirectionMap BlockDirectionStanceMap; // 0x3e8(0x50)
	struct TMap<enum class ECombatStance, enum class ECombatDirection> BlockStanceDirectionMap; // 0x438(0x50)
	struct FLocomotionAnimContainer NeutralIdleAnims; // 0x488(0x18)
	struct FLocomotionAnimContainer CombatIdleAnims; // 0x4a0(0x18)
	struct FLocomotionAnimContainer NeutralStartAnimMap; // 0x4b8(0x18)
	struct FLocomotionAnimContainer NeutralStopAnimMap; // 0x4d0(0x18)
	struct FLocomotionAnimContainer NeutralPivotAnimMap; // 0x4e8(0x18)
	struct FLocomotionAnimContainer CombatIdlePivotAnimMap; // 0x500(0x18)
	struct FLocomotionAnimContainer RightHoldPivotAnimMap; // 0x518(0x18)
	struct FLocomotionAnimContainer LeftHoldPivotAnimMap; // 0x530(0x18)
	struct FLocomotionAnimContainer OverheadHoldPivotAnimMap; // 0x548(0x18)
	struct FLocomotionAnimContainer CombatIdleStartAnimMap; // 0x560(0x18)
	struct FLocomotionAnimContainer RightHoldStartAnimMap; // 0x578(0x18)
	struct FLocomotionAnimContainer LeftHoldStartAnimMap; // 0x590(0x18)
	struct FLocomotionAnimContainer OverheadHoldStartAnimMap; // 0x5a8(0x18)
	struct FLocomotionAnimContainer CombatIdleStopAnimMap; // 0x5c0(0x18)
	struct FLocomotionAnimContainer RightHoldStopAnimMap; // 0x5d8(0x18)
	struct FLocomotionAnimContainer LeftHoldStopAnimMap; // 0x5f0(0x18)
	struct FLocomotionAnimContainer OverheadHoldStopAnimMap; // 0x608(0x18)
	struct FLocomotionAnimContainer OverheadAttackStepAnimMap; // 0x620(0x18)
	struct FLocomotionAnimContainer RightAttackStepAnimMap; // 0x638(0x18)
	struct FLocomotionAnimContainer LeftAttackStepAnimMap; // 0x650(0x18)
	struct FLocomotionAnimContainer StanceTransitionsRtL; // 0x668(0x18)
	struct FLocomotionAnimContainer StanceTransitionsLtR; // 0x680(0x18)
	struct FLocomotionAnimContainer NeutralMoveCycles; // 0x698(0x18)
	struct FLocomotionAnimContainer CombatIdleMoveCycles; // 0x6b0(0x18)
	struct FLocomotionAnimContainer RightHoldMoveCycles; // 0x6c8(0x18)
	struct FLocomotionAnimContainer LeftHoldMoveCycles; // 0x6e0(0x18)
	struct FLocomotionAnimContainer OverheadHoldMoveCycles; // 0x6f8(0x18)
	struct FLocomotionAnimContainer HurtDisplacementAnims; // 0x710(0x18)
	struct FLocomotionAnimContainer HeavyBlockImpactDisplacementAnims; // 0x728(0x18)
	struct FLocomotionAnimContainer DodgeAnims; // 0x740(0x18)
	struct FLocomotionAnimContainer JumpStartAnims; // 0x758(0x18)
	struct FLocomotionAnimContainer JumpLoopAnims; // 0x770(0x18)
	struct FLocomotionAnimContainer LandingAnims; // 0x788(0x18)
};

// Class Mist.GrapplingHookLocomotionType
// Size: 0x238 (Inherited: 0x190)
struct UGrapplingHookLocomotionType : UMistLocomotionTypeBase {
	struct FLocomotionAnimContainer Animations; // 0x190(0x18)
	struct FLocomotionAnimContainer SurfaceInteractionAnimations; // 0x1a8(0x18)
	char pad_1C0[0x78]; // 0x1c0(0x78)
};

// Class Mist.MistClimbingLocomotionType
// Size: 0x1c0 (Inherited: 0x190)
struct UMistClimbingLocomotionType : UMistLocomotionTypeBase {
	struct FLocomotionAnimContainer Animations; // 0x190(0x18)
	struct UAnimationAsset* PulleyClimbAnim; // 0x1a8(0x08)
	struct FVector PulleyClimbAnimOffset; // 0x1b0(0x0c)
	char pad_1BC[0x4]; // 0x1bc(0x04)
};

// Class Mist.MistWeaponSheathingAnimData
// Size: 0x50 (Inherited: 0x30)
struct UMistWeaponSheathingAnimData : UDataAsset {
	struct TArray<struct UAnimSequence*> SheathAnims; // 0x30(0x10)
	struct TArray<struct UAnimSequence*> UnsheathAnims; // 0x40(0x10)
};

// Class Mist.MistMessageLogContentWidget
// Size: 0x2c0 (Inherited: 0x2c0)
struct UMistMessageLogContentWidget : UMistUIWidget {
};

// Class Mist.MistAnnouncementMessageLogContentWidget
// Size: 0x2d0 (Inherited: 0x2c0)
struct UMistAnnouncementMessageLogContentWidget : UMistMessageLogContentWidget {
	struct UTextBlock* MessageTextWidget; // 0x2c0(0x08)
	struct UMistTextMessageData* Data; // 0x2c8(0x08)
};

// Class Mist.MistAreaEffect
// Size: 0x4c0 (Inherited: 0x3c0)
struct AMistAreaEffect : AActor {
	bool bHasInfiniteLifeTime; // 0x3c0(0x01)
	char pad_3C1[0x3]; // 0x3c1(0x03)
	float MinInitialLifeTime; // 0x3c4(0x04)
	float MaxInitialLifeTime; // 0x3c8(0x04)
	float SpawnRadius; // 0x3cc(0x04)
	float SpawnHeight; // 0x3d0(0x04)
	int32_t MinCount; // 0x3d4(0x04)
	int32_t MaxCount; // 0x3d8(0x04)
	char pad_3DC[0x4]; // 0x3dc(0x04)
	struct UParticleSystem* ImpactEffect; // 0x3e0(0x08)
	struct UNiagaraSystem* NiagaraImpactEffect; // 0x3e8(0x08)
	bool bGenerateAffectedActorsEventsOnClient; // 0x3f0(0x01)
	char pad_3F1[0x3]; // 0x3f1(0x03)
	float FadingTime; // 0x3f4(0x04)
	float EffectMinWidth; // 0x3f8(0x04)
	float EffectMaxWidth; // 0x3fc(0x04)
	float EffectMinHeight; // 0x400(0x04)
	float EffectMaxHeight; // 0x404(0x04)
	struct UParticleSystem* Effect; // 0x408(0x08)
	struct UNiagaraSystem* NiagaraEffect; // 0x410(0x08)
	struct TArray<struct UMistStatusEffect*> StatusEffects; // 0x418(0x10)
	float DamageInterval; // 0x428(0x04)
	float DamageTime; // 0x42c(0x04)
	float Damage; // 0x430(0x04)
	char pad_434[0x4]; // 0x434(0x04)
	struct UDamageType* DamageType; // 0x438(0x08)
	bool bShowDebugInformation; // 0x440(0x01)
	char pad_441[0x7]; // 0x441(0x07)
	struct UTexture2D* EffectIcon; // 0x448(0x08)
	bool bSmoothMovementOnClient; // 0x450(0x01)
	char pad_451[0x7]; // 0x451(0x07)
	struct TArray<struct FMistAreaEffectItem> EffectItems; // 0x458(0x10)
	struct TSet<struct FMistAreaEffectAffectedActor> PreviouslyAffectedActors; // 0x468(0x50)
	char pad_4B8[0x8]; // 0x4b8(0x08)

	void ReduceLifeTimes(float DeltaTime); // Function Mist.MistAreaEffect.ReduceLifeTimes // (Native|Protected) // @ game+0x1096ed0
	void OnRep_EffectItems(); // Function Mist.MistAreaEffect.OnRep_EffectItems // (Final|Native|Private) // @ game+0x1096df0
	void OnEndEffect(struct FMistAreaEffectItem& InEffect); // Function Mist.MistAreaEffect.OnEndEffect // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x163f1c0
	void OnEndAffectActor(struct AActor* InAffectedActor); // Function Mist.MistAreaEffect.OnEndAffectActor // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void OnBeginEffect(struct FMistAreaEffectItem& InEffect); // Function Mist.MistAreaEffect.OnBeginEffect // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x163f1c0
	void OnBeginAffectActor(struct AActor* InAffectedActor); // Function Mist.MistAreaEffect.OnBeginAffectActor // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void EndEffects(); // Function Mist.MistAreaEffect.EndEffects // (Native|Protected) // @ game+0x1096770
	void ApplyEffects(); // Function Mist.MistAreaEffect.ApplyEffects // (Native|Protected) // @ game+0x10966d0
};

// Class Mist.MistAreaEffectComponent
// Size: 0x800 (Inherited: 0x7e0)
struct UMistAreaEffectComponent : UCapsuleComponent {
	struct FVector TargetLocation; // 0x7d8(0x0c)
	struct FRotator TargetRotation; // 0x7e4(0x0c)
	char pad_7F8[0x8]; // 0x7f8(0x08)

	void OnRep_TargetRotation(); // Function Mist.MistAreaEffectComponent.OnRep_TargetRotation // (Final|Native|Private) // @ game+0x1096e50
	void OnRep_TargetLocation(); // Function Mist.MistAreaEffectComponent.OnRep_TargetLocation // (Final|Native|Private) // @ game+0x1096e30
};

// Class Mist.MistFlotillaQuest
// Size: 0x48 (Inherited: 0x38)
struct UMistFlotillaQuest : UMistQuest {
	int32_t FlotsReward; // 0x38(0x04)
	int32_t ExpReward; // 0x3c(0x04)
	enum class EFlotillaQuestDifficulty Difficulty; // 0x40(0x01)
	bool HasFailed; // 0x41(0x01)
	char pad_42[0x6]; // 0x42(0x06)
};

// Class Mist.MistArenaDuelQuest
// Size: 0x60 (Inherited: 0x48)
struct UMistArenaDuelQuest : UMistFlotillaQuest {
	enum class ECompletionTypes DuelQuestType; // 0x48(0x01)
	char pad_49[0x3]; // 0x49(0x03)
	int32_t FlotsPerDuel; // 0x4c(0x04)
	int32_t MinAmount; // 0x50(0x04)
	int32_t MaxAmount; // 0x54(0x04)
	char pad_58[0x8]; // 0x58(0x08)

	void HandleDuelComplete(bool DuelOutcome); // Function Mist.MistArenaDuelQuest.HandleDuelComplete // (Final|Native|Private) // @ game+0x10967e0
};

// Class Mist.MistItemDetailsWidget
// Size: 0x2e0 (Inherited: 0x2c0)
struct UMistItemDetailsWidget : UMistUIWidget {
	struct FMistItem Item; // 0x2c0(0x18)
	int32_t Count; // 0x2d8(0x04)
	char pad_2DC[0x4]; // 0x2dc(0x04)
};

// Class Mist.MistArmorItemDetailsWidget
// Size: 0x320 (Inherited: 0x2e0)
struct UMistArmorItemDetailsWidget : UMistItemDetailsWidget {
	struct UWidget* DamageInfoBoxWidget; // 0x2e0(0x08)
	struct UWidget* SoakBoxWidget; // 0x2e8(0x08)
	struct UTextBlock* SoakWidget; // 0x2f0(0x08)
	struct UWidget* ReduceBoxWidget; // 0x2f8(0x08)
	struct UTextBlock* ReduceWidget; // 0x300(0x08)
	struct UWidget* SpeedReductionBoxWidget; // 0x308(0x08)
	struct UTextBlock* SpeedReductionWidget; // 0x310(0x08)
	struct UTextBlock* SlotWidget; // 0x318(0x08)
};

// Class Mist.MistAsteroidActor
// Size: 0x4d0 (Inherited: 0x3c0)
struct AMistAsteroidActor : AActor {
	float MinSpeed; // 0x3c0(0x04)
	float MaxSpeed; // 0x3c4(0x04)
	float MinScale; // 0x3c8(0x04)
	float MaxScale; // 0x3cc(0x04)
	float ExplosionAltitude; // 0x3d0(0x04)
	float DestructionAltitude; // 0x3d4(0x04)
	struct FVector ImpactPoint; // 0x3d8(0x0c)
	float BufferDestructionAltitude; // 0x3e4(0x04)
	float BufferExplosionAltitude; // 0x3e8(0x04)
	float DestructionDelay; // 0x3ec(0x04)
	float AtmosphereFlightTime; // 0x3f0(0x04)
	float PreAtmosphereFlightSpeed; // 0x3f4(0x04)
	int32_t PreAtmosphereParticleTime; // 0x3f8(0x04)
	int32_t PreAtmosphereParticleScale; // 0x3fc(0x04)
	struct UParticleSystem* InitialAsteroidParticleSystem; // 0x400(0x08)
	struct UParticleSystemComponent* PreAtmosphereParticles; // 0x408(0x08)
	struct FInt32Interval HarvestableDebrisAmount; // 0x410(0x08)
	struct AActor* HarvestableActorClass; // 0x418(0x08)
	struct AMistBoulderProjectile* HarvestableDebrisProjectileClass; // 0x420(0x08)
	struct UDamageType* ShockwaveDamageTypeClass; // 0x428(0x08)
	float ShockwaveRadius; // 0x430(0x04)
	float ShockwaveSpeed; // 0x434(0x04)
	float ShockwaveDuration; // 0x438(0x04)
	float ShockwaveBaseDamage; // 0x43c(0x04)
	float ShockwaveMinimumDamage; // 0x440(0x04)
	float ShockwaveWalkerImpulse; // 0x444(0x04)
	float ShockwaveCharacterImpulse; // 0x448(0x04)
	char pad_44C[0x34]; // 0x44c(0x34)
	float AsteroidDistanceReplicated; // 0x480(0x04)
	char pad_484[0x34]; // 0x484(0x34)
	float InitialParticleSystemWarmupTime; // 0x4b8(0x04)
	char pad_4BC[0x14]; // 0x4bc(0x14)

	void PostDebrisInit(); // Function Mist.MistAsteroidActor.PostDebrisInit // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void OnRep_ParticleWarmupTime(); // Function Mist.MistAsteroidActor.OnRep_ParticleWarmupTime // (Final|Native|Private) // @ game+0x1096e10
	void OnHitGround(); // Function Mist.MistAsteroidActor.OnHitGround // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void OnHitAtmosphere(); // Function Mist.MistAsteroidActor.OnHitAtmosphere // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void MulticastHitGround(); // Function Mist.MistAsteroidActor.MulticastHitGround // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x1096cb0
	void MulticastHitAtmosphere(); // Function Mist.MistAsteroidActor.MulticastHitAtmosphere // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x1096c90
	void HitGround(); // Function Mist.MistAsteroidActor.HitGround // (Final|Native|Public|BlueprintCallable) // @ game+0x10969f0
	void HandleSpawnHarvestableActor(struct AMistProjectile* Projectile, struct FHitResult& Hit); // Function Mist.MistAsteroidActor.HandleSpawnHarvestableActor // (Final|Native|Private|HasOutParms) // @ game+0x10968d0
	void HandleSpawnDebris(); // Function Mist.MistAsteroidActor.HandleSpawnDebris // (Final|Native|Private) // @ game+0x10968b0
};

// Class Mist.MistFireAreaEffect
// Size: 0x4c8 (Inherited: 0x4c0)
struct AMistFireAreaEffect : AMistAreaEffect {
	float DamageToNonCharacters; // 0x4c0(0x04)
	char pad_4C4[0x4]; // 0x4c4(0x04)
};

// Class Mist.MistAsteroidFireAreaEffect
// Size: 0x4d8 (Inherited: 0x4c8)
struct AMistAsteroidFireAreaEffect : AMistFireAreaEffect {
	float AsteroidTraceDistance; // 0x4c8(0x04)
	char pad_4CC[0x4]; // 0x4cc(0x04)
	struct AActor* AsteroidShardOwner; // 0x4d0(0x08)
};

// Class Mist.MistAsteroidShardActor
// Size: 0x400 (Inherited: 0x3d0)
struct AMistAsteroidShardActor : AStaticMeshActor {
	struct AMistFireAreaEffect* FireAreaEffectClass; // 0x3d0(0x08)
	struct FInt32Interval HarvestableSplintersAmount; // 0x3d8(0x08)
	struct AActor* HarvestableSplinterClass; // 0x3e0(0x08)
	struct AMistBoulderProjectile* HarvestableSplinterProjectileClass; // 0x3e8(0x08)
	char pad_3F0[0x8]; // 0x3f0(0x08)
	struct AMistAsteroidFireAreaEffect* FireAreaEffect; // 0x3f8(0x08)

	float GetCoolingProgress(); // Function Mist.MistAsteroidShardActor.GetCoolingProgress // (Final|Native|Public|BlueprintCallable) // @ game+0x1096790
};

// Class Mist.MistLootableMeshComponent
// Size: 0x9a0 (Inherited: 0x850)
struct UMistLootableMeshComponent : UStaticMeshComponent {
	char pad_850[0x18]; // 0x850(0x18)
	struct FMulticastInlineDelegate OnLooted; // 0x868(0x10)
	struct FMulticastInlineDelegate OnBroken; // 0x878(0x10)
	struct FText UseText; // 0x888(0x18)
	struct FText BrokenUseText; // 0x8a0(0x18)
	struct FName UseTag; // 0x8b8(0x08)
	struct FName BrokenUseTag; // 0x8c0(0x08)
	struct FMistInteractableProperties InteractableProperties; // 0x8c8(0x14)
	float RespawnTime; // 0x8dc(0x04)
	struct FMistLootDesc Loot; // 0x8e0(0x30)
	int32_t Experience; // 0x910(0x04)
	bool bHideOnLooting; // 0x914(0x01)
	bool bRemoveActorOnLooting; // 0x915(0x01)
	char pad_916[0x2]; // 0x916(0x02)
	float TimeBeforeRemoving; // 0x918(0x04)
	float MinDistanceToActivePlayerToRemove; // 0x91c(0x04)
	float MaxHealth; // 0x920(0x04)
	char pad_924[0x4]; // 0x924(0x04)
	struct FText Name; // 0x928(0x18)
	struct UStaticMesh* DestroyedMesh; // 0x940(0x08)
	struct AActor* ReplacementActorOnDestruction; // 0x948(0x08)
	struct UMistDamageOverrideTable* DamageOverride; // 0x950(0x08)
	char pad_958[0x8]; // 0x958(0x08)
	struct UStaticMesh* InitialMesh; // 0x960(0x08)
	struct FMistComponentReference LootableCoreRef; // 0x968(0x28)
	float Health; // 0x990(0x04)
	bool bCanBeLooted; // 0x994(0x01)
	char pad_995[0x3]; // 0x995(0x03)
	struct UStaticMeshComponent* DestroyedMeshComponent; // 0x998(0x08)

	void TryRemoveOwner(); // Function Mist.MistLootableMeshComponent.TryRemoveOwner // (Final|Native|Protected) // @ game+0x112ef40
	void Respawn(); // Function Mist.MistLootableMeshComponent.Respawn // (Final|Native|Protected) // @ game+0x112ee80
	void OnRep_Health(); // Function Mist.MistLootableMeshComponent.OnRep_Health // (Final|Native|Protected) // @ game+0x10968b0
	void OnRep_bCanBeLooted(); // Function Mist.MistLootableMeshComponent.OnRep_bCanBeLooted // (Final|Native|Protected) // @ game+0x112edc0
	void MulticastSetCanBeLooted(bool bValue); // Function Mist.MistLootableMeshComponent.MulticastSetCanBeLooted // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x112ed30
	void MistLootedEvent__DelegateSignature(struct UMistLootableMeshComponent* Sender, struct AMistPlayer* Looter); // DelegateFunction Mist.MistLootableMeshComponent.MistLootedEvent__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x163f1c0
	void MistBrokenEvent__DelegateSignature(struct UMistLootableMeshComponent* Sender); // DelegateFunction Mist.MistLootableMeshComponent.MistBrokenEvent__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x163f1c0
	void BroadcastSetHealth(float Value); // Function Mist.MistLootableMeshComponent.BroadcastSetHealth // (Net|NetReliableNative|Event|Protected) // @ game+0x112e4e0
};

// Class Mist.MistAsteroidShardComponent
// Size: 0x9f0 (Inherited: 0x9a0)
struct UMistAsteroidShardComponent : UMistLootableMeshComponent {
	char pad_9A0[0x8]; // 0x9a0(0x08)
	struct FFloatInterval HarvestCooldownDurationInterval; // 0x9a8(0x08)
	float AttachedProjectileDamagePerSecond; // 0x9b0(0x04)
	float CooldownReductionPerWater; // 0x9b4(0x04)
	float CooldownReductionBattleFanMovePerSecond; // 0x9b8(0x04)
	float BattleFanMoveVelocityFactor; // 0x9bc(0x04)
	float CooldownReductionBattleFanSuperBlow; // 0x9c0(0x04)
	float BattleFanSuperBlowVelocityFactor; // 0x9c4(0x04)
	bool bIsCoolingDown; // 0x9c8(0x01)
	char pad_9C9[0x3]; // 0x9c9(0x03)
	float SpawnTime; // 0x9cc(0x04)
	float HarvestCooldownDuration; // 0x9d0(0x04)
	float CooldownReduction; // 0x9d4(0x04)
	char pad_9D8[0x18]; // 0x9d8(0x18)

	float ReceiveCooldownFinished(); // Function Mist.MistAsteroidShardComponent.ReceiveCooldownFinished // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void MulticastSetCooldownReduction(float InCooldownReduction); // Function Mist.MistAsteroidShardComponent.MulticastSetCooldownReduction // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x1096d50
	void MulticastCooldownFinished(); // Function Mist.MistAsteroidShardComponent.MulticastCooldownFinished // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x1096a10
};

// Class Mist.MistInteractableComponent
// Size: 0x1f0 (Inherited: 0xf0)
struct UMistInteractableComponent : UActorComponent {
	char pad_F0[0x8]; // 0xf0(0x08)
	struct FMulticastInlineDelegate OnBeginHighlight; // 0xf8(0x10)
	struct FMulticastInlineDelegate OnEndHighlight; // 0x108(0x10)
	struct FMulticastInlineDelegate OnBeginInteract; // 0x118(0x10)
	struct FMulticastInlineDelegate OnEndInteract; // 0x128(0x10)
	struct FMulticastInlineDelegate OnInteract; // 0x138(0x10)
	char pad_148[0x10]; // 0x148(0x10)
	struct FMistComponentReference HighlightMesh; // 0x158(0x28)
	struct FText Text; // 0x180(0x18)
	struct FName Tag; // 0x198(0x08)
	bool bRequireOwner; // 0x1a0(0x01)
	bool bCheckClanOwnership; // 0x1a1(0x01)
	bool bCheckClanRank; // 0x1a2(0x01)
	bool bHiddenOnFailedClanOwnershipCheck; // 0x1a3(0x01)
	bool bIgnoreClanCheckWhenBelowHalfHp; // 0x1a4(0x01)
	char pad_1A5[0x3]; // 0x1a5(0x03)
	float CustomHpIgnore; // 0x1a8(0x04)
	bool bAllowWhenNetted; // 0x1ac(0x01)
	bool bForbidClientInteraction; // 0x1ad(0x01)
	bool bHideWhenOtherInteractionsAvailable; // 0x1ae(0x01)
	enum class EMistClanPermission ClanPermission; // 0x1af(0x01)
	struct FMistInteractableProperties InteractableProperties; // 0x1b0(0x14)
	char pad_1C4[0x4]; // 0x1c4(0x04)
	struct FMistComponentReference CollisionComponent; // 0x1c8(0x28)

	void ReceiveInteract(struct FMistInteraction& Interaction); // Function Mist.MistInteractableComponent.ReceiveInteract // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x163f1c0
	void ReceiveEndInteract(struct FMistInteraction& Interaction, bool bCanceled); // Function Mist.MistInteractableComponent.ReceiveEndInteract // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x163f1c0
	void ReceiveBeginInteract(struct FMistInteraction& Interaction); // Function Mist.MistInteractableComponent.ReceiveBeginInteract // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x163f1c0
	void MulticastSetActive(bool bActive); // Function Mist.MistInteractableComponent.MulticastSetActive // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x10d1870
	void MistInteractableQueryEvent__DelegateSignature(struct UMistInteractableComponent* Sender, struct FMistInteraction& Interaction, bool& bInOutCanInteract, struct FMistInteractableProperties& Properties, struct FMistInteractionQuery& Query); // DelegateFunction Mist.MistInteractableComponent.MistInteractableQueryEvent__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0x163f1c0
	void MistInteractableEvent__DelegateSignature(struct UMistInteractableComponent* Sender, struct FMistInteraction& Interaction); // DelegateFunction Mist.MistInteractableComponent.MistInteractableEvent__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0x163f1c0
	void MistInteractableEndEvent__DelegateSignature(struct UMistInteractableComponent* Sender, struct FMistInteraction& Interaction, bool bCanceled); // DelegateFunction Mist.MistInteractableComponent.MistInteractableEndEvent__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0x163f1c0
};

// Class Mist.MistAtmInteractableComponent
// Size: 0x1f0 (Inherited: 0x1f0)
struct UMistAtmInteractableComponent : UMistInteractableComponent {
};

// Class Mist.MistAtmScreen
// Size: 0x3a8 (Inherited: 0x3a0)
struct UMistAtmScreen : UMistUIScreen {
	struct UMistInteractableComponent* AtmInUse; // 0x3a0(0x08)

	void Withdraw(int32_t Amount); // Function Mist.MistAtmScreen.Withdraw // (Final|Native|Public|BlueprintCallable) // @ game+0x1096f70
	int32_t QueryCurrency(); // Function Mist.MistAtmScreen.QueryCurrency // (Final|Native|Public|BlueprintCallable) // @ game+0x1096ea0
	int32_t QueryBalance(); // Function Mist.MistAtmScreen.QueryBalance // (Final|Native|Public|BlueprintCallable) // @ game+0x1096e70
	void Deposit(int32_t Amount); // Function Mist.MistAtmScreen.Deposit // (Final|Native|Public|BlueprintCallable) // @ game+0x10966f0
};

// Class Mist.MistAttackArrowsControlComponent
// Size: 0x110 (Inherited: 0xf0)
struct UMistAttackArrowsControlComponent : UActorComponent {
	float FacingTolerance; // 0xf0(0x04)
	bool bDrawDebug; // 0xf4(0x01)
	char pad_F5[0x3]; // 0xf5(0x03)
	struct TArray<struct FMistConsideredWidgetComponentsData> ConsideredWidgetComponents; // 0xf8(0x10)
	struct UMistAttackDirectionWidgetComponent* SelectedWidgetComponent; // 0x108(0x08)
};

// Class Mist.MistAttackBehaviorHandler
// Size: 0x30 (Inherited: 0x30)
struct UMistAttackBehaviorHandler : UMistAiBehaviorHandler {
};

// Class Mist.MistAttackDirectionWidgetComponent
// Size: 0x920 (Inherited: 0x900)
struct UMistAttackDirectionWidgetComponent : UWidgetComponent {
	bool bScaleWithDistance; // 0x900(0x01)
	char pad_901[0x3]; // 0x901(0x03)
	float MaxScale; // 0x904(0x04)
	float MinScale; // 0x908(0x04)
	float MaxScaleDistance; // 0x90c(0x04)
	float MinScaleDistance; // 0x910(0x04)
	bool bOutsideRange; // 0x914(0x01)
	char pad_915[0xb]; // 0x915(0x0b)

	void AnimTrackChange(struct FCombatAnimTrack AnimTack); // Function Mist.MistAttackDirectionWidgetComponent.AnimTrackChange // (Final|Native|Public) // @ game+0x1096610
};

// Class Mist.MistAttackDirectionWidget
// Size: 0x2d0 (Inherited: 0x2c0)
struct UMistAttackDirectionWidget : UMistUIWidget {
	struct UCanvasPanel* AttackDirectionPivot; // 0x2c0(0x08)
	struct UImage* AttackDirectionImage; // 0x2c8(0x08)
};

// Class Mist.MistAttackWalkerRangedBehaviorHandler
// Size: 0x30 (Inherited: 0x30)
struct UMistAttackWalkerRangedBehaviorHandler : UMistAiBehaviorHandler {
};

// Class Mist.MistAuctionBrowseItemWidget
// Size: 0x3c8 (Inherited: 0x2c0)
struct UMistAuctionBrowseItemWidget : UMistUIWidget {
	char pad_2C0[0x8]; // 0x2c0(0x08)
	struct FSlateColor RegularBorderColor; // 0x2c8(0x28)
	struct FSlateColor HighestBidderBorderColor; // 0x2f0(0x28)
	struct FSlateColor ParticipantBoarderColor; // 0x318(0x28)
	struct UMistNumberInputWidget* BidValueWidget; // 0x340(0x08)
	struct UMistBasicItemIconWidget* ItemIconWidget; // 0x348(0x08)
	struct UTextBlock* ItemNameWidget; // 0x350(0x08)
	struct UTextBlock* ItemRarityNameWidget; // 0x358(0x08)
	struct UTextBlock* TimerWidget; // 0x360(0x08)
	struct UTextBlock* CurrentPriceWidget; // 0x368(0x08)
	struct UTextBlock* BidsCountWidget; // 0x370(0x08)
	struct UButton* PlaceBidButtonWidget; // 0x378(0x08)
	struct UButton* DecreaseBidButton; // 0x380(0x08)
	struct UButton* IncreaseBidButton; // 0x388(0x08)
	struct UImage* WinningBidImage; // 0x390(0x08)
	struct UImage* LosingBidImage; // 0x398(0x08)
	struct UBorder* BorderWidget; // 0x3a0(0x08)
	struct FTimerHandle TimerHandle_UpdateAuctionTimer; // 0x3a8(0x08)
	struct UMistTradeStationAuctionWidget* ParentWidget; // 0x3b0(0x08)
	struct UMistTradeStationClientAuction* AuctionObject; // 0x3b8(0x08)
	char pad_3C0[0x8]; // 0x3c0(0x08)

	void UpdateAuctionTimer(); // Function Mist.MistAuctionBrowseItemWidget.UpdateAuctionTimer // (Final|Native|Private) // @ game+0x1096f50
	void OnLoseAuctionLeadEvent(); // Function Mist.MistAuctionBrowseItemWidget.OnLoseAuctionLeadEvent // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void OnBecomeAuctionLeaderEvent(); // Function Mist.MistAuctionBrowseItemWidget.OnBecomeAuctionLeaderEvent // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void HandlePlaceBidClicked(); // Function Mist.MistAuctionBrowseItemWidget.HandlePlaceBidClicked // (Final|Native|Private) // @ game+0x1096890
	void HandleIncreaseBidClicked(); // Function Mist.MistAuctionBrowseItemWidget.HandleIncreaseBidClicked // (Final|Native|Private) // @ game+0x1096870
	void HandleDecreaseBidClicked(); // Function Mist.MistAuctionBrowseItemWidget.HandleDecreaseBidClicked // (Final|Native|Private) // @ game+0x10967c0
};

// Class Mist.MistAuctionBrowseWidget
// Size: 0x2d0 (Inherited: 0x2c0)
struct UMistAuctionBrowseWidget : UMistUIWidget {
	struct UListView* ListWidget; // 0x2c0(0x08)
	struct UMistTradeStationAuctionWidget* ParentWidget; // 0x2c8(0x08)
};

// Class Mist.MistAudioComponent
// Size: 0x870 (Inherited: 0x870)
struct UMistAudioComponent : UAudioComponent {

	void MulticastStop(); // Function Mist.MistAudioComponent.MulticastStop // (Final|Net|Native|Event|NetMulticast|Private) // @ game+0x1096dd0
	void MulticastPlay(float StartTime); // Function Mist.MistAudioComponent.MulticastPlay // (Final|Net|Native|Event|NetMulticast|Private) // @ game+0x1096cd0
	void MulticastFadeOut(float FadeOutDuration, float FadeVolumeLevel, enum class EAudioFaderCurve FadeCurve); // Function Mist.MistAudioComponent.MulticastFadeOut // (Final|Net|Native|Event|NetMulticast|Private) // @ game+0x1096b80
	void MulticastFadeIn(float FadeInDuration, float FadeVolumeLevel, float StartTime, enum class EAudioFaderCurve FadeCurve); // Function Mist.MistAudioComponent.MulticastFadeIn // (Final|Net|Native|Event|NetMulticast|Private) // @ game+0x1096a30
};

// Class Mist.MistAudioLevelVisualisation
// Size: 0x318 (Inherited: 0x108)
struct UMistAudioLevelVisualisation : UWidget {
	float Percent; // 0x108(0x04)
	float PercentBar; // 0x10c(0x04)
	float BarWidth; // 0x110(0x04)
	struct FDelegate PercentDelegate; // 0x114(0x10)
	struct FDelegate PercentBarDelegate; // 0x124(0x10)
	char pad_134[0x4]; // 0x134(0x04)
	struct FMistAudioLevelVisualisationStyle WidgetStyle; // 0x138(0x1a0)
	bool IndentHandle; // 0x2d8(0x01)
	bool Locked; // 0x2d9(0x01)
	char pad_2DA[0x6]; // 0x2da(0x06)
	struct FMulticastInlineDelegate OnPercentValueChanged; // 0x2e0(0x10)
	struct FMulticastInlineDelegate OnPercentBarValueChanged; // 0x2f0(0x10)
	char pad_300[0x18]; // 0x300(0x18)

	void SetPercentBar(float InPercentBar); // Function Mist.MistAudioLevelVisualisation.SetPercentBar // (Final|Native|Public|BlueprintCallable) // @ game+0x109d2d0
	void SetPercent(float InPercent); // Function Mist.MistAudioLevelVisualisation.SetPercent // (Final|Native|Public|BlueprintCallable) // @ game+0x109d250
	void SetLocked(bool InLocked); // Function Mist.MistAudioLevelVisualisation.SetLocked // (Final|Native|Public|BlueprintCallable) // @ game+0x109d1c0
	void SetIndentHandle(bool InIndentHandle); // Function Mist.MistAudioLevelVisualisation.SetIndentHandle // (Final|Native|Public|BlueprintCallable) // @ game+0x109d130
	void SetBarWidth(float InBarWidth); // Function Mist.MistAudioLevelVisualisation.SetBarWidth // (Final|Native|Public|BlueprintCallable) // @ game+0x109d0b0
	float GetPercentBar(); // Function Mist.MistAudioLevelVisualisation.GetPercentBar // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109c9f0
	float GetPercent(); // Function Mist.MistAudioLevelVisualisation.GetPercent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109c9c0
	float GetBarWidth(); // Function Mist.MistAudioLevelVisualisation.GetBarWidth // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109c960
};

// Class Mist.MistAudioOcclusionSettings
// Size: 0x38 (Inherited: 0x28)
struct UMistAudioOcclusionSettings : UOcclusionPluginSourceSettingsBase {
	struct TArray<struct FMistOcclusionSettings> OcclusionSettings; // 0x28(0x10)
};

// Class Mist.MistSettingsObject
// Size: 0x38 (Inherited: 0x28)
struct UMistSettingsObject : UObject {
	char pad_28[0x10]; // 0x28(0x10)
};

// Class Mist.MistAudioTestBotController
// Size: 0x510 (Inherited: 0x4c0)
struct AMistAudioTestBotController : AAIController {
	char pad_4C0[0x20]; // 0x4c0(0x20)
	struct UBehaviorTree* BehaviourTree; // 0x4e0(0x08)
	struct UBlackboardData* BlackboardAsset; // 0x4e8(0x08)
	struct TScriptInterface<IMistBotControllableInterface> BotControllable; // 0x4f0(0x10)
	struct UBlackboardComponent* BlackboardComponentCached; // 0x500(0x08)
	char pad_508[0x8]; // 0x508(0x08)
};

// Class Mist.MistAudioTestCombatBotSpawner
// Size: 0x400 (Inherited: 0x3c0)
struct AMistAudioTestCombatBotSpawner : AActor {
	enum class EMistCharacterGender BotGender; // 0x3c0(0x01)
	enum class ECombatAction BotAttackAction; // 0x3c1(0x01)
	char pad_3C2[0x2]; // 0x3c2(0x02)
	float BotAttackPower; // 0x3c4(0x04)
	float BotMaxHealth; // 0x3c8(0x04)
	float BotHealth; // 0x3cc(0x04)
	float DamageFactor; // 0x3d0(0x04)
	float SpawnDelay; // 0x3d4(0x04)
	float StartCombatDelay; // 0x3d8(0x04)
	float ApplyingNewGenderDelay_HACK; // 0x3dc(0x04)
	struct AMistAudioTestCombatBotSpawner* TargetOverride; // 0x3e0(0x08)
	struct AMistPlayer* CombatBotClass; // 0x3e8(0x08)
	struct AMistMobController* MobControllerClass; // 0x3f0(0x08)
	struct AMistPlayer* SpawnedBot; // 0x3f8(0x08)
};

// Class Mist.MistAudioTestFunctionLibrary
// Size: 0x28 (Inherited: 0x28)
struct UMistAudioTestFunctionLibrary : UBlueprintFunctionLibrary {

	void InitializeAudioTest(struct UObject* WorldContextObject, struct FMistAudioTestSettings& Settings, bool bWnatsStartTest); // Function Mist.MistAudioTestFunctionLibrary.InitializeAudioTest // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x109cbe0
	struct AMistAudioTestManagerActor* GetAudioTestManager(struct UObject* WorldContextObject); // Function Mist.MistAudioTestFunctionLibrary.GetAudioTestManager // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x109c8e0
	void DeinitializeAudioTest(struct UObject* WorldContextObject); // Function Mist.MistAudioTestFunctionLibrary.DeinitializeAudioTest // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x109c870
};

// Class Mist.MistAudioTestManagerActor
// Size: 0x3f0 (Inherited: 0x3c0)
struct AMistAudioTestManagerActor : AActor {
	struct FMistAudioTestSettings AudioTestSettings; // 0x3c0(0x18)
	struct TArray<struct FMistSiegeWeapon> SiegeWeapons; // 0x3d8(0x10)
	bool bIsAudioTesting; // 0x3e8(0x01)
	char pad_3E9[0x7]; // 0x3e9(0x07)

	void ToggleTetherBallista(float Value); // Function Mist.MistAudioTestManagerActor.ToggleTetherBallista // (Final|Exec|Native|Public) // @ game+0x109d4d0
	void StopShooting(struct FString WeaponTypeName); // Function Mist.MistAudioTestManagerActor.StopShooting // (Final|Exec|Native|Public) // @ game+0x109d430
	void StopAudioTest(); // Function Mist.MistAudioTestManagerActor.StopAudioTest // (Final|Exec|Native|Public) // @ game+0x109d410
	void StartShooting(struct FString WeaponType); // Function Mist.MistAudioTestManagerActor.StartShooting // (Final|Exec|Native|Public) // @ game+0x109d370
	void StartAudioTest(); // Function Mist.MistAudioTestManagerActor.StartAudioTest // (Final|Exec|Native|Public) // @ game+0x109d350
	void ServerToggleBallistaMode(float Value); // Function Mist.MistAudioTestManagerActor.ServerToggleBallistaMode // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x109d030
	void ServerStopShooting(struct FString WeaponTypeName); // Function Mist.MistAudioTestManagerActor.ServerStopShooting // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x109cf90
	void ServerStopAudioTest(); // Function Mist.MistAudioTestManagerActor.ServerStopAudioTest // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x109cf70
	void ServerStartShooting(struct FString WeaponTypeName); // Function Mist.MistAudioTestManagerActor.ServerStartShooting // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x109ced0
	void ServerStartAudioTest(); // Function Mist.MistAudioTestManagerActor.ServerStartAudioTest // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x109ceb0
	bool IsAudioTesting(); // Function Mist.MistAudioTestManagerActor.IsAudioTesting // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109cd10
};

// Class Mist.MistAuthComponent
// Size: 0x140 (Inherited: 0x108)
struct UMistAuthComponent : UMistPlayerControllerComponent {
	char pad_108[0x38]; // 0x108(0x38)

	void ServerReplySteamAuth(struct TArray<char> AuthTicket); // Function Mist.MistAuthComponent.ServerReplySteamAuth // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x109ce10
	void ClientRequestSteamAuth(); // Function Mist.MistAuthComponent.ClientRequestSteamAuth // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x109c850
};

// Class Mist.MistAuthPlayerState
// Size: 0x4e0 (Inherited: 0x4c0)
struct AMistAuthPlayerState : APlayerState {
	float PlatformAuthTimeout; // 0x4c0(0x04)
	char pad_4C4[0x1c]; // 0x4c4(0x1c)

	void ServerBeginAuthentication(); // Function Mist.MistAuthPlayerState.ServerBeginAuthentication // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x109cdf0
};

// Class Mist.MistCraftingStationComponent
// Size: 0x3b0 (Inherited: 0x1f0)
struct UMistCraftingStationComponent : UMistInteractableComponent {
	char pad_1F0[0x28]; // 0x1f0(0x28)
	struct FMulticastInlineDelegate OnQueueUpdated; // 0x218(0x10)
	struct FMulticastInlineDelegate OnCraftingStarted; // 0x228(0x10)
	struct FMulticastInlineDelegate OnCraftingCancelled; // 0x238(0x10)
	struct FMulticastInlineDelegate OnCraftingSucceeded; // 0x248(0x10)
	struct FMulticastInlineDelegate OnQueueLimitReached; // 0x258(0x10)
	char pad_268[0x18]; // 0x268(0x18)
	struct FMulticastInlineDelegate OnFuelAdded; // 0x280(0x10)
	struct TArray<struct UMistCraftingCategory*> SupportedCategories; // 0x290(0x10)
	int32_t MaxQueueSize; // 0x2a0(0x04)
	bool AcceptsImpossibleOrders; // 0x2a4(0x01)
	bool DontAllowQueueing; // 0x2a5(0x01)
	char pad_2A6[0x2]; // 0x2a6(0x02)
	struct FMistComponentReference InputContainerRef; // 0x2a8(0x28)
	struct FMistComponentReference OutputContainerRef; // 0x2d0(0x28)
	struct FMistComponentReference FuelSourceCraftingStationRef; // 0x2f8(0x28)
	struct UTexture2D* StationIcon; // 0x320(0x08)
	struct TArray<struct FMistCraftingQueueItem> CraftingQueue; // 0x328(0x10)
	struct TArray<struct UMistContainerComponent*> InputContainers; // 0x338(0x10)
	struct TArray<struct UMistContainerComponent*> OutputContainers; // 0x348(0x10)
	struct UMistCraftingStationComponent* FuelSourceCraftingStation; // 0x358(0x08)
	char pad_360[0x50]; // 0x360(0x50)

	void SetPostLoadDataOnQueueItems(); // Function Mist.MistCraftingStationComponent.SetPostLoadDataOnQueueItems // (Final|Native|Private) // @ game+0x10ddc70
	void QueueUpdateEvent__DelegateSignature(struct UMistCraftingStationComponent* Sender); // DelegateFunction Mist.MistCraftingStationComponent.QueueUpdateEvent__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x163f1c0
	void ProcessNextQueueItem(); // Function Mist.MistCraftingStationComponent.ProcessNextQueueItem // (Final|Native|Private) // @ game+0x10dd090
	void OnRep_CraftingQueue(); // Function Mist.MistCraftingStationComponent.OnRep_CraftingQueue // (Final|Native|Private) // @ game+0x10dd070
	void MulticastUpdateQueue(struct TArray<struct FMistCraftingQueueItem> InAddedOrUpdatedItems, struct TArray<uint64_t> InRemovedItemIds); // Function Mist.MistCraftingStationComponent.MulticastUpdateQueue // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x10dcf50
	void MulticastRaiseFuelAdded(); // Function Mist.MistCraftingStationComponent.MulticastRaiseFuelAdded // (Net|Native|Event|NetMulticast|Protected) // @ game+0x10d4dd0
	bool IsQueueActive(); // Function Mist.MistCraftingStationComponent.IsQueueActive // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10dcf20
	void HandlePlayerContainersUpdated(); // Function Mist.MistCraftingStationComponent.HandlePlayerContainersUpdated // (Final|Native|Private) // @ game+0x10dce30
	void HandleFuelCraftingStopped(struct UMistCraftingStationComponent* Sender); // Function Mist.MistCraftingStationComponent.HandleFuelCraftingStopped // (Final|Native|Protected) // @ game+0x10dc780
	void HandleContainerSlotUpdate(struct UMistContainerComponent* Sender, int32_t SlotIndex, struct UMistItemTemplate* PrevItemTemplate); // Function Mist.MistCraftingStationComponent.HandleContainerSlotUpdate // (Native|Protected) // @ game+0x10dc400
	void GetCraftingSections(struct TArray<struct FMistCraftingSection>& Sections); // Function Mist.MistCraftingStationComponent.GetCraftingSections // (Native|Public|HasOutParms) // @ game+0x10dc300
	void FuelAddedEvent__DelegateSignature(); // DelegateFunction Mist.MistCraftingStationComponent.FuelAddedEvent__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x163f1c0
};

// Class Mist.MistAutoCraftingStationComponent
// Size: 0x438 (Inherited: 0x3b0)
struct UMistAutoCraftingStationComponent : UMistCraftingStationComponent {
	struct TMap<struct UMistItemTemplate*, float> CraftingChance; // 0x3b0(0x50)
	bool bAllowInteraction; // 0x400(0x01)
	char pad_401[0x7]; // 0x401(0x07)
	struct FMulticastInlineDelegate OnAutoCraftingStarted; // 0x408(0x10)
	struct FMulticastInlineDelegate OnAutoCraftingStopped; // 0x418(0x10)
	struct TArray<struct FMistCachedAutoStationRecipe> CachedRecipes; // 0x428(0x10)

	void HandleCraftingSucceeded(struct UMistCraftingStationComponent* Sender); // Function Mist.MistAutoCraftingStationComponent.HandleCraftingSucceeded // (Native|Protected) // @ game+0x109cb50
	void HandleCraftingStopped(struct UMistCraftingStationComponent* Sender); // Function Mist.MistAutoCraftingStationComponent.HandleCraftingStopped // (Native|Protected) // @ game+0x109cac0
};

// Class Mist.MistBackendHttpClient
// Size: 0x39c8 (Inherited: 0x28)
struct UMistBackendHttpClient : UObject {
	char pad_28[0x39a0]; // 0x28(0x39a0)
};

// Class Mist.MistMannedPodControlAnimInstance
// Size: 0x290 (Inherited: 0x280)
struct UMistMannedPodControlAnimInstance : UMistMannedControlAnimInstance {
	float CurrentPitchAngle; // 0x278(0x04)
	float CurrentYawAngle; // 0x27c(0x04)
	float PitchRotationSpeed; // 0x280(0x04)
	float YawRotationSpeed; // 0x284(0x04)
	struct UMistSiegePodComponent* CachedSiegePodComponent; // 0x288(0x08)

	void OnConnectedGunPodWeaponChanged(struct UMistSiegePodComponent* SiegePodComponent, struct AMistSiegePodWeapon* PrevWeapon, struct AMistSiegePodWeapon* NewWeapon); // Function Mist.MistMannedPodControlAnimInstance.OnConnectedGunPodWeaponChanged // (Final|Native|Private) // @ game+0x1133b60
};

// Class Mist.MistBallistaAnimInstance
// Size: 0x2c0 (Inherited: 0x290)
struct UMistBallistaAnimInstance : UMistMannedPodControlAnimInstance {
	bool bIsManned; // 0x290(0x01)
	char pad_291[0x3]; // 0x291(0x03)
	float ReelingSpeed; // 0x294(0x04)
	bool bReloading; // 0x298(0x01)
	bool bFiring; // 0x299(0x01)
	char pad_29A[0x2]; // 0x29a(0x02)
	float ReloadMultiplier; // 0x29c(0x04)
	float ReelPosition; // 0x2a0(0x04)
	char pad_2A4[0x4]; // 0x2a4(0x04)
	struct UAnimSequence* ReelInAnimation; // 0x2a8(0x08)
	struct UAnimSequence* ReloadAnimation; // 0x2b0(0x08)
	char pad_2B8[0x8]; // 0x2b8(0x08)
};

// Class Mist.MistBallistaOperationAnimInstance
// Size: 0x2a0 (Inherited: 0x290)
struct UMistBallistaOperationAnimInstance : UMistMannedPodControlAnimInstance {
	float ReelingSpeed; // 0x290(0x04)
	bool bReloading; // 0x294(0x01)
	bool bFiring; // 0x295(0x01)
	char pad_296[0xa]; // 0x296(0x0a)
};

// Class Mist.MistItemTemplate
// Size: 0x1d8 (Inherited: 0x30)
struct UMistItemTemplate : UPrimaryDataAsset {
	char pad_30[0x8]; // 0x30(0x08)
	struct FText Name; // 0x38(0x18)
	struct UMistItemCategory* Category; // 0x50(0x08)
	struct UMistItemRarity* Rarity; // 0x58(0x08)
	struct UTexture2D* Icon; // 0x60(0x08)
	struct FName ShopItemId; // 0x68(0x08)
	struct TArray<struct UMistItemSkinTemplate*> Skins; // 0x70(0x10)
	bool bTradeable; // 0x80(0x01)
	bool bRequireContainerWhitelist; // 0x81(0x01)
	bool bIgnoreContainerMaxStackSize; // 0x82(0x01)
	char pad_83[0x1]; // 0x83(0x01)
	int32_t MaxStackSize; // 0x84(0x04)
	struct TArray<struct FMistItemCraftingRecipe> Recipes; // 0x88(0x10)
	int32_t ExperienceRewardCrafting; // 0x98(0x04)
	int32_t ExperienceRewardUsing; // 0x9c(0x04)
	struct TSoftObjectPtr<UStaticMesh> Mesh; // 0xa0(0x28)
	struct TSoftObjectPtr<UParticleSystem> ParticleSystem; // 0xc8(0x28)
	float ParticleSystemCullDistance; // 0xf0(0x04)
	char pad_F4[0x4]; // 0xf4(0x04)
	struct TArray<struct FMistItemCollectionMesh> CollectionMeshes; // 0xf8(0x10)
	struct FText Description; // 0x108(0x18)
	struct FText AcquisitionHint; // 0x120(0x18)
	float weight; // 0x138(0x04)
	float WeightFactorAtMaxQuality; // 0x13c(0x04)
	int32_t MaxDurability; // 0x140(0x04)
	bool bCanBeAddedByClaim; // 0x144(0x01)
	bool bUsesQuality; // 0x145(0x01)
	bool bSupportsPrimaryDye; // 0x146(0x01)
	bool bSupportsSecondaryDye; // 0x147(0x01)
	float DyeingTime; // 0x148(0x04)
	struct FLinearColor DefaultPrimaryDyeColor; // 0x14c(0x10)
	struct FLinearColor DefaultSecondaryDyeColor; // 0x15c(0x10)
	struct FLinearColor DefaultPrimaryDyeBackgroundColor; // 0x16c(0x10)
	float DefaultPrimaryDyeShininess; // 0x17c(0x04)
	float DefaultSecondaryDyeShininess; // 0x180(0x04)
	char pad_184[0x4]; // 0x184(0x04)
	struct UMistItemPerksProfile* PerksProfile; // 0x188(0x08)
	bool bKnowledgeItem; // 0x190(0x01)
	bool bDestroyedByExplosion; // 0x191(0x01)
	bool bLeaveDebrisOnExplosion; // 0x192(0x01)
	char pad_193[0x5]; // 0x193(0x05)
	struct UMistItemTemplate* ExplodedDebrisItemClass; // 0x198(0x08)
	float ExplosivePower; // 0x1a0(0x04)
	char pad_1A4[0x4]; // 0x1a4(0x04)
	struct UMistItemTemplate* DamagedItem; // 0x1a8(0x08)
	int32_t RecipeIndexForRawCalculation; // 0x1b0(0x04)
	char pad_1B4[0x4]; // 0x1b4(0x04)
	struct TArray<struct UVirtualLandscapeLayer*> FreeLandscapeLayers; // 0x1b8(0x10)
	int32_t SoundAddedId; // 0x1c8(0x04)
	int32_t SoundUsedId; // 0x1cc(0x04)
	float ExpectedPrice; // 0x1d0(0x04)
	char pad_1D4[0x4]; // 0x1d4(0x04)
};

// Class Mist.MistBandageItemTemplate
// Size: 0x1e0 (Inherited: 0x1d8)
struct UMistBandageItemTemplate : UMistItemTemplate {
	float MultiplyHealth; // 0x1d8(0x04)
	float HealingValue; // 0x1dc(0x04)
};

// Class Mist.MistBaseBuildingQuest
// Size: 0x178 (Inherited: 0x110)
struct UMistBaseBuildingQuest : UMistTutorialQuest {
	struct TMap<struct UMistPlaceableTemplate*, struct FName> BasesTemplates; // 0x110(0x50)
	struct FName UnpackCoreTaskName; // 0x160(0x08)
	struct AMistWalker* FoundationWalkerClass; // 0x168(0x08)
	struct FName PayUpkeepTaskName; // 0x170(0x08)

	void ItemBuilt(struct UMistPlaceableTemplate* InPlaceableTemplate, struct AActor* PlacedActor); // Function Mist.MistBaseBuildingQuest.ItemBuilt // (Final|Native|Private) // @ game+0x109cd30
};

// Class Mist.MistBaseButtonWidget
// Size: 0x2e0 (Inherited: 0x2c0)
struct UMistBaseButtonWidget : UMistUIWidget {
	struct UButton* ButtonWidget; // 0x2c0(0x08)
	char pad_2C8[0x18]; // 0x2c8(0x18)

	void HandleButtonUnhovered(); // Function Mist.MistBaseButtonWidget.HandleButtonUnhovered // (Final|Native|Private) // @ game+0x109caa0
	void HandleButtonReleased(); // Function Mist.MistBaseButtonWidget.HandleButtonReleased // (Final|Native|Private) // @ game+0x109ca80
	void HandleButtonPressed(); // Function Mist.MistBaseButtonWidget.HandleButtonPressed // (Final|Native|Private) // @ game+0x109ca60
	void HandleButtonHovered(); // Function Mist.MistBaseButtonWidget.HandleButtonHovered // (Final|Native|Private) // @ game+0x109ca40
	void HandleButtonClicked(); // Function Mist.MistBaseButtonWidget.HandleButtonClicked // (Final|Native|Private) // @ game+0x109ca20
	struct UButton* GetButtonWidget(); // Function Mist.MistBaseButtonWidget.GetButtonWidget // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x109c990
};

// Class Mist.MistBaseCheckBoxWidget
// Size: 0x2c8 (Inherited: 0x2c0)
struct UMistBaseCheckBoxWidget : UMistUIWidget {
	struct UMistCheckBox* CheckBoxWidget; // 0x2c0(0x08)
};

// Class Mist.MistPlaceableTemplate
// Size: 0x1c8 (Inherited: 0x30)
struct UMistPlaceableTemplate : UPrimaryDataAsset {
	char pad_30[0x8]; // 0x30(0x08)
	bool HideInMenu; // 0x38(0x01)
	bool bRepeatable; // 0x39(0x01)
	bool AllowVerticalRotation; // 0x3a(0x01)
	bool bIsFoundation; // 0x3b(0x01)
	bool bIsGroundFoundation; // 0x3c(0x01)
	bool bAllowPlacingOnGround; // 0x3d(0x01)
	bool bAllowPlacingOnPlatform; // 0x3e(0x01)
	bool bClaimOwnerOnly; // 0x3f(0x01)
	bool bAllowPacking; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)
	struct FText Name; // 0x48(0x18)
	struct FText Description; // 0x60(0x18)
	struct FName ShopItemId; // 0x78(0x08)
	struct UTexture2D* Icon; // 0x80(0x08)
	struct UMistItemCategory* Category; // 0x88(0x08)
	struct FMistCraftingRequirements Requirements; // 0x90(0x60)
	struct TSoftClassPtr<UObject> PlaceableActorClass; // 0xf0(0x28)
	float MaxDistance; // 0x118(0x04)
	float MaxSlope; // 0x11c(0x04)
	struct TSet<struct FName> PackingTags; // 0x120(0x50)
	float PackingTime; // 0x170(0x04)
	float UnpackingTime; // 0x174(0x04)
	int32_t MaxLinksFromFoundation; // 0x178(0x04)
	float MaxHorizontalDistanceFromFoundation; // 0x17c(0x04)
	float MaxDistanceFromGround; // 0x180(0x04)
	float MinHeightOffset; // 0x184(0x04)
	float MaxHeightOffset; // 0x188(0x04)
	int32_t MaxPerWalker; // 0x18c(0x04)
	float weight; // 0x190(0x04)
	float WeightFactorAtMaxQuality; // 0x194(0x04)
	float HealthFactorAtMaxQuality; // 0x198(0x04)
	int32_t SortingPriority; // 0x19c(0x04)
	struct UMistSnappingTemplate* SnappingClass; // 0x1a0(0x08)
	bool bCanPackIndividually; // 0x1a8(0x01)
	bool bCanToggleSnapping; // 0x1a9(0x01)
	bool bAttachOnPlacement; // 0x1aa(0x01)
	bool bCanDisassemble; // 0x1ab(0x01)
	float ReturnCostOnDestroyFactor; // 0x1ac(0x04)
	struct TArray<struct FMistPlaceableDisassemblingThreshold> DisassemblingThresholds; // 0x1b0(0x10)
	struct AMistFoundationStructure* FoundationStructureClass; // 0x1c0(0x08)

	void UpdatePartsRequirements(); // Function Mist.MistPlaceableTemplate.UpdatePartsRequirements // (Final|Native|Public|BlueprintCallable) // @ game+0x1168480
};

// Class Mist.MistBaseMaintenanceChestPlaceableTemplate
// Size: 0x1c8 (Inherited: 0x1c8)
struct UMistBaseMaintenanceChestPlaceableTemplate : UMistPlaceableTemplate {
};

// Class Mist.MistBaseMaintenanceContainerComponent
// Size: 0x2e8 (Inherited: 0x2e0)
struct UMistBaseMaintenanceContainerComponent : UMistContainerComponent {
	struct AMistStructure* Structure; // 0x2e0(0x08)
};

// Class Mist.MistBaseActorWidget
// Size: 0x2c0 (Inherited: 0x2c0)
struct UMistBaseActorWidget : UMistUIWidget {
};

// Class Mist.MistBaseMaintenanceInventoryWidget
// Size: 0x2e0 (Inherited: 0x2c0)
struct UMistBaseMaintenanceInventoryWidget : UMistBaseActorWidget {
	struct UMistContainerWidget* ContainerWidget; // 0x2c0(0x08)
	struct UTextBlock* PlaceholderDailyMaintenanceTextBlock; // 0x2c8(0x08)
	struct UTextBlock* HoursLeftTextBlock; // 0x2d0(0x08)
	struct UMistContainerComponent* LinkedContainer; // 0x2d8(0x08)
};

// Class Mist.MistBasePackingQuest
// Size: 0x168 (Inherited: 0x110)
struct UMistBasePackingQuest : UMistTutorialQuest {
	struct TMap<struct UMistPlaceableTemplate*, struct FName> BasesTemplates; // 0x110(0x50)
	struct FName PackTaskName; // 0x160(0x08)

	void PackBase(struct UMistPackingComponent* PackingComponent); // Function Mist.MistBasePackingQuest.PackBase // (Final|Native|Private) // @ game+0x10a3e20
	void ItemBuilt(struct UMistPlaceableTemplate* InPlaceableTemplate, struct AActor* PlacedActor); // Function Mist.MistBasePackingQuest.ItemBuilt // (Final|Native|Private) // @ game+0x109cd30
};

// Class Mist.MistBasePersistentActor
// Size: 0x3f0 (Inherited: 0x3c0)
struct AMistBasePersistentActor : AActor {
	char pad_3C0[0x28]; // 0x3c0(0x28)
	bool bMarkPersistenceDirtyOnMove; // 0x3e8(0x01)
	char pad_3E9[0x7]; // 0x3e9(0x07)
};

// Class Mist.MistBaseQuestEntryWidget
// Size: 0x2e0 (Inherited: 0x2c0)
struct UMistBaseQuestEntryWidget : UMistUIWidget {
	struct UTextBlock* ProgressTextWidget; // 0x2c0(0x08)
	struct UMistQuest* Quest; // 0x2c8(0x08)
	char pad_2D0[0x10]; // 0x2d0(0x10)

	void OnTaskUnfinished(); // Function Mist.MistBaseQuestEntryWidget.OnTaskUnfinished // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void OnTaskFinished(); // Function Mist.MistBaseQuestEntryWidget.OnTaskFinished // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void OnProgressUpdated(); // Function Mist.MistBaseQuestEntryWidget.OnProgressUpdated // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void HandleSubtaskProgressChanged(struct UMistPlayerStateQuestsComponent* Sender, struct UMistQuest* InQuest, int32_t InSubtaskIndex); // Function Mist.MistBaseQuestEntryWidget.HandleSubtaskProgressChanged // (Final|Native|Protected) // @ game+0x10a34f0
};

// Class Mist.MistBaseQuestGenerator
// Size: 0x30 (Inherited: 0x30)
struct UMistBaseQuestGenerator : UDataAsset {
};

// Class Mist.MistPlaceable
// Size: 0x4b0 (Inherited: 0x3c0)
struct AMistPlaceable : AActor {
	char pad_3C0[0x58]; // 0x3c0(0x58)
	struct UMistCollisionGroupComponent* CollisionGroupComponent; // 0x418(0x08)
	struct FText PlaceableName; // 0x420(0x18)
	struct FMulticastInlineDelegate OnPlaceableConstructed; // 0x438(0x10)
	struct FMulticastInlineDelegate OnPlaceableDestroyed; // 0x448(0x10)
	struct FMulticastInlineDelegate OnPlaceableDamaged; // 0x458(0x10)
	struct UMistPlaceableTemplate* PlaceableTemplate; // 0x468(0x08)
	struct FMistComponentReference ShowHealthInteractableRef; // 0x470(0x28)
	struct UMistDamageOverrideTable* DamageOverride; // 0x498(0x08)
	int32_t Quality; // 0x4a0(0x04)
	char pad_4A4[0x4]; // 0x4a4(0x04)
	float CachedWeight; // 0x4a8(0x04)
	char pad_4AC[0x4]; // 0x4ac(0x04)

	void ReceivePlaceableDestroyed(struct FTransform& Transform, int32_t ItemIndex, enum class EMistDestroyReason Reason); // Function Mist.MistPlaceable.ReceivePlaceableDestroyed // (Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0x163f1c0
	void ReceivePlaceableDamaged(struct FTransform& Transform, int32_t ItemIndex, struct UDamageType* DamageTypeClass); // Function Mist.MistPlaceable.ReceivePlaceableDamaged // (Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0x163f1c0
	void ReceivePlaceableConstructed(struct AMistPlayer* Player, struct FTransform& Transform, int32_t ItemIndex); // Function Mist.MistPlaceable.ReceivePlaceableConstructed // (Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0x163f1c0
	void OnRep_Quality(); // Function Mist.MistPlaceable.OnRep_Quality // (Native|Public) // @ game+0x10966d0
	void OnRep_CachedWeight(); // Function Mist.MistPlaceable.OnRep_CachedWeight // (Native|Protected) // @ game+0x11619c0
	void DestroyedEvent__DelegateSignature(struct FTransform& Transform, int32_t ItemIndex); // DelegateFunction Mist.MistPlaceable.DestroyedEvent__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms|HasDefaults) // @ game+0x163f1c0
	void DamagedEvent__DelegateSignature(struct FTransform& Transform, int32_t ItemIndex, struct UDamageType* DamageTypeClass); // DelegateFunction Mist.MistPlaceable.DamagedEvent__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms|HasDefaults) // @ game+0x163f1c0
	void ConstructedEvent__DelegateSignature(struct FTransform& Transform, int32_t ItemIndex, struct AMistPlayer* Player); // DelegateFunction Mist.MistPlaceable.ConstructedEvent__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms|HasDefaults) // @ game+0x163f1c0
};

// Class Mist.MistBaseStructurePart
// Size: 0x508 (Inherited: 0x4b0)
struct AMistBaseStructurePart : AMistPlaceable {
	char pad_4B0[0x38]; // 0x4b0(0x38)
	float MaxHealth; // 0x4e8(0x04)
	bool bDestroyOnZeroHealth; // 0x4ec(0x01)
	bool bCanDecay; // 0x4ed(0x01)
	char pad_4EE[0x2]; // 0x4ee(0x02)
	float DecayDamageMulti; // 0x4f0(0x04)
	bool bUseWallCombatCooldownValues; // 0x4f4(0x01)
	char pad_4F5[0x3]; // 0x4f5(0x03)
	struct UPrimitiveComponent* BaseComponent; // 0x4f8(0x08)
	struct AMistPackingProcessActor* PackingProcessActor; // 0x500(0x08)

	void MulticastAddConnection(struct FMistStructurePartConnectionNode Node, struct FMistStructurePartConnectionNode MyNode); // Function Mist.MistBaseStructurePart.MulticastAddConnection // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x10a3b50
	struct AMistWalker* GetWalker(); // Function Mist.MistBaseStructurePart.GetWalker // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10a2db0
};

// Class Mist.MistBasicItemIconWidget
// Size: 0x400 (Inherited: 0x2c0)
struct UMistBasicItemIconWidget : UMistUIWidget {
	struct UImage* IconWidget; // 0x2c0(0x08)
	struct UImage* CategoryWidget; // 0x2c8(0x08)
	struct UImage* RarityWidget; // 0x2d0(0x08)
	struct UTextBlock* CountWidget; // 0x2d8(0x08)
	struct UTextBlock* QualityWidget; // 0x2e0(0x08)
	struct UProgressBar* DurabilityWidget; // 0x2e8(0x08)
	struct UImage* Dye1ColorWidget; // 0x2f0(0x08)
	struct UImage* Dye2ColorWidget; // 0x2f8(0x08)
	struct FSlateColor QualityColorOverride; // 0x300(0x28)
	struct FSlateColor CountColorOverride; // 0x328(0x28)
	bool bShowPopup; // 0x350(0x01)
	bool bShowCount; // 0x351(0x01)
	bool bShowDurability; // 0x352(0x01)
	bool bShowQuality; // 0x353(0x01)
	bool bShowCategory; // 0x354(0x01)
	bool bShowRarity; // 0x355(0x01)
	char pad_356[0x2]; // 0x356(0x02)
	struct FText CountWithStackSizeFormatText; // 0x358(0x18)
	struct UMistItemTemplate* ItemTemplate; // 0x370(0x08)
	char pad_378[0x80]; // 0x378(0x80)
	struct UMistItemPopupWidget* PopupWidget; // 0x3f8(0x08)
};

// Class Mist.MistMannedControlComponent
// Size: 0x330 (Inherited: 0xf0)
struct UMistMannedControlComponent : UActorComponent {
	char pad_F0[0x40]; // 0xf0(0x40)
	struct UAnimInstance* AnimationClass; // 0x130(0x08)
	struct FMistComponentReference Interactable; // 0x138(0x28)
	struct FMistComponentReference CharacterAttachment; // 0x160(0x28)
	struct TArray<struct FMistComponentReference> CharacterDetachRefs; // 0x188(0x10)
	struct FMistComponentReference AnimatedMeshRef; // 0x198(0x28)
	bool bIsViewTarget; // 0x1c0(0x01)
	bool bAllowZoomOnThisTarget; // 0x1c1(0x01)
	char pad_1C2[0x2]; // 0x1c2(0x02)
	float MinZoom; // 0x1c4(0x04)
	float MaxZoom; // 0x1c8(0x04)
	bool bDelayedExit; // 0x1cc(0x01)
	char pad_1CD[0x3]; // 0x1cd(0x03)
	float ExitDelay; // 0x1d0(0x04)
	bool bEnsureControllingCharacterSupported; // 0x1d4(0x01)
	bool bEnsureControllingCharacterNotObstructed; // 0x1d5(0x01)
	char pad_1D6[0x2]; // 0x1d6(0x02)
	float MaxControllingCharacterAngleDiffToUp; // 0x1d8(0x04)
	bool bEnsureDetachNotObstructed; // 0x1dc(0x01)
	bool bEnsureMannableNotObstructed; // 0x1dd(0x01)
	char pad_1DE[0x2]; // 0x1de(0x02)
	struct FMistComponentReference ObstructionCheckComponentRef; // 0x1e0(0x28)
	bool bUnmannedByExplosives; // 0x208(0x01)
	bool bUnmannedByMobs; // 0x209(0x01)
	char pad_20A[0x6]; // 0x20a(0x06)
	struct AActor* SiegePodActor; // 0x210(0x08)
	struct FViewTargetTransitionParams CameraInTransitionParams; // 0x218(0x10)
	struct FViewTargetTransitionParams CameraOutTransitionParams; // 0x228(0x10)
	struct FMulticastInlineDelegate OnPlayerEntered; // 0x238(0x10)
	struct FMulticastInlineDelegate OnPlayerLeft; // 0x248(0x10)
	bool bExperimentalBlueprintTrajectoryDraw; // 0x258(0x01)
	enum class EMistPerkAbility RequiredPerkForAiming; // 0x259(0x01)
	bool bUseSideLine; // 0x25a(0x01)
	char pad_25B[0x1]; // 0x25b(0x01)
	struct FColor AimingSideLineColor; // 0x25c(0x04)
	float AimingSideLineSize; // 0x260(0x04)
	bool bUseMeshBand; // 0x264(0x01)
	char pad_265[0x3]; // 0x265(0x03)
	struct FColor AimingMeshColor; // 0x268(0x04)
	bool bUseMainLine; // 0x26c(0x01)
	char pad_26D[0x3]; // 0x26d(0x03)
	struct FColor AimingMainLineColor; // 0x270(0x04)
	float AimingLineOffsetLeft; // 0x274(0x04)
	float AimingLineOffsetRight; // 0x278(0x04)
	int32_t ShowEveryNthStep; // 0x27c(0x04)
	int32_t ShowAfterNSteps; // 0x280(0x04)
	char pad_284[0x4]; // 0x284(0x04)
	struct FMannedControlPostPhysicsTickFunction PostPhysicsTickFunction; // 0x288(0x30)
	char pad_2B8[0x28]; // 0x2b8(0x28)
	struct AMistCharacter* ControllingCharacter; // 0x2e0(0x08)
	struct UInputComponent* InputComponent; // 0x2e8(0x08)
	char pad_2F0[0x40]; // 0x2f0(0x40)

	void ServerExit(); // Function Mist.MistMannedControlComponent.ServerExit // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x108bfd0
	void ReceiveTrajectoryDraw(struct FVector InStartLocation, struct FVector InStartVelocity, bool bMirrored, int32_t LineIndex); // Function Mist.MistMannedControlComponent.ReceiveTrajectoryDraw // (Event|Public|HasDefaults|BlueprintEvent) // @ game+0x163f1c0
	void ReceivePlayerLeft(struct AMistCharacter* Player); // Function Mist.MistMannedControlComponent.ReceivePlayerLeft // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void ReceivePlayerEntered(struct AMistCharacter* Player); // Function Mist.MistMannedControlComponent.ReceivePlayerEntered // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void PlayerEnteredLeftEvent__DelegateSignature(struct AMistCharacter* Player); // DelegateFunction Mist.MistMannedControlComponent.PlayerEnteredLeftEvent__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x163f1c0
	void OnRep_ControllingCharacter(struct AMistCharacter* PrevControllingCharacter); // Function Mist.MistMannedControlComponent.OnRep_ControllingCharacter // (Final|Native|Private) // @ game+0x1133c60
	void HandleInteractQuery(struct UMistInteractableComponent* Sender, struct FMistInteraction& Interaction, bool& bInOutCanInteract, struct FMistInteractableProperties& InOutProperties, struct FMistInteractionQuery& InOutQuery); // Function Mist.MistMannedControlComponent.HandleInteractQuery // (Native|Protected|HasOutParms) // @ game+0x1133610
	void HandleInteract(struct UMistInteractableComponent* Sender, struct FMistInteraction& Interaction); // Function Mist.MistMannedControlComponent.HandleInteract // (Native|Protected|HasOutParms) // @ game+0x1133530
	struct AMistCharacter* GetControllingCharacter(); // Function Mist.MistMannedControlComponent.GetControllingCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1133500
};

// Class Mist.MistMannedGimbalControlComponent
// Size: 0x598 (Inherited: 0x330)
struct UMistMannedGimbalControlComponent : UMistMannedControlComponent {
	struct FMulticastInlineDelegate OnPitchTurnBegin; // 0x330(0x10)
	struct FMulticastInlineDelegate OnPitchTurnEnd; // 0x340(0x10)
	struct FMulticastInlineDelegate OnYawTurnBegin; // 0x350(0x10)
	struct FMulticastInlineDelegate OnYawTurnEnd; // 0x360(0x10)
	struct FMulticastInlineDelegate OnRollTurnBegin; // 0x370(0x10)
	struct FMulticastInlineDelegate OnRollTurnEnd; // 0x380(0x10)
	struct FRotator MaxRotationSpeed; // 0x390(0x0c)
	struct FRotator MinCameraRotation; // 0x39c(0x0c)
	struct FRotator MaxCameraRotation; // 0x3a8(0x0c)
	struct FRotator MinTargetRotation; // 0x3b4(0x0c)
	struct FRotator MaxTargetRotation; // 0x3c0(0x0c)
	struct FRotator CameraOffset; // 0x3cc(0x0c)
	struct FRotator ClientInterpolationIgnoreThreshold; // 0x3d8(0x0c)
	struct FRotator ClientInterpolationSnapThreshold; // 0x3e4(0x0c)
	struct FRotator ClientInterpolationMinSpeed; // 0x3f0(0x0c)
	struct FRotator ClientInterpolationMaxSpeed; // 0x3fc(0x0c)
	struct FMistComponentReference PitchComponentRef; // 0x408(0x28)
	struct FMistComponentReference YawComponentRef; // 0x430(0x28)
	struct FMistComponentReference RollComponentRef; // 0x458(0x28)
	struct FMistComponentReference CameraSpringArmRef; // 0x480(0x28)
	bool bPitchCamera; // 0x4a8(0x01)
	bool bYawCamera; // 0x4a9(0x01)
	enum class EMistGimbalControlType PitchControl; // 0x4aa(0x01)
	enum class EMistGimbalControlType YawControl; // 0x4ab(0x01)
	enum class EMistGimbalControlRollType RollControl; // 0x4ac(0x01)
	bool bEnterUsesControlRotation; // 0x4ad(0x01)
	bool bExitUsesControlRotation; // 0x4ae(0x01)
	bool bAllowPrecisionMode; // 0x4af(0x01)
	float PrecisionModeMod; // 0x4b0(0x04)
	float ResetCameraMaxDelayInSec; // 0x4b4(0x04)
	enum class EMistPerkAbility PrecisionModePerk; // 0x4b8(0x01)
	bool bUseWalkerAmmoContainers; // 0x4b9(0x01)
	bool bFixPitchOnManFailed; // 0x4ba(0x01)
	bool bFixYawOnManFailed; // 0x4bb(0x01)
	bool bFixRollOnManFailed; // 0x4bc(0x01)
	char pad_4BD[0x3]; // 0x4bd(0x03)
	float OrientationDifferenceThresholdToFailManning; // 0x4c0(0x04)
	struct FRotator FixOrientationOnManFailedOffset; // 0x4c4(0x0c)
	bool bUndoPitchRotationOnInvalidPosition; // 0x4d0(0x01)
	bool bUndoYawRotationOnInvalidPosition; // 0x4d1(0x01)
	bool bUndoRollRotationOnInvalidPosition; // 0x4d2(0x01)
	enum class EMistControllableManningSide ControllableManningSide; // 0x4d3(0x01)
	struct FRotator TargetRotation; // 0x4d4(0x0c)
	struct FRotator CurrentRotation; // 0x4e0(0x0c)
	char pad_4EC[0xc]; // 0x4ec(0x0c)
	struct FRotator CurrentRotationSpeed; // 0x4f8(0x0c)
	char pad_504[0x7d]; // 0x504(0x7d)
	bool bIsInPrecisionMode; // 0x581(0x01)
	char pad_582[0x6]; // 0x582(0x06)
	struct AMistCharacter* PendingManningCharacter; // 0x588(0x08)
	char pad_590[0x8]; // 0x590(0x08)

	void ServerSetTargetRotationWithPrecision(struct FRotator InValue, bool bInPrecisionMode); // Function Mist.MistMannedGimbalControlComponent.ServerSetTargetRotationWithPrecision // (Net|Native|Event|Protected|NetServer|HasDefaults) // @ game+0x1133f50
	void ServerSetTargetRotation(struct FRotator InValue); // Function Mist.MistMannedGimbalControlComponent.ServerSetTargetRotation // (Net|Native|Event|Protected|NetServer|HasDefaults) // @ game+0x1133ed0
	void RotationEvent__DelegateSignature(struct UMistMannedGimbalControlComponent* Sender); // DelegateFunction Mist.MistMannedGimbalControlComponent.RotationEvent__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x163f1c0
	void OnRep_TargetRotation(); // Function Mist.MistMannedGimbalControlComponent.OnRep_TargetRotation // (Final|Native|Private) // @ game+0x1133db0
	void OnRep_CurrentRotation(struct FRotator& PrevCurrentRotation); // Function Mist.MistMannedGimbalControlComponent.OnRep_CurrentRotation // (Final|Native|Private|HasOutParms|HasDefaults) // @ game+0x1133ce0
	void OnProjectileImpact__DelegateSignature(struct FHitResult& HitResult); // DelegateFunction Mist.MistMannedGimbalControlComponent.OnProjectileImpact__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms) // @ game+0x163f1c0
	void HandleProjectileImpact(struct AMistProjectile* Projectile, struct FHitResult& HitResult, struct FVector& Velocity); // Function Mist.MistMannedGimbalControlComponent.HandleProjectileImpact // (Native|Protected|HasOutParms|HasDefaults) // @ game+0x11339e0
	void ClientNotifyProjectileImpact(struct FHitResult HitResult); // Function Mist.MistMannedGimbalControlComponent.ClientNotifyProjectileImpact // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x1133440
};

// Class Mist.MistBattleFanComponent
// Size: 0x828 (Inherited: 0x598)
struct UMistBattleFanComponent : UMistMannedGimbalControlComponent {
	struct FMulticastInlineDelegate OnStoredEffectChanged; // 0x598(0x10)
	bool bShowDebugForBattleFanValues; // 0x5a8(0x01)
	char pad_5A9[0x3]; // 0x5a9(0x03)
	float HeatingTime; // 0x5ac(0x04)
	float HeatingSpeedIncreaseRatio; // 0x5b0(0x04)
	float HeatingSpeedResetTime; // 0x5b4(0x04)
	float CoolingTime; // 0x5b8(0x04)
	float OverheatedCoolingTimePenaltyScale; // 0x5bc(0x04)
	float MaxWindPowerReachTime; // 0x5c0(0x04)
	float ZeroWindPowerReachTime; // 0x5c4(0x04)
	float MaxWindPower; // 0x5c8(0x04)
	char pad_5CC[0x4]; // 0x5cc(0x04)
	struct UCurveFloat* WindPowerDistanceScalingCurve; // 0x5d0(0x08)
	float SuperChargeTime; // 0x5d8(0x04)
	float SuperBlowDuration; // 0x5dc(0x04)
	float SuperBlowTime; // 0x5e0(0x04)
	char pad_5E4[0x4]; // 0x5e4(0x04)
	struct UCurveFloat* SuperChargeDistanceScalingCurve; // 0x5e8(0x08)
	float SuperChargePower; // 0x5f0(0x04)
	float SuperChargeLavaDamage; // 0x5f4(0x04)
	struct UDamageType* SuperChargeLavaDamageType; // 0x5f8(0x08)
	int32_t SuperChargeTorqueCost; // 0x600(0x04)
	int32_t SuperChargeLavaCost; // 0x604(0x04)
	float SuperChargeTimeForWindTargets; // 0x608(0x04)
	float SuperChargePowerForWindTargets; // 0x60c(0x04)
	float SuperChargePowerOnCollectedGasses; // 0x610(0x04)
	float SuperChargeTimeOnCollectedGasses; // 0x614(0x04)
	float SuperSuckTime; // 0x618(0x04)
	float SuperSuckChargeTime; // 0x61c(0x04)
	float SuperSuckPower; // 0x620(0x04)
	int32_t NumberOfGasesToAddEffect; // 0x624(0x04)
	float WalkerBoostAcceleration; // 0x628(0x04)
	float GasDissolvingDistance; // 0x62c(0x04)
	float SpawnedEffectDistance; // 0x630(0x04)
	char pad_634[0x4]; // 0x634(0x04)
	struct FMistComponentReference ShapeComponentReference; // 0x638(0x28)
	struct FMistComponentReference TorqueContainerReference; // 0x660(0x28)
	struct FMistComponentReference LavaContainerReference; // 0x688(0x28)
	struct FMistComponentReference GasContainerReference; // 0x6b0(0x28)
	float MaxBlowAffectingDistance; // 0x6d8(0x04)
	float MaxSuperBlowAffectingDistance; // 0x6dc(0x04)
	float MaxSuckAffectingDistance; // 0x6e0(0x04)
	bool bUncharging; // 0x6e4(0x01)
	char pad_6E5[0x3]; // 0x6e5(0x03)
	struct FMulticastInlineDelegate OnSuperBlow; // 0x6e8(0x10)
	struct FMulticastInlineDelegate OnSuperBlowWithLava; // 0x6f8(0x10)
	struct FMulticastInlineDelegate OnSuperBlowWithGas; // 0x708(0x10)
	struct FMulticastInlineDelegate OnSuperSuck; // 0x718(0x10)
	struct AMistAreaEffect* StoredEffectClass; // 0x728(0x08)
	enum class EMistBattleFanState BattleFanState; // 0x730(0x01)
	char pad_731[0x7]; // 0x731(0x07)
	float CurrentOverheatValue; // 0x738(0x04)
	float CurrentWindPower; // 0x73c(0x04)
	float CurrentSuperChargeProgress; // 0x740(0x04)
	char pad_744[0x4]; // 0x744(0x04)
	float CurrentSuperSuckProgress; // 0x748(0x04)
	char pad_74C[0x14]; // 0x74c(0x14)
	int32_t StoredEffectCount; // 0x760(0x04)
	char pad_764[0xa4]; // 0x764(0xa4)
	struct UShapeComponent* ShapeComponent; // 0x808(0x08)
	struct UMistTorqueContainerComponent* TorqueContainer; // 0x810(0x08)
	struct UMistContainerComponent* LavaContainer; // 0x818(0x08)
	char pad_820[0x8]; // 0x820(0x08)

	void StoredEffectChanged__DelegateSignature(struct AMistAreaEffect* EffectClass); // DelegateFunction Mist.MistBattleFanComponent.StoredEffectChanged__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x163f1c0
	void ServerSuperChargeEnd(); // Function Mist.MistBattleFanComponent.ServerSuperChargeEnd // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x10a41d0
	void ServerSuperChargeBegin(); // Function Mist.MistBattleFanComponent.ServerSuperChargeBegin // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x10a41b0
	void ServerChangeDirectionEnd(); // Function Mist.MistBattleFanComponent.ServerChangeDirectionEnd // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x10a4190
	void ServerChangeDirectionBegin(); // Function Mist.MistBattleFanComponent.ServerChangeDirectionBegin // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x10a4170
	void ServerBlowAirEnd(); // Function Mist.MistBattleFanComponent.ServerBlowAirEnd // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x10a4150
	void ServerBlowAirBegin(); // Function Mist.MistBattleFanComponent.ServerBlowAirBegin // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x10a4130
	void MulticastUpdateSuckedEffects(struct AMistAreaEffect* NewEffectClass, int32_t NewNumberOfSuckedEffects); // Function Mist.MistBattleFanComponent.MulticastUpdateSuckedEffects // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x10a3d30
	void MulticastSuperSuck(); // Function Mist.MistBattleFanComponent.MulticastSuperSuck // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x10a3d10
	void MulticastSuperBlowWithLava(); // Function Mist.MistBattleFanComponent.MulticastSuperBlowWithLava // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x10a3cf0
	void MulticastSuperBlowWithGas(); // Function Mist.MistBattleFanComponent.MulticastSuperBlowWithGas // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x10a3cd0
	void MulticastSuperBlow(); // Function Mist.MistBattleFanComponent.MulticastSuperBlow // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x10a3cb0
	void MulticastChangeBattleFanState(enum class EMistBattleFanState NewState); // Function Mist.MistBattleFanComponent.MulticastChangeBattleFanState // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x10a3c30
	void HandleTargetComponentDestroyed(struct UActorComponent* DestroyedComponent); // Function Mist.MistBattleFanComponent.HandleTargetComponentDestroyed // (Final|Native|Private) // @ game+0x10a35f0
	void HandleTargetActorDestroyed(struct AActor* DestroyedActor); // Function Mist.MistBattleFanComponent.HandleTargetActorDestroyed // (Final|Native|Private) // @ game+0x10a35f0
	void HandleComponentEndTrigger(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function Mist.MistBattleFanComponent.HandleComponentEndTrigger // (Final|Native|Private) // @ game+0x10a3430
	void HandleComponentEndComponentTrigger(struct UPrimitiveComponent* TriggerComponent, struct UPrimitiveComponent* OtherComponent, int32_t OtherBodyIndex); // Function Mist.MistBattleFanComponent.HandleComponentEndComponentTrigger // (Final|Native|Private) // @ game+0x10a3330
	void HandleComponentBeginTrigger(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function Mist.MistBattleFanComponent.HandleComponentBeginTrigger // (Final|Native|Private) // @ game+0x10a3270
	void HandleComponentBeginComponentTrigger(struct UPrimitiveComponent* TriggerComponent, struct UPrimitiveComponent* OtherComponent, int32_t OtherBodyIndex); // Function Mist.MistBattleFanComponent.HandleComponentBeginComponentTrigger // (Final|Native|Private) // @ game+0x10a3170
	struct AMistAreaEffect* GetLoadedAreaEffect(); // Function Mist.MistBattleFanComponent.GetLoadedAreaEffect // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10a2760
	void Event__DelegateSignature(); // DelegateFunction Mist.MistBattleFanComponent.Event__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x163f1c0
	void ConsoleServerSuperSuckEnd(); // Function Mist.MistBattleFanComponent.ConsoleServerSuperSuckEnd // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x10a1a10
	void ConsoleServerSuperSuckBegin(); // Function Mist.MistBattleFanComponent.ConsoleServerSuperSuckBegin // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x10a19f0
};

// Class Mist.MistBattleFanEffectContainerWidget
// Size: 0x2c8 (Inherited: 0x2c0)
struct UMistBattleFanEffectContainerWidget : UMistUIWidget {
	struct UImage* EffectImageWidget; // 0x2c0(0x08)
};

// Class Mist.MistBattleFanInventoryWidget
// Size: 0x2d0 (Inherited: 0x2c0)
struct UMistBattleFanInventoryWidget : UMistBaseActorWidget {
	struct UMistContainerWidget* LavaContainerWidget; // 0x2c0(0x08)
	struct UMistContainerWidget* TorqueContainerWidget; // 0x2c8(0x08)
};

// Class Mist.MistBattleFanTargetInterface
// Size: 0x28 (Inherited: 0x28)
struct UMistBattleFanTargetInterface : UInterface {
};

// Class Mist.MistBendingTree
// Size: 0x440 (Inherited: 0x3c0)
struct AMistBendingTree : AActor {
	struct UStaticMeshComponent* MeshComponent; // 0x3c0(0x08)
	struct UPhysicsConstraintComponent* ConstraintComponent; // 0x3c8(0x08)
	struct UBoxComponent* BoxComponent; // 0x3d0(0x08)
	char pad_3D8[0x8]; // 0x3d8(0x08)
	struct FQuat DamageRotation; // 0x3e0(0x10)
	float BendProgress; // 0x3f0(0x04)
	char pad_3F4[0xc]; // 0x3f4(0x0c)
	struct FTransform StartingTransform; // 0x400(0x30)
	float InertiaScale; // 0x430(0x04)
	float MassScale; // 0x434(0x04)
	float HealthScale; // 0x438(0x04)
	float FallAngle; // 0x43c(0x04)

	float GetAngle2(); // Function Mist.MistBendingTree.GetAngle2 // (Final|Native|Public|BlueprintCallable) // @ game+0x10a1ee0
	float GetAngle(); // Function Mist.MistBendingTree.GetAngle // (Final|Native|Public|BlueprintCallable) // @ game+0x10a1f10
	void BroadcastSetAngularOffset(struct FQuat NewAngle); // Function Mist.MistBendingTree.BroadcastSetAngularOffset // (Net|NetReliableNative|Event|Public|HasDefaults) // @ game+0x10a1710
	void BroadcastBreakConstraint(); // Function Mist.MistBendingTree.BroadcastBreakConstraint // (Net|NetReliableNative|Event|Public) // @ game+0x1096cb0
};

// Class Mist.MistMannedWalkerControlComponent
// Size: 0x600 (Inherited: 0x598)
struct UMistMannedWalkerControlComponent : UMistMannedGimbalControlComponent {
	bool bAlwaysSprint; // 0x598(0x01)
	char pad_599[0x3]; // 0x599(0x03)
	struct FVector2D Input; // 0x59c(0x08)
	bool bInputBrakes; // 0x5a4(0x01)
	char pad_5A5[0x3]; // 0x5a5(0x03)
	struct TArray<struct UMistRemoteBallistaControlComponent*> RemoteWeapons; // 0x5a8(0x10)
	float KeepInputAfterUnmanningTime; // 0x5b8(0x04)
	bool bAllowRemoteShooting; // 0x5bc(0x01)
	bool bAllowManningIfFlipped; // 0x5bd(0x01)
	char pad_5BE[0x2]; // 0x5be(0x02)
	struct AMistWalker* ControlledWalker; // 0x5c0(0x08)
	struct AMistCharacter* RemoteDrivingCharacter; // 0x5c8(0x08)
	char pad_5D0[0x8]; // 0x5d0(0x08)
	struct UMistWalkerSprintTorqueComponent* SprintComponent; // 0x5d8(0x08)
	char pad_5E0[0x20]; // 0x5e0(0x20)

	void ServerSetInput(struct FVector2D InValue, bool bBrakes, bool bSprinting, bool bAutoDrive); // Function Mist.MistMannedWalkerControlComponent.ServerSetInput // (Final|Net|NetReliableNative|Event|Private|NetServer|HasDefaults) // @ game+0x1137bd0
	void ServerLootItems(struct TArray<struct AMistDropBag*> Bags); // Function Mist.MistMannedWalkerControlComponent.ServerLootItems // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x1137a60
	void ServerHarvestFoliage(struct TArray<struct FMistWalkerHarvestingPair> Pairs); // Function Mist.MistMannedWalkerControlComponent.ServerHarvestFoliage // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x11379c0
	void ResetInput(); // Function Mist.MistMannedWalkerControlComponent.ResetInput // (Final|Native|Private) // @ game+0x11379a0
};

// Class Mist.MistBicycleWalkerControlComponent
// Size: 0x620 (Inherited: 0x600)
struct UMistBicycleWalkerControlComponent : UMistMannedWalkerControlComponent {
	float StaminaCost; // 0x600(0x04)
	float DefaultTorque; // 0x604(0x04)
	float SprintTorque; // 0x608(0x04)
	char pad_60C[0x10]; // 0x60c(0x10)
	bool bIsSprinting; // 0x61c(0x01)
	char pad_61D[0x3]; // 0x61d(0x03)

	void OnRep_IsSprinting(); // Function Mist.MistBicycleWalkerControlComponent.OnRep_IsSprinting // (Final|Native|Private) // @ game+0x10a3e00
	bool IsSprinting(); // Function Mist.MistBicycleWalkerControlComponent.IsSprinting // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10a39c0
};

// Class Mist.MistRecipe
// Size: 0xb0 (Inherited: 0x30)
struct UMistRecipe : UPrimaryDataAsset {
	struct FText Name; // 0x30(0x18)
	struct UTexture2D* Icon; // 0x48(0x08)
	struct UMistUnlockableTreeItem* RequiredUnlockable; // 0x50(0x08)
	struct TMap<struct UMistItemTemplate*, int32_t> Inputs; // 0x58(0x50)
	int32_t ExperienceReward; // 0xa8(0x04)
	char pad_AC[0x4]; // 0xac(0x04)
};

// Class Mist.MistBlueprint
// Size: 0x100 (Inherited: 0xb0)
struct UMistBlueprint : UMistRecipe {
	struct TMap<struct UMistItemTemplate*, int32_t> Outputs; // 0xb0(0x50)
};

// Class Mist.MistBlueprintLibrary
// Size: 0x28 (Inherited: 0x28)
struct UMistBlueprintLibrary : UBlueprintFunctionLibrary {

	void TriggerTutorialEvent(struct UObject* WorldContextObject, struct FName EventName, struct AMistOasisPlayerState* UpdatedPlayer); // Function Mist.MistBlueprintLibrary.TriggerTutorialEvent // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x10a4880
	void TriggerDelayedTutorialEvent(struct UObject* WorldContextObject, struct FName EventName, int32_t Delay, struct AMistOasisPlayerState* UpdatedPlayer); // Function Mist.MistBlueprintLibrary.TriggerDelayedTutorialEvent // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x10a4750
	void SpawnParticleEmitter(struct UObject* WorldContextObject, struct UParticleSystem* System, struct FTransform& Transform); // Function Mist.MistBlueprintLibrary.SpawnParticleEmitter // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x10a4600
	void SpawnLootInWorld(struct FMistLootDesc& Loot, struct UObject* WorldContextObject, struct FTransform& Transform, int32_t Iterations, bool bUseClaim); // Function Mist.MistBlueprintLibrary.SpawnLootInWorld // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x10a43f0
	void SpawnAndShootProjectileItem(struct UObject* WorldContextObject, struct UMistProjectileItemTemplate* ItemTemplateClass, struct FVector& Location, struct FRotator& Rotation, float OverrideInitialSpeed, struct APawn* Instigator); // Function Mist.MistBlueprintLibrary.SpawnAndShootProjectileItem // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x10a41f0
	void PlaySoundEffect(struct UObject* WorldContextObject, struct USoundBase* Sound, struct FVector Location, struct FRotator Rotation, float VolumeMultiplier, float PitchMultiplier, float StartTime, struct USoundAttenuation* AttenuationSettings, struct USoundConcurrency* ConcurrencySettings); // Function Mist.MistBlueprintLibrary.PlaySoundEffect // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x10a3ea0
	bool ModifyAsset(struct UObject* Asset); // Function Mist.MistBlueprintLibrary.ModifyAsset // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x10a3ad0
	struct UObject* LoadAsset(struct TSoftObjectPtr<UObject>& ObjectReference); // Function Mist.MistBlueprintLibrary.LoadAsset // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x10a3a10
	bool IsUsingGamepad(); // Function Mist.MistBlueprintLibrary.IsUsingGamepad // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x10a39e0
	bool IsPIE(struct UObject* WorldContextObject); // Function Mist.MistBlueprintLibrary.IsPIE // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x10a3940
	bool IsOnWalker(struct AMistCharacter* Character); // Function Mist.MistBlueprintLibrary.IsOnWalker // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x10a38c0
	bool IsInsideWorldBounds(struct UObject* WorldContextObject, struct FVector& Location); // Function Mist.MistBlueprintLibrary.IsInsideWorldBounds // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x10a37f0
	bool IsGUIEnabled(struct UObject* WorldContextObject); // Function Mist.MistBlueprintLibrary.IsGUIEnabled // (Final|BlueprintCosmetic|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x10a3670
	bool IsGrappled(struct AMistCharacter* Character); // Function Mist.MistBlueprintLibrary.IsGrappled // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x10a3770
	bool IsGameWorld(struct UObject* WorldContextObject); // Function Mist.MistBlueprintLibrary.IsGameWorld // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x10a36f0
	void GiveLootToCharacter(struct FMistLootDesc& Loot, struct AMistCharacter* Character, int32_t Iterations, bool bUseClaim); // Function Mist.MistBlueprintLibrary.GiveLootToCharacter // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x10a3000
	struct FBox GetWorldBounds(struct UObject* WorldContextObject); // Function Mist.MistBlueprintLibrary.GetWorldBounds // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x10a2f60
	struct UMistWeightMapCacheComponent* GetWeightMapCache(struct UObject* WorldContextObject); // Function Mist.MistBlueprintLibrary.GetWeightMapCache // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x10a2ee0
	struct AMistWeatherSystem* GetWeatherSystem(struct UObject* WorldObjectContext); // Function Mist.MistBlueprintLibrary.GetWeatherSystem // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x10a2e60
	struct AMistWalker* GetWalkerForCharacter(struct AMistCharacter* Character); // Function Mist.MistBlueprintLibrary.GetWalkerForCharacter // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x10a2de0
	struct UMistTutorialComponent* GetTutorialComponent(struct UObject* WorldContextObject); // Function Mist.MistBlueprintLibrary.GetTutorialComponent // (Final|BlueprintCosmetic|Native|Static|Public|BlueprintCallable) // @ game+0x10a2d30
	struct FVector GetTotalVelocity(struct AActor* Actor); // Function Mist.MistBlueprintLibrary.GetTotalVelocity // (Final|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x10a2ca0
	struct AMistSceneManager* GetSceneManager(struct UObject* WorldContextObject); // Function Mist.MistBlueprintLibrary.GetSceneManager // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x10a2c20
	void GetProceduralFoliageSpawnerMeshes(struct UObject* WorldConextObject, struct UProceduralFoliageSpawner* ProceduralFoliageSpawner, struct TArray<struct UStaticMesh*>& StaticMeshes); // Function Mist.MistBlueprintLibrary.GetProceduralFoliageSpawnerMeshes // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x10a2b00
	void GetPlayerControllerHiddenActors(struct APlayerController* PlayerController, struct TArray<struct AActor*>& HiddenActors); // Function Mist.MistBlueprintLibrary.GetPlayerControllerHiddenActors // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x10a2a20
	struct TArray<struct AMistPlayer*> GetNearbyPlayers(struct UObject* WorldContextObject, struct FVector& Location, float Range, bool bCheckHeight); // Function Mist.MistBlueprintLibrary.GetNearbyPlayers // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x10a2870
	float GetMapFloorZForLocation(struct UObject* WorldContextObject, struct FVector& InLocation); // Function Mist.MistBlueprintLibrary.GetMapFloorZForLocation // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x10a27a0
	void GetLandscapeGrassTypes(struct UObject* WorldContextObject, struct ALandscapeProxy* LandscapeProxy, struct TArray<struct ULandscapeGrassType*>& GrassTypes); // Function Mist.MistBlueprintLibrary.GetLandscapeGrassTypes // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x10a2640
	struct UVirtualLandscapeLayer* GetDominantLandscapeLayer(struct UObject* WorldContextObject, struct FVector& Location); // Function Mist.MistBlueprintLibrary.GetDominantLandscapeLayer // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x10a2560
	struct UMistTutorialQuest* GetCurrentTutorialQuest(struct UObject* WorldContextObject); // Function Mist.MistBlueprintLibrary.GetCurrentTutorialQuest // (Final|BlueprintCosmetic|Native|Static|Public|BlueprintCallable) // @ game+0x10a24e0
	struct AMistLevelActor* GetCurrentLevel(struct UObject* WorldContextObject); // Function Mist.MistBlueprintLibrary.GetCurrentLevel // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x10a2460
	bool GetCombatLandedHitEffects(enum class EPhysicalSurface InWeapon, enum class EPhysicalSurface InTarget, struct USoundCue*& OutSoundCue, float& OutThreshold1, float& OutThreshold2, float& OutThreshold3); // Function Mist.MistBlueprintLibrary.GetCombatLandedHitEffects // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x10a2260
	bool GetCombatHitObjectEffects(enum class EPhysicalSurface InWeapon, enum class EPhysicalSurface InTarget, bool bIsChambered, struct USoundCue*& OutSoundCue, struct UParticleSystem*& OutParticleEffect, float& OutVolume, struct UMaterialInstance*& OutDecal, struct FVector& OutDecalScale); // Function Mist.MistBlueprintLibrary.GetCombatHitObjectEffects // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x10a1fc0
	struct UObject* GetClassDefaultObject(struct UObject* Class); // Function Mist.MistBlueprintLibrary.GetClassDefaultObject // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x10a1f40
	struct TArray<struct UObject*> GetAllBlueprintAssetsOfClass(struct FString Path, struct UObject* Class); // Function Mist.MistBlueprintLibrary.GetAllBlueprintAssetsOfClass // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x10a1dc0
	void FindActorByClass(struct UObject* WorldContextObject, struct AActor* ActorClass, struct AActor*& OutResult); // Function Mist.MistBlueprintLibrary.FindActorByClass // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x10a1cc0
	void EvaluateLoot(struct FMistLootDesc& Loot, int32_t Iterations, struct TArray<struct FMistItemWithQuantity>& OutItems); // Function Mist.MistBlueprintLibrary.EvaluateLoot // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x10a1b60
	struct USceneComponent* CreateAndAttachComponent(struct USceneComponent* ParentComponent, struct UObject* Class, struct UObject* Outer, struct FName Name); // Function Mist.MistBlueprintLibrary.CreateAndAttachComponent // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x10a1a30
	bool CheckCategoryOrTemplate(struct UMistItemCategory* Category, struct UMistItemCategory* CategoryToCheck, struct UMistItemTemplate* Template, struct UMistItemTemplate* TemplateToCheck); // Function Mist.MistBlueprintLibrary.CheckCategoryOrTemplate // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x10a18c0
	bool CheckCategoryAndTemplate(struct UMistItemCategory* Category, struct UMistItemCategory* CategoryToCheck, struct UMistItemTemplate* Template, struct UMistItemTemplate* TemplateToCheck); // Function Mist.MistBlueprintLibrary.CheckCategoryAndTemplate // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x10a1790
	void BroadcastMessageToPlayers(struct UObject* WorldContextObject, struct FText& Message, struct AActor* Source, float MaxDistance, bool bOnlySameClanAsSource); // Function Mist.MistBlueprintLibrary.BroadcastMessageToPlayers // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x10a1530
	void AddPlayerControllerHiddenComponent(struct APlayerController* PlayerController, struct UPrimitiveComponent* Component); // Function Mist.MistBlueprintLibrary.AddPlayerControllerHiddenComponent // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x10a1480
	void AddPlayerControllerHiddenActor(struct APlayerController* PlayerController, struct AActor* Actor); // Function Mist.MistBlueprintLibrary.AddPlayerControllerHiddenActor // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x10a13d0
	void AddHudWarningLog(struct UObject* WorldContextObject, struct AMistPlayer* Player, struct FText& Text); // Function Mist.MistBlueprintLibrary.AddHudWarningLog // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x10a1290
	void AddHudMessage(struct UObject* WorldContextObject, struct AMistPlayer* Player, struct FText& MessageText, bool bRequiresConfirmation); // Function Mist.MistBlueprintLibrary.AddHudMessage // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x10a1100
	void AddHudLog(struct UObject* WorldContextObject, struct AMistPlayer* Player, struct FName& Type, struct FText& TextOverride); // Function Mist.MistBlueprintLibrary.AddHudLog // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x10a0f60
	void AddHudInfoLog(struct UObject* WorldContextObject, struct AMistPlayer* Player, struct FText& Text); // Function Mist.MistBlueprintLibrary.AddHudInfoLog // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x10a0e20
	void AddHudErrorLog(struct UObject* WorldContextObject, struct AMistPlayer* Player, struct FText& Text); // Function Mist.MistBlueprintLibrary.AddHudErrorLog // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x10a0ce0
	void AddHudCountdown(struct UObject* WorldContextObject, struct AMistPlayer* Player, struct FText& Text, float Seconds, bool bRemoveOnDeathOrRespawn); // Function Mist.MistBlueprintLibrary.AddHudCountdown // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x10a0b00
};

// Class Mist.MistBoardingPlankInteractableComponent
// Size: 0x2a0 (Inherited: 0x1f0)
struct UMistBoardingPlankInteractableComponent : UMistInteractableComponent {
	struct FMistComponentReference BoardingPlank; // 0x1f0(0x28)
	struct FMulticastInlineDelegate OnLowering; // 0x218(0x10)
	struct FMulticastInlineDelegate OnRaising; // 0x228(0x10)
	float RotationDuration; // 0x238(0x04)
	struct FRotator Target; // 0x23c(0x0c)
	struct USceneComponent* BoardingPlankComponent; // 0x248(0x08)
	enum class FMistBoardingPlankState State; // 0x250(0x01)
	char pad_251[0xf]; // 0x251(0x0f)
	struct FTransform InitialTransform; // 0x260(0x30)
	char pad_290[0x10]; // 0x290(0x10)

	void OnRep_State(); // Function Mist.MistBoardingPlankInteractableComponent.OnRep_State // (Final|Native|Private) // @ game+0x10a8480
};

// Class Mist.MistBoostContainerComponent
// Size: 0x2f0 (Inherited: 0x2e0)
struct UMistBoostContainerComponent : UMistContainerComponent {
	char pad_2E0[0x8]; // 0x2e0(0x08)
	int32_t MaxSlotStackSize; // 0x2e8(0x04)
	char pad_2EC[0x4]; // 0x2ec(0x04)
};

// Class Mist.MistBoostItemDetailsWidget
// Size: 0x2e8 (Inherited: 0x2e0)
struct UMistBoostItemDetailsWidget : UMistItemDetailsWidget {
	struct UTextBlock* DetailsTextWidget; // 0x2e0(0x08)
};

// Class Mist.MistBoostItemTemplate
// Size: 0x1f0 (Inherited: 0x1d8)
struct UMistBoostItemTemplate : UMistItemTemplate {
	enum class EMistBoostType BoostType; // 0x1d8(0x01)
	char pad_1D9[0x3]; // 0x1d9(0x03)
	float PercentageIncreasePerItem; // 0x1dc(0x04)
	float AbsoluteIncreasePerItem; // 0x1e0(0x04)
	float MaximumPercentage; // 0x1e4(0x04)
	int32_t MaximumQuantity; // 0x1e8(0x04)
	char pad_1EC[0x4]; // 0x1ec(0x04)
};

// Class Mist.MistBorder
// Size: 0x278 (Inherited: 0x270)
struct UMistBorder : UBorder {
	struct FMistBrushStyle Style; // 0x270(0x08)
};

// Class Mist.MistBotControllableInterface
// Size: 0x28 (Inherited: 0x28)
struct UMistBotControllableInterface : UInterface {
};

// Class Mist.MistBottleQuest
// Size: 0x110 (Inherited: 0x110)
struct UMistBottleQuest : UMistTutorialQuest {
};

// Class Mist.MistItemActor
// Size: 0x430 (Inherited: 0x3c0)
struct AMistItemActor : AActor {
	char pad_3C0[0x48]; // 0x3c0(0x48)
	struct FMistItem Item; // 0x408(0x18)
	int32_t Quantity; // 0x420(0x04)
	char pad_424[0x4]; // 0x424(0x04)
	struct UMistItemTemplate* InitialItem; // 0x428(0x08)
};

// Class Mist.MistProjectile
// Size: 0x500 (Inherited: 0x430)
struct AMistProjectile : AMistItemActor {
	char pad_430[0x10]; // 0x430(0x10)
	struct UMistProjectileMovementComponent* MovementComponent; // 0x440(0x08)
	struct UStaticMeshComponent* MeshComponent; // 0x448(0x08)
	struct UBoxComponent* CombatTriggerShape; // 0x450(0x08)
	struct UBoxComponent* TriggererShape; // 0x458(0x08)
	struct UMistCollisionGroupComponent* CollisionGroupComponent; // 0x460(0x08)
	struct TArray<struct FMistToolTier> HarvestingToolInfo; // 0x468(0x10)
	float HitLifeSpan; // 0x478(0x04)
	char pad_47C[0x4]; // 0x47c(0x04)
	struct UCurveFloat* TimeInFlightDamageMod; // 0x480(0x08)
	struct UCurveFloat* VelocityDamageMod; // 0x488(0x08)
	struct UCurveFloat* TravelledDistanceDamageMod; // 0x490(0x08)
	bool bInheritVelocity; // 0x498(0x01)
	bool bHandThrown; // 0x499(0x01)
	bool bCheckForInitialImpact; // 0x49a(0x01)
	enum class EMistProjectilePostHitCollisionType PostHitCollisionType; // 0x49b(0x01)
	struct FName ComponentTagPenetratedByProjectile; // 0x49c(0x08)
	char pad_4A4[0x1c]; // 0x4a4(0x1c)
	struct FMulticastInlineDelegate OnImpact; // 0x4c0(0x10)
	char pad_4D0[0x4]; // 0x4d0(0x04)
	enum class EMistProjectileHitState HitState; // 0x4d4(0x04)
	char pad_4D8[0x28]; // 0x4d8(0x28)

	void Shoot(struct FVector& InitialVelocity); // Function Mist.MistProjectile.Shoot // (Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x117c2f0
	void ReceiveStop(struct FHitResult& ImpactResult); // Function Mist.MistProjectile.ReceiveStop // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x163f1c0
	void ReceiveMovementComponentDestroyed(); // Function Mist.MistProjectile.ReceiveMovementComponentDestroyed // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void ReceiveImpact(struct FHitResult& HitResult, struct FVector& Velocity, struct UPhysicalMaterial* PhysMaterial); // Function Mist.MistProjectile.ReceiveImpact // (Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0x163f1c0
	void OnRep_HitState(); // Function Mist.MistProjectile.OnRep_HitState // (Final|Native|Private) // @ game+0x117c200
	void MulticastImpactDamage(struct AMistCharacter* ImpactCharacter, float Damage); // Function Mist.MistProjectile.MulticastImpactDamage // (Net|Native|Event|NetMulticast|Public) // @ game+0x117c130
	void ImpactEvent__DelegateSignature(struct AMistProjectile* Projectile, struct FHitResult& HitResult, struct FVector& Velocity); // DelegateFunction Mist.MistProjectile.ImpactEvent__DelegateSignature // (MulticastDelegate|Public|Delegate|HasOutParms|HasDefaults) // @ game+0x163f1c0
	void HandleVirtualCollisionEndTrigger(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function Mist.MistProjectile.HandleVirtualCollisionEndTrigger // (Final|Native|Public) // @ game+0x117be30
	void HandleVirtualCollisionBeginTrigger(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function Mist.MistProjectile.HandleVirtualCollisionBeginTrigger // (Final|Native|Public) // @ game+0x117bd70
	void HandleStop(struct FHitResult& ImpactResult); // Function Mist.MistProjectile.HandleStop // (Native|Protected|HasOutParms) // @ game+0x117bc90
	void HandlePreImpact(struct FHitResult& ImpactResult, struct FVector& ImpactVelocity); // Function Mist.MistProjectile.HandlePreImpact // (Final|Native|Protected|HasOutParms|HasDefaults) // @ game+0x117b700
	void HandlePostImpact(struct FHitResult& ImpactResult, struct FVector& ImpactVelocity); // Function Mist.MistProjectile.HandlePostImpact // (Final|Native|Protected|HasOutParms|HasDefaults) // @ game+0x117b5d0
	void HandleImpact(struct FHitResult& ImpactResult, struct FVector& ImpactVelocity); // Function Mist.MistProjectile.HandleImpact // (Native|Protected|HasOutParms|HasDefaults) // @ game+0x117aff0
	void HandleFlyByCollisionComponentBeginTrigger(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function Mist.MistProjectile.HandleFlyByCollisionComponentBeginTrigger // (Final|Native|Private) // @ game+0x117af30
};

// Class Mist.MistBoulderProjectile
// Size: 0x518 (Inherited: 0x500)
struct AMistBoulderProjectile : AMistProjectile {
	char pad_500[0x10]; // 0x500(0x10)
	struct UDamageType* DamageType; // 0x510(0x08)
};

// Class Mist.MistBringItemQuestGenerator
// Size: 0x90 (Inherited: 0x30)
struct UMistBringItemQuestGenerator : UMistBaseQuestGenerator {
	struct UDataTable* BringItemTable; // 0x30(0x08)
	enum class EFlotillaQuestDifficulty Difficulty; // 0x38(0x01)
	char pad_39[0x3]; // 0x39(0x03)
	int32_t MinTargetTileDistance; // 0x3c(0x04)
	int32_t MaxTargetTileDistance; // 0x40(0x04)
	float BonusMultiplierForTravel; // 0x44(0x04)
	float BonusMultiplierPerTileDistance; // 0x48(0x04)
	float ProbabilityOfDifferentTileTarget; // 0x4c(0x04)
	bool bUseExpectedItemValueAsReward; // 0x50(0x01)
	char pad_51[0x3]; // 0x51(0x03)
	float ExpectedItemValueMultiplier; // 0x54(0x04)
	int32_t BaseFlotsReward; // 0x58(0x04)
	char pad_5C[0x34]; // 0x5c(0x34)
};

// Class Mist.MistBringItemsQuest
// Size: 0x70 (Inherited: 0x48)
struct UMistBringItemsQuest : UMistFlotillaQuest {
	struct UMistItemTemplate* Item; // 0x48(0x08)
	int32_t Amount; // 0x50(0x04)
	char pad_54[0x1c]; // 0x54(0x1c)
};

// Class Mist.MistPlayerComponent
// Size: 0x118 (Inherited: 0xf0)
struct UMistPlayerComponent : UActorComponent {
	char pad_F0[0x8]; // 0xf0(0x08)
	struct AMistPlayer* PlayerOwner; // 0xf8(0x08)
	struct AMistCharacter* CharacterOwner; // 0x100(0x08)
	struct UInputComponent* InputComponent; // 0x108(0x08)
	char pad_110[0x8]; // 0x110(0x08)
};

// Class Mist.MistPlayerEquipmentItemComponent
// Size: 0x128 (Inherited: 0x118)
struct UMistPlayerEquipmentItemComponent : UMistPlayerComponent {
	char pad_118[0x8]; // 0x118(0x08)
	enum class EEquipmentSlot Slot; // 0x120(0x01)
	enum class EEquipmentHand Hand; // 0x121(0x01)
	bool bRestrictInputToWielded; // 0x122(0x01)
	char pad_123[0x5]; // 0x123(0x05)

	void OnRep_Slot(enum class EEquipmentSlot PreviousSlot); // Function Mist.MistPlayerEquipmentItemComponent.OnRep_Slot // (Final|Native|Private) // @ game+0x116e210
	void OnRep_Hand(enum class EEquipmentHand PreviousHand); // Function Mist.MistPlayerEquipmentItemComponent.OnRep_Hand // (Final|Native|Private) // @ game+0x116e170
	void MulticastSetSlot(enum class EEquipmentSlot InSlot); // Function Mist.MistPlayerEquipmentItemComponent.MulticastSetSlot // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x10f0b20
	void MulticastSetHand(enum class EEquipmentHand InHand); // Function Mist.MistPlayerEquipmentItemComponent.MulticastSetHand // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x10f0ba0
};

// Class Mist.MistBrokenGrapplingHookComponent
// Size: 0x128 (Inherited: 0x128)
struct UMistBrokenGrapplingHookComponent : UMistPlayerEquipmentItemComponent {
};

// Class Mist.MistBrokenWormScale
// Size: 0x440 (Inherited: 0x3d0)
struct AMistBrokenWormScale : AStaticMeshActor {
	char pad_3D0[0x8]; // 0x3d0(0x08)
	float Health; // 0x3d8(0x04)
	float MaxHealth; // 0x3dc(0x04)
	float Stiffness; // 0x3e0(0x04)
	float MaxStiffness; // 0x3e4(0x04)
	struct UStaticMesh* ScaleMesh; // 0x3e8(0x08)
	struct TArray<struct FMistFoliageHarvestingEntry> HarvestingItemGood; // 0x3f0(0x10)
	struct TArray<struct FMistFoliageHarvestingEntry> HarvestingItemBad; // 0x400(0x10)
	struct UMistDamageOverrideTable* BrokenWormScaleDamageOverride; // 0x410(0x08)
	float HarvestingDamage; // 0x418(0x04)
	char pad_41C[0x4]; // 0x41c(0x04)
	struct FText ScaleName; // 0x420(0x18)
	struct UTexture2D* ScaleIcon; // 0x438(0x08)

	void OnRep_WormScaleHealth(float PrevHealth); // Function Mist.MistBrokenWormScale.OnRep_WormScaleHealth // (Final|Native|Private) // @ game+0x10a84a0
};

// Class Mist.MistBTComposite_Randomizer
// Size: 0x90 (Inherited: 0x90)
struct UMistBTComposite_Randomizer : UBTCompositeNode {
};

// Class Mist.MistBTService_Calculate2DDistance
// Size: 0xe8 (Inherited: 0x70)
struct UMistBTService_Calculate2DDistance : UBTService {
	struct FBlackboardKeySelector OriginBlackboardKey; // 0x70(0x28)
	struct FBlackboardKeySelector TargetBlackboardKey; // 0x98(0x28)
	struct FBlackboardKeySelector DistanceBlackboardKey; // 0xc0(0x28)
};

// Class Mist.MistBTService_CheckAirObstacles
// Size: 0xc8 (Inherited: 0x70)
struct UMistBTService_CheckAirObstacles : UBTService {
	struct FBlackboardKeySelector TargetLocationBlackboardKey; // 0x70(0x28)
	float CheckAngle; // 0x98(0x04)
	char pad_9C[0x4]; // 0x9c(0x04)
	struct FBlackboardKeySelector IsPathObstructedBlackboardKey; // 0xa0(0x28)
};

// Class Mist.MistBTService_CheckAttackTargets
// Size: 0x98 (Inherited: 0x70)
struct UMistBTService_CheckAttackTargets : UBTService {
	struct FBlackboardKeySelector OutIsAttackPossible; // 0x70(0x28)
};

// Class Mist.MistBTService_CheckOnWalker
// Size: 0xc0 (Inherited: 0x70)
struct UMistBTService_CheckOnWalker : UBTService {
	struct FBlackboardKeySelector TargetBlackboardKey; // 0x70(0x28)
	struct FBlackboardKeySelector ResultBlackboardKey; // 0x98(0x28)
};

// Class Mist.MistBTService_CheckPatrolDistance
// Size: 0xe8 (Inherited: 0x70)
struct UMistBTService_CheckPatrolDistance : UBTService {
	struct FBlackboardKeySelector OriginBlackboardKey; // 0x70(0x28)
	struct FBlackboardKeySelector RadiusBlackboardKey; // 0x98(0x28)
	struct FBlackboardKeySelector TargetBlackboardKey; // 0xc0(0x28)
};

// Class Mist.MistBTService_CheckTargetReached
// Size: 0xd0 (Inherited: 0x70)
struct UMistBTService_CheckTargetReached : UBTService {
	struct FBlackboardKeySelector TargetBlackboardKey; // 0x70(0x28)
	enum class ETargetReachedConditionType ConditionType; // 0x98(0x01)
	char pad_99[0x3]; // 0x99(0x03)
	float DistanceCondition; // 0x9c(0x04)
	float HeightCondition; // 0xa0(0x04)
	bool bSetBlackboardValue; // 0xa4(0x01)
	char pad_A5[0x3]; // 0xa5(0x03)
	struct FBlackboardKeySelector BlackboardValueToSet; // 0xa8(0x28)
};

// Class Mist.MistBTService_DelayedSetVar
// Size: 0xc8 (Inherited: 0x70)
struct UMistBTService_DelayedSetVar : UBTService {
	struct FBlackboardKeySelector VarToSetBlackboardKey; // 0x70(0x28)
	struct FBlackboardKeySelector CounterBlackboardKey; // 0x98(0x28)
	float BaseTime; // 0xc0(0x04)
	float RandPart; // 0xc4(0x04)
};

// Class Mist.MistBTService_FindTargetPlayer
// Size: 0xf0 (Inherited: 0x98)
struct UMistBTService_FindTargetPlayer : UBTService_BlackboardBase {
	struct FBlackboardKeySelector OriginBlackboardKey; // 0x98(0x28)
	struct FBlackboardKeySelector RadiusBlackboardKey; // 0xc0(0x28)
	float AggroThreshold; // 0xe8(0x04)
	char pad_EC[0x4]; // 0xec(0x04)
};

// Class Mist.MistBTService_IncreaseDamageIrritation
// Size: 0xe8 (Inherited: 0x70)
struct UMistBTService_IncreaseDamageIrritation : UBTService {
	struct FBlackboardKeySelector PrevHealthBlackboardKey; // 0x70(0x28)
	struct FBlackboardKeySelector IrritationLevelBlackboardKey; // 0x98(0x28)
	struct FBlackboardKeySelector MaxIrritationBlackboardKey; // 0xc0(0x28)
};

// Class Mist.MistBTService_KillinUpdateTargetAggro
// Size: 0x150 (Inherited: 0x98)
struct UMistBTService_KillinUpdateTargetAggro : UBTService_BlackboardBase {
	struct FBlackboardKeySelector IsAttacking; // 0x98(0x28)
	struct FBlackboardKeySelector OutAttackType; // 0xc0(0x28)
	struct FBlackboardKeySelector OutAggroValueBlackboardKey; // 0xe8(0x28)
	struct FBlackboardKeySelector AggroPivotPoint; // 0x110(0x28)
	float DeaggroDistanceFromPivot; // 0x138(0x04)
	float MinimumEngageAggro; // 0x13c(0x04)
	struct FVector2D TargetDistanceValueRange; // 0x140(0x08)
	float TargetClearDistance; // 0x148(0x04)
	char pad_14C[0x4]; // 0x14c(0x04)
};

// Class Mist.MistBTService_PlayersAbsentInRadius
// Size: 0xc8 (Inherited: 0x98)
struct UMistBTService_PlayersAbsentInRadius : UBTService_BlackboardBase {
	struct FBlackboardKeySelector RadiusKey; // 0x98(0x28)
	float Radius; // 0xc0(0x04)
	char pad_C4[0x4]; // 0xc4(0x04)
};

// Class Mist.MistBTService_PredictTargetLocation
// Size: 0xd0 (Inherited: 0x70)
struct UMistBTService_PredictTargetLocation : UBTService {
	struct FBlackboardKeySelector TargetBlackboardKey; // 0x70(0x28)
	struct FBlackboardKeySelector BlackboardValueToSet; // 0x98(0x28)
	struct FVector TargetOffset; // 0xc0(0x0c)
	char pad_CC[0x4]; // 0xcc(0x04)
};

// Class Mist.MistBTService_UpdateBehavior
// Size: 0x70 (Inherited: 0x70)
struct UMistBTService_UpdateBehavior : UBTService {
};

// Class Mist.MistBTService_UpdateDamagedState
// Size: 0x118 (Inherited: 0x70)
struct UMistBTService_UpdateDamagedState : UBTService {
	struct FBlackboardKeySelector IsDamagedBlackboardKey; // 0x70(0x28)
	struct FBlackboardKeySelector PrevHealthBlackboardKey; // 0x98(0x28)
	struct FBlackboardKeySelector PrevDamagedTimeBlackboardKey; // 0xc0(0x28)
	struct FBlackboardKeySelector BadlyHurtBlackboardKey; // 0xe8(0x28)
	float DamagedPeriod; // 0x110(0x04)
	float BadlyHurtThreshold; // 0x114(0x04)
};

// Class Mist.MistBTService_UpdateTargetAggro
// Size: 0xe0 (Inherited: 0x98)
struct UMistBTService_UpdateTargetAggro : UBTService_BlackboardBase {
	struct FBlackboardKeySelector OutAggroValueBlackboardKey; // 0x98(0x28)
	float TargetMinAggro; // 0xc0(0x04)
	float TargetMaxDistance; // 0xc4(0x04)
	float TargetAddDistance; // 0xc8(0x04)
	float TargetClearDistance; // 0xcc(0x04)
	bool FavorWalkers; // 0xd0(0x01)
	char pad_D1[0x7]; // 0xd1(0x07)
	struct AActor* TargetClass; // 0xd8(0x08)
};

// Class Mist.MistBTService_UpdateTargetReachability
// Size: 0x138 (Inherited: 0x70)
struct UMistBTService_UpdateTargetReachability : UBTService {
	struct FBlackboardKeySelector TargetBlackboardKey; // 0x70(0x28)
	struct FBlackboardKeySelector IsReachableBlackboardKey; // 0x98(0x28)
	struct FBlackboardKeySelector IsSelfOnWalkerBlackboardKey; // 0xc0(0x28)
	struct FBlackboardKeySelector IsTargetOnWalkerBlackboardKey; // 0xe8(0x28)
	struct FBlackboardKeySelector IsTargetGrappledBlackboardKey; // 0x110(0x28)
};

// Class Mist.MistBTService_UpdateTethered
// Size: 0x98 (Inherited: 0x70)
struct UMistBTService_UpdateTethered : UBTService {
	struct FBlackboardKeySelector TetheredFlagBlackboardKey; // 0x70(0x28)
};

// Class Mist.MistBTTask_AnimalAttack
// Size: 0xa8 (Inherited: 0x98)
struct UMistBTTask_AnimalAttack : UBTTask_BlackboardBase {
	struct FName AnimationToPlay; // 0x98(0x08)
	bool bOrderByDamageLowest; // 0xa0(0x01)
	bool bForceResult; // 0xa1(0x01)
	enum class EBTNodeResult ForcedResult; // 0xa2(0x01)
	char pad_A3[0x5]; // 0xa3(0x05)
};

// Class Mist.MistBTTask_AttackPlayer
// Size: 0xc8 (Inherited: 0x98)
struct UMistBTTask_AttackPlayer : UBTTask_BlackboardBase {
	char pad_98[0x30]; // 0x98(0x30)
};

// Class Mist.MistBTTask_ChangeBehavior
// Size: 0x80 (Inherited: 0x70)
struct UMistBTTask_ChangeBehavior : UBTTaskNode {
	struct FName NewBTName; // 0x70(0x08)
	bool AcceptDefaultBT; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
};

// Class Mist.MistBTTask_ChangeTargetAggro
// Size: 0xa0 (Inherited: 0x98)
struct UMistBTTask_ChangeTargetAggro : UBTTask_BlackboardBase {
	float AggroDelta; // 0x98(0x04)
	char pad_9C[0x4]; // 0x9c(0x04)
};

// Class Mist.MistBTTask_DespawnPawn
// Size: 0x70 (Inherited: 0x70)
struct UMistBTTask_DespawnPawn : UBTTaskNode {
};

// Class Mist.MistBTTask_DropTether
// Size: 0x98 (Inherited: 0x98)
struct UMistBTTask_DropTether : UBTTask_BlackboardBase {
};

// Class Mist.MistBTTask_EquipAmmo
// Size: 0x98 (Inherited: 0x98)
struct UMistBTTask_EquipAmmo : UBTTask_BlackboardBase {
};

// Class Mist.MistBTTask_EquipAmmoToBot
// Size: 0xc0 (Inherited: 0x98)
struct UMistBTTask_EquipAmmoToBot : UBTTask_BlackboardBase {
	struct FBlackboardKeySelector ControlComponentKey; // 0x98(0x28)
};

// Class Mist.MistBTTask_FindGround
// Size: 0xa0 (Inherited: 0x98)
struct UMistBTTask_FindGround : UBTTask_BlackboardBase {
	float CheckDistance; // 0x98(0x04)
	char pad_9C[0x4]; // 0x9c(0x04)
};

// Class Mist.MistBTTask_FindInAirLocation
// Size: 0x128 (Inherited: 0x98)
struct UMistBTTask_FindInAirLocation : UBTTask_BlackboardBase {
	struct FBlackboardKeySelector TargetBlackboardKey; // 0x98(0x28)
	struct FBlackboardKeySelector OriginBlackboardKey; // 0xc0(0x28)
	struct FBlackboardKeySelector RadiusBlackboardKey; // 0xe8(0x28)
	float Radius; // 0x110(0x04)
	float MaxDistance; // 0x114(0x04)
	float MinHeight; // 0x118(0x04)
	float HeightRand; // 0x11c(0x04)
	float TargetPositionPredictTime; // 0x120(0x04)
	char pad_124[0x4]; // 0x124(0x04)
};

// Class Mist.MistBTTask_FindLocationInRadius
// Size: 0xf0 (Inherited: 0x98)
struct UMistBTTask_FindLocationInRadius : UBTTask_BlackboardBase {
	struct FBlackboardKeySelector OriginBlackboardKey; // 0x98(0x28)
	struct FBlackboardKeySelector RadiusBlackboardKey; // 0xc0(0x28)
	float Radius; // 0xe8(0x04)
	char pad_EC[0x4]; // 0xec(0x04)
};

// Class Mist.MistBTTask_FindTargetPlayer
// Size: 0xc0 (Inherited: 0x98)
struct UMistBTTask_FindTargetPlayer : UBTTask_BlackboardBase {
	struct FBlackboardKeySelector AggroRadiusBlackboardKey; // 0x98(0x28)
};

// Class Mist.MistBTTask_FinishBehavior
// Size: 0x78 (Inherited: 0x70)
struct UMistBTTask_FinishBehavior : UBTTaskNode {
	bool bSuccess; // 0x70(0x01)
	char pad_71[0x7]; // 0x71(0x07)
};

// Class Mist.MistBTTask_FollowMovementTrajectory
// Size: 0x198 (Inherited: 0x98)
struct UMistBTTask_FollowMovementTrajectory : UBTTask_BlackboardBase {
	enum class EMovementTrajectoryType TrajectoryType; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
	struct FBlackboardKeySelector TargetLocation; // 0xa0(0x28)
	struct FBlackboardKeySelector IsPathObstructed; // 0xc8(0x28)
	struct FBlackboardKeySelector ResultValue; // 0xf0(0x28)
	struct FBlackboardKeySelector PreferTargetApproachDirection; // 0x118(0x28)
	struct FBlackboardKeySelector TargetApproachDirection; // 0x140(0x28)
	float ObstructionCheckFrequency; // 0x168(0x04)
	float ObstructionCheckDistance; // 0x16c(0x04)
	int32_t TrajectoryPointsNum; // 0x170(0x04)
	int32_t TrajectoryStartDistance; // 0x174(0x04)
	struct FVector2D TargetLocationOffset; // 0x178(0x08)
	float PatrolZoneRadius; // 0x180(0x04)
	int32_t PatrolLoops; // 0x184(0x04)
	int32_t PointsPerLoop; // 0x188(0x04)
	float HeightOffset; // 0x18c(0x04)
	bool bContinuouslyAdjustTrajectory; // 0x190(0x01)
	bool bForceResult; // 0x191(0x01)
	enum class EBTNodeResult ForcedResult; // 0x192(0x01)
	char pad_193[0x5]; // 0x193(0x05)
};

// Class Mist.MistBTTask_FollowPatrolPath
// Size: 0xd0 (Inherited: 0x98)
struct UMistBTTask_FollowPatrolPath : UBTTask_BlackboardBase {
	struct FBlackboardKeySelector PatrolZoneCenter; // 0x98(0x28)
	float PatrolZoneRadius; // 0xc0(0x04)
	int32_t PatrolLoops; // 0xc4(0x04)
	int32_t PointsPerLoop; // 0xc8(0x04)
	bool bForceResult; // 0xcc(0x01)
	enum class EBTNodeResult ForcedResult; // 0xcd(0x01)
	char pad_CE[0x2]; // 0xce(0x02)
};

// Class Mist.MistBTTask_ForcedAnimAction
// Size: 0xb8 (Inherited: 0x98)
struct UMistBTTask_ForcedAnimAction : UBTTask_BlackboardBase {
	struct UAnimMontage* MontageToPlay; // 0x98(0x08)
	float ForceScale; // 0xa0(0x04)
	char pad_A4[0x4]; // 0xa4(0x04)
	struct UCurveFloat* FwdForce; // 0xa8(0x08)
	struct UCurveFloat* UpForce; // 0xb0(0x08)
};

// Class Mist.MistBTTask_GenerateMovementSegment
// Size: 0x148 (Inherited: 0x98)
struct UMistBTTask_GenerateMovementSegment : UBTTask_BlackboardBase {
	struct FBlackboardKeySelector InTargetPointBlackboardKey; // 0x98(0x28)
	struct FBlackboardKeySelector OutIdleTimeBlackboardKey; // 0xc0(0x28)
	struct FBlackboardKeySelector OutMovementTargetBlackboardKey; // 0xe8(0x28)
	float SegmentLength; // 0x110(0x04)
	float MaxHeightDifference; // 0x114(0x04)
	float SegmentLengthVariation; // 0x118(0x04)
	float TargetPatrollRadius; // 0x11c(0x04)
	float MaxRandomTurnAngle; // 0x120(0x04)
	float MaxAngleDeviationFromTarget; // 0x124(0x04)
	float PathCheckMult; // 0x128(0x04)
	float PathCheckRandomStepHeight; // 0x12c(0x04)
	bool TripleRayCheck; // 0x130(0x01)
	char pad_131[0x17]; // 0x131(0x17)
};

// Class Mist.MistBTTask_JumpTo
// Size: 0xd0 (Inherited: 0x98)
struct UMistBTTask_JumpTo : UBTTask_BlackboardBase {
	bool bAllowUngrapplingPlayers; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
	struct FBlackboardKeySelector BackLocation; // 0xa0(0x28)
	float BackDistance; // 0xc8(0x04)
	char pad_CC[0x4]; // 0xcc(0x04)
};

// Class Mist.MistBTTask_KillinGrab
// Size: 0x108 (Inherited: 0x98)
struct UMistBTTask_KillinGrab : UBTTask_BlackboardBase {
	struct FName AnimationToPlay; // 0x98(0x08)
	bool bForceResult; // 0xa0(0x01)
	char pad_A1[0x3]; // 0xa1(0x03)
	struct FName AttachBoneName; // 0xa4(0x08)
	char pad_AC[0x4]; // 0xac(0x04)
	struct FBlackboardKeySelector OutIsCarryingBlackboardKey; // 0xb0(0x28)
	struct FBlackboardKeySelector OutCarriedActorBlackboardKey; // 0xd8(0x28)
	enum class EBTNodeResult ForcedResult; // 0x100(0x01)
	char pad_101[0x7]; // 0x101(0x07)
};

// Class Mist.MistBTTask_ManWeapon
// Size: 0x98 (Inherited: 0x98)
struct UMistBTTask_ManWeapon : UBTTask_BlackboardBase {
};

// Class Mist.MistBTTask_PerformPhysicalRootMotion
// Size: 0xb0 (Inherited: 0x98)
struct UMistBTTask_PerformPhysicalRootMotion : UBTTask_BlackboardBase {
	struct UAnimMontage* MontageToPlay; // 0x98(0x08)
	struct FVector ForceScale; // 0xa0(0x0c)
	char pad_AC[0x4]; // 0xac(0x04)
};

// Class Mist.MistBTTask_PerformRangedAttack
// Size: 0x110 (Inherited: 0x98)
struct UMistBTTask_PerformRangedAttack : UBTTask_BlackboardBase {
	struct UAnimMontage* AnimationToPlay; // 0x98(0x08)
	struct FVector AimOffset; // 0xa0(0x0c)
	float Deviation; // 0xac(0x04)
	struct AMistProjectile* ProjectileClass; // 0xb0(0x08)
	struct FBlackboardKeySelector ProjectileKey; // 0xb8(0x28)
	struct UBehaviorTreeComponent* MyOwnerComp; // 0xe0(0x08)
	char pad_E8[0x28]; // 0xe8(0x28)

	void HandleMontageInterrupted(struct UAnimMontage* Montage, bool bInterrupted); // Function Mist.MistBTTask_PerformRangedAttack.HandleMontageInterrupted // (Final|Native|Private) // @ game+0x10abe30
};

// Class Mist.MistBTTask_PlayMontage
// Size: 0xa8 (Inherited: 0x70)
struct UMistBTTask_PlayMontage : UBTTaskNode {
	struct UAnimMontage* AnimationToPlay; // 0x70(0x08)
	char bLooping : 1; // 0x78(0x01)
	char bNonBlocking : 1; // 0x78(0x01)
	char pad_78_2 : 6; // 0x78(0x01)
	char pad_79[0x3]; // 0x79(0x03)
	enum class EBTNodeResult ForcedResult; // 0x7c(0x01)
	char pad_7D[0x3]; // 0x7d(0x03)
	struct UBehaviorTreeComponent* MyOwnerComp; // 0x80(0x08)
	struct USkeletalMeshComponent* CachedSkelMesh; // 0x88(0x08)
	char pad_90[0x18]; // 0x90(0x18)
};

// Class Mist.MistBTTask_RegenerateHealth
// Size: 0x78 (Inherited: 0x70)
struct UMistBTTask_RegenerateHealth : UBTTaskNode {
	float TimeToFullyRegen; // 0x70(0x04)
	char pad_74[0x4]; // 0x74(0x04)
};

// Class Mist.MistBTTask_ResetCombatState
// Size: 0x70 (Inherited: 0x70)
struct UMistBTTask_ResetCombatState : UBTTaskNode {
};

// Class Mist.MistBTTask_ResetTarget
// Size: 0x98 (Inherited: 0x98)
struct UMistBTTask_ResetTarget : UBTTask_BlackboardBase {
};

// Class Mist.MistBTTask_RunFromTarget
// Size: 0xc8 (Inherited: 0x98)
struct UMistBTTask_RunFromTarget : UBTTask_BlackboardBase {
	float DistanceToRun; // 0x98(0x04)
	char pad_9C[0x4]; // 0x9c(0x04)
	struct FBlackboardKeySelector OutGoalLocationBlackboardKey; // 0xa0(0x28)
};

// Class Mist.MistBTTask_SetSprinting
// Size: 0xa0 (Inherited: 0x98)
struct UMistBTTask_SetSprinting : UBTTask_BlackboardBase {
	bool Enable; // 0x98(0x01)
	char pad_99[0x7]; // 0x99(0x07)
};

// Class Mist.MistBTTask_Shoot
// Size: 0xc0 (Inherited: 0x98)
struct UMistBTTask_Shoot : UBTTask_BlackboardBase {
	struct FBlackboardKeySelector BotControllableKey; // 0x98(0x28)
};

// Class Mist.MistBTTask_Taunt
// Size: 0xa0 (Inherited: 0x98)
struct UMistBTTask_Taunt : UBTTask_BlackboardBase {
	float Chance; // 0x98(0x04)
	char pad_9C[0x4]; // 0x9c(0x04)
};

// Class Mist.MistBTTask_TeherBallista
// Size: 0xc8 (Inherited: 0x98)
struct UMistBTTask_TeherBallista : UBTTask_BlackboardBase {
	struct FBlackboardKeySelector BotControllable; // 0x98(0x28)
	float TetheringTime; // 0xc0(0x04)
	float TetheringTimeDeviation; // 0xc4(0x04)
};

// Class Mist.MistBTTask_ThrowNet
// Size: 0xf0 (Inherited: 0x98)
struct UMistBTTask_ThrowNet : UBTTask_BlackboardBase {
	char pad_98[0x8]; // 0x98(0x08)
	struct UAnimMontage* AnimationToPlay; // 0xa0(0x08)
	struct FBlackboardKeySelector ProjectileKey; // 0xa8(0x28)
	struct UBehaviorTreeComponent* MyOwnerComp; // 0xd0(0x08)
	char pad_D8[0x18]; // 0xd8(0x18)
};

// Class Mist.MistBTTask_UpdateBehavior
// Size: 0x70 (Inherited: 0x70)
struct UMistBTTask_UpdateBehavior : UBTTaskNode {
};

// Class Mist.MistBuildingComponent
// Size: 0x330 (Inherited: 0x118)
struct UMistBuildingComponent : UMistPlayerComponent {
	char pad_118[0x8]; // 0x118(0x08)
	struct FMulticastInlineDelegate OnItemBuilt; // 0x120(0x10)
	char pad_130[0x18]; // 0x130(0x18)
	struct UMaterialInterface* PlacementMaterial; // 0x148(0x08)
	struct FLinearColor PlaceableColor; // 0x150(0x10)
	struct FLinearColor UnplaceableColor; // 0x160(0x10)
	struct UMaterialInstanceDynamic* PlacementMaterialInstance; // 0x170(0x08)
	struct UMistPlaceableTemplate* PlaceableTemplate; // 0x178(0x08)
	int32_t TargetQuality; // 0x180(0x04)
	char pad_184[0xc]; // 0x184(0x0c)
	struct FMistPlacementState PlacementState; // 0x190(0x50)
	struct FMistPlacementSnapState SnapState; // 0x1e0(0x70)
	char pad_250[0x30]; // 0x250(0x30)
	struct UMistStructureRenamingScreen* StructureRenamingScreen; // 0x280(0x08)
	struct UMistStructureCustomizationWidget* CustomizationWidget; // 0x288(0x08)
	struct AMistPlacementPreviewActor* PlacementActor; // 0x290(0x08)
	char pad_298[0x98]; // 0x298(0x98)

	void ServerRenameStructure(struct AMistStructurePart* Structure, struct FString NewCustomName); // Function Mist.MistBuildingComponent.ServerRenameStructure // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10ac400
	void ServerPlace(struct UMistPlaceableTemplate* InPlaceableTemplate, int32_t InTargetQuality, struct FMistPlacementState InPlacementState, struct FMistPlacementSnapState InSnapState); // Function Mist.MistBuildingComponent.ServerPlace // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x10ac210
	void ServerDisassemble(struct AActor* Placeable, int32_t ItemIndex); // Function Mist.MistBuildingComponent.ServerDisassemble // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x10ac140
	void ClientSetStructureCustomNameValidationFailed(struct FMistInvalidNameData Data); // Function Mist.MistBuildingComponent.ClientSetStructureCustomNameValidationFailed // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x10ab900
	void BuildingEvent__DelegateSignature(struct UMistPlaceableTemplate* PlaceableTemplate, struct AActor* PlacedActor); // DelegateFunction Mist.MistBuildingComponent.BuildingEvent__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x163f1c0
};

// Class Mist.MistBuildingHintsWidget
// Size: 0x328 (Inherited: 0x2c0)
struct UMistBuildingHintsWidget : UMistUIWidget {
	struct UWidget* CycleSnappingWidget; // 0x2c0(0x08)
	struct UWidget* ToggleSnappingWidget; // 0x2c8(0x08)
	struct UWidget* RaiseWidget; // 0x2d0(0x08)
	struct UWidget* LowerWidget; // 0x2d8(0x08)
	struct UMistInputBindingHintWidget* PlaceIconWidget; // 0x2e0(0x08)
	struct UMistInputBindingHintWidget* CancelIconWidget; // 0x2e8(0x08)
	struct UMistInputBindingHintWidget* RotateIconWidget; // 0x2f0(0x08)
	struct UMistInputBindingHintWidget* CycleSnappingIconWidget; // 0x2f8(0x08)
	struct UMistInputBindingHintWidget* ToggleSnappingIconWidget; // 0x300(0x08)
	struct UMistInputBindingHintWidget* CycleRotationIconWidget; // 0x308(0x08)
	struct UMistInputBindingHintWidget* RaiseBindingIconWidget; // 0x310(0x08)
	struct UMistInputBindingHintWidget* LowerBindingIconWidget; // 0x318(0x08)
	char pad_320[0x8]; // 0x320(0x08)
};

// Class Mist.MistRecipePopupWidget
// Size: 0x4f8 (Inherited: 0x2c0)
struct UMistRecipePopupWidget : UMistUIWidget {
	struct UTextBlock* NameWidget; // 0x2c0(0x08)
	struct UHorizontalBox* QuantityPanelWidget; // 0x2c8(0x08)
	struct UVerticalBox* ItemDetailsPanelWidget; // 0x2d0(0x08)
	struct UTextBlock* WeightWidget; // 0x2d8(0x08)
	struct UTextBlock* CraftingTimeText; // 0x2e0(0x08)
	struct UTextBlock* CraftingTimeWidget; // 0x2e8(0x08)
	struct UTextBlock* QuantityWidget; // 0x2f0(0x08)
	struct UScrollBox* InputListWidget; // 0x2f8(0x08)
	struct UBorder* DetailsContainerWidget; // 0x300(0x08)
	struct UVerticalBox* PartsPanelWidget; // 0x308(0x08)
	struct UScrollBox* PartsInputListWidget; // 0x310(0x08)
	struct UVerticalBox* OutputsPanelWidget; // 0x318(0x08)
	struct UScrollBox* OutputsListWidget; // 0x320(0x08)
	struct UHorizontalBox* PremiumChargesPanel; // 0x328(0x08)
	struct UTextBlock* PremiumChargesWidget; // 0x330(0x08)
	struct UHorizontalBox* IcChargesPanel; // 0x338(0x08)
	struct UTextBlock* IcChargesWidget; // 0x340(0x08)
	struct UScrollBox* VitaminsListWidget; // 0x348(0x08)
	struct UTextBlock* MissingVitaminsWidget; // 0x350(0x08)
	struct UTextBlock* MissingInputWidget; // 0x358(0x08)
	struct UTextBlock* DescriptionTextWidget; // 0x360(0x08)
	struct UProgressBar* HoldProgressWidget; // 0x368(0x08)
	struct UWidget* ActionConfirmPanelWidget; // 0x370(0x08)
	struct UWidget* ActionHintPanelWidget; // 0x378(0x08)
	struct UWidget* RequirementsArea; // 0x380(0x08)
	struct UTextBlock* CraftAmountTextWidget; // 0x388(0x08)
	struct FMistCraftingRequirements Requirements; // 0x390(0x60)
	char pad_3F0[0x18]; // 0x3f0(0x18)
	struct UMistItemTemplate* Item; // 0x408(0x08)
	struct FMistCraftingRequirements FullCostRequirements; // 0x410(0x60)
	struct TMap<struct UMistItemTemplate*, int32_t> Outputs; // 0x470(0x50)
	struct UMistCraftingStationComponent* CraftingStation; // 0x4c0(0x08)
	char pad_4C8[0x30]; // 0x4c8(0x30)

	void SetOutputsData(struct TMap<struct UMistItemTemplate*, int32_t>& InOutputs); // Function Mist.MistRecipePopupWidget.SetOutputsData // (Final|Native|Public|HasOutParms) // @ game+0x1187b80
	void SetItem(struct UMistItemTemplate* InItem, int32_t InRecipeId, struct UMistCraftingStationComponent* InCraftingStation); // Function Mist.MistRecipePopupWidget.SetItem // (Final|Native|Public) // @ game+0x1187a00
	void SetFullCostData(struct FMistCraftingRequirements& InRequirements); // Function Mist.MistRecipePopupWidget.SetFullCostData // (Final|Native|Public|HasOutParms) // @ game+0x1187860
	void SetData(struct FText& Title, struct FMistCraftingRequirements& InRequirements, struct FName& InShopItemId, struct FText& Description); // Function Mist.MistRecipePopupWidget.SetData // (Final|Native|Public|HasOutParms) // @ game+0x1187540
	void HandleProgressUpdate(float NewProgress); // Function Mist.MistRecipePopupWidget.HandleProgressUpdate // (Final|Native|Public) // @ game+0x1187150
};

// Class Mist.MistBuildingInfoWidget
// Size: 0x500 (Inherited: 0x4f8)
struct UMistBuildingInfoWidget : UMistRecipePopupWidget {
	struct UMistBuildingHintsWidget* HintsWidget; // 0x4f8(0x08)
};

// Class Mist.MistBuildingScreen
// Size: 0x558 (Inherited: 0x3a0)
struct UMistBuildingScreen : UMistUIScreen {
	float PaddingForFirstCategoryItemToEnsure; // 0x3a0(0x04)
	float TooltipToggleTime; // 0x3a4(0x04)
	uint32_t NumTemplatesPerRow; // 0x3a8(0x04)
	char pad_3AC[0x4]; // 0x3ac(0x04)
	struct FText DisassemblingText; // 0x3b0(0x18)
	struct FText RenamingText; // 0x3c8(0x18)
	struct FText CustomizingText; // 0x3e0(0x18)
	struct UWidget* BuildingWidget; // 0x3f8(0x08)
	struct UHorizontalBox* WallsCountWidget; // 0x400(0x08)
	struct UTextBlock* WallsCountTextBlock; // 0x408(0x08)
	struct UHorizontalBox* FoundationLinksWidget; // 0x410(0x08)
	struct UTextBlock* FoundationLinksTextBlock; // 0x418(0x08)
	struct UTextBlock* MessageWidget; // 0x420(0x08)
	struct UTextBlock* RotationAngleWidget; // 0x428(0x08)
	struct UTextBlock* SnappingEnabledWidget; // 0x430(0x08)
	struct UTextBlock* FreeBuildingStateWidget; // 0x438(0x08)
	struct UBorder* ModificationOverlay; // 0x440(0x08)
	struct UTextBlock* ModificationTextWidget; // 0x448(0x08)
	struct UScrollBox* CategoryScrollBox; // 0x450(0x08)
	struct UScrollBox* StructureCategoryScrollBox; // 0x458(0x08)
	struct UGridPanel* TemplateGridPanel; // 0x460(0x08)
	struct UMistUIButton* DisassembleButton; // 0x468(0x08)
	struct UMistUIButton* RenameButton; // 0x470(0x08)
	struct UMistUIButton* CustomizeButton; // 0x478(0x08)
	struct UWidget* RecipePanelWidget; // 0x480(0x08)
	struct UMistBuildingInfoWidget* InfoWidget; // 0x488(0x08)
	uint32_t DisassemblingHUDFlags; // 0x490(0x04)
	char pad_494[0x4]; // 0x494(0x04)
	struct UGridPanel* PlaceablePopupContainer; // 0x498(0x08)
	struct TArray<struct FMistBuildingCategory> UtilitySections; // 0x4a0(0x10)
	struct TArray<struct FMistBuildingCategory> StructureSections; // 0x4b0(0x10)
	struct UMistBuildingComponent* BuildingComponent; // 0x4c0(0x08)
	struct UMistInteractorComponent* InteractorComponent; // 0x4c8(0x08)
	struct UMistPlaceableCategoryWidget* CurrentCategoryWidget; // 0x4d0(0x08)
	char pad_4D8[0x18]; // 0x4d8(0x18)
	struct UMistPlaceablePreviewWidget* CurrentPlaceableWidget; // 0x4f0(0x08)
	char pad_4F8[0x60]; // 0x4f8(0x60)

	void OnDissasembleModePressed(); // Function Mist.MistBuildingScreen.OnDissasembleModePressed // (Final|Native|Private) // @ game+0x10ac120
	void HandleRenameClicked(struct UMistUIButton* Sender); // Function Mist.MistBuildingScreen.HandleRenameClicked // (Final|Native|Private) // @ game+0x10ac0a0
	void HandlePlayerTechUnlocked(struct AMistOasisPlayerState* Sender); // Function Mist.MistBuildingScreen.HandlePlayerTechUnlocked // (Final|Native|Private) // @ game+0x10ac020
	void HandlePlayerInventoryUpdate(); // Function Mist.MistBuildingScreen.HandlePlayerInventoryUpdate // (Final|Native|Private) // @ game+0x10ac000
	void HandlePlaceableSelected(struct UMistPlaceablePreviewWidget* Sender, struct UMistPlaceableTemplate* PlaceableTemplate, int32_t TargetQuality); // Function Mist.MistBuildingScreen.HandlePlaceableSelected // (Final|Native|Private) // @ game+0x10abf00
	struct UWidget* HandleLeaveTemplatesNavigation(enum class EUINavigation Nav); // Function Mist.MistBuildingScreen.HandleLeaveTemplatesNavigation // (Final|Native|Public|BlueprintCallable) // @ game+0x10abda0
	struct UWidget* HandleLeaveCategoriesNavigation(enum class EUINavigation Nav); // Function Mist.MistBuildingScreen.HandleLeaveCategoriesNavigation // (Final|Native|Public|BlueprintCallable) // @ game+0x10abd10
	void HandleDisassembleClicked(struct UMistUIButton* Sender); // Function Mist.MistBuildingScreen.HandleDisassembleClicked // (Final|Native|Private) // @ game+0x10abc90
	void HandleCustomizeClicked(struct UMistUIButton* Sender); // Function Mist.MistBuildingScreen.HandleCustomizeClicked // (Final|Native|Private) // @ game+0x10abc10
	void HandleCategoryChanged(struct UMistPlaceableCategoryWidget* Sender, int32_t CategoryIndex); // Function Mist.MistBuildingScreen.HandleCategoryChanged // (Final|Native|Private) // @ game+0x10abb50
	struct UWidget* GetClosestWidgetInTemplateGrid(enum class EUINavigation Nav); // Function Mist.MistBuildingScreen.GetClosestWidgetInTemplateGrid // (Final|Native|Public|BlueprintCallable) // @ game+0x10ab9a0
};

// Class Mist.MistBurningStatusEffect
// Size: 0x100 (Inherited: 0xe0)
struct UMistBurningStatusEffect : UMistStatusEffect {
	struct UParticleSystem* BurningEffect; // 0xe0(0x08)
	struct UMistDamageType* BurningDamage; // 0xe8(0x08)
	float SelfDamage; // 0xf0(0x04)
	float RadialDamage; // 0xf4(0x04)
	float DamageRadius; // 0xf8(0x04)
	char pad_FC[0x4]; // 0xfc(0x04)
};

// Class Mist.MistCachedPlaceableCostsData
// Size: 0x170 (Inherited: 0x30)
struct UMistCachedPlaceableCostsData : UPrimaryDataAsset {
	struct TMap<struct UMistPlaceableTemplate*, struct FMistCraftingRequirements> CachedTotalCost; // 0x30(0x50)
	struct TMap<struct UMistPlaceableTemplate*, struct FMistCraftingRequirements> CachedPartsCost; // 0x80(0x50)
	struct TMap<struct UMistPlaceableTemplate*, struct FMistCraftingPartsInformation> CachedPartsData; // 0xd0(0x50)
	struct TMap<struct UMistPlaceableTemplate*, struct TSoftClassPtr<UObject>> FinishedConstructionActor; // 0x120(0x50)
};

// Class Mist.MistStatusEffectAreaComponent
// Size: 0x130 (Inherited: 0xf0)
struct UMistStatusEffectAreaComponent : UActorComponent {
	struct FMistComponentReference TriggerComponentRef; // 0xf0(0x28)
	struct UMistStatusEffect* StatusEffectClass; // 0x118(0x08)
	bool bRemoveOnExit; // 0x120(0x01)
	char pad_121[0x7]; // 0x121(0x07)
	struct UPrimitiveComponent* CachedTriggerComponent; // 0x128(0x08)

	void HandleEndTrigger(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function Mist.MistStatusEffectAreaComponent.HandleEndTrigger // (Native|Protected) // @ game+0x11469e0
	void HandleBeginTrigger(struct UPrimitiveComponent* TriggerComponent, struct AActor* OtherActor); // Function Mist.MistStatusEffectAreaComponent.HandleBeginTrigger // (Native|Protected) // @ game+0x11a8700
};

// Class Mist.MistCampfireHealingComponent
// Size: 0x1a8 (Inherited: 0x130)
struct UMistCampfireHealingComponent : UMistStatusEffectAreaComponent {
	struct FMistComponentReference FuelCrafting; // 0x130(0x28)
	struct TSet<struct AMistPlayer*> PlayersInRange; // 0x158(0x50)

	void HandleBurningStopped(struct UMistCraftingStationComponent* Sender); // Function Mist.MistCampfireHealingComponent.HandleBurningStopped // (Native|Protected) // @ game+0x10abac0
	void HandleBurningStarted(struct UMistCraftingStationComponent* Sender); // Function Mist.MistCampfireHealingComponent.HandleBurningStarted // (Native|Protected) // @ game+0x10aba30
};

// Class Mist.MistCanteenWidget
// Size: 0x2f8 (Inherited: 0x2e0)
struct UMistCanteenWidget : UMistHUDWidget {
	float HydrationPercentage; // 0x2e0(0x04)
	bool bIsWellHydrated; // 0x2e4(0x01)
	char pad_2E5[0x3]; // 0x2e5(0x03)
	struct UMistUICircularProgressBar* WaterBarWidget; // 0x2e8(0x08)
	struct UTexture2D* WaterTexture; // 0x2f0(0x08)

	void HandleThirstChanged(struct UMistPlayerThirstComponent* StaminaComponent, float Thirst, float PrevThirst); // Function Mist.MistCanteenWidget.HandleThirstChanged // (Final|Native|Private) // @ game+0x10b17c0
};

// Class Mist.MistCanvasPanel
// Size: 0x138 (Inherited: 0x130)
struct UMistCanvasPanel : UCanvasPanel {
	struct UMistBaseToolTipWidget* ToolTipWidgetClass; // 0x130(0x08)

	struct UWidget* CreateToolTipWidget(); // Function Mist.MistCanvasPanel.CreateToolTipWidget // (Native|Protected) // @ game+0x10b1050
};

// Class Mist.MistCatapultAnimInstance
// Size: 0x290 (Inherited: 0x280)
struct UMistCatapultAnimInstance : UMistMannedControlAnimInstance {
	bool bRecoiling; // 0x278(0x01)
	bool bFiring; // 0x279(0x01)
	float PedalsPosition; // 0x27c(0x04)
	float ArmCrankPosition; // 0x280(0x04)
	float BlockCrankPosition; // 0x284(0x04)
	char pad_28E[0x2]; // 0x28e(0x02)
};

// Class Mist.MistCauterizingStationComponent
// Size: 0x5f0 (Inherited: 0x598)
struct UMistCauterizingStationComponent : UMistMannedGimbalControlComponent {
	struct TArray<struct UMistStatusEffect*> StatusEffects; // 0x598(0x10)
	struct UAnimSequence* CauterizeCharacterAnim; // 0x5a8(0x08)
	int32_t MaxChargesStored; // 0x5b0(0x04)
	char pad_5B4[0x4]; // 0x5b4(0x04)
	struct FMistComponentReference ContainerRef; // 0x5b8(0x28)
	struct UMistItemTemplate* HealingMaterialClass; // 0x5e0(0x08)
	char pad_5E8[0x8]; // 0x5e8(0x08)

	void HandleCharacterReceivedDamage(struct AActor* DamagedActor, float Damage, struct UDamageType* DamageType, struct FDamageSource& DamageSource); // Function Mist.MistCauterizingStationComponent.HandleCharacterReceivedDamage // (Final|Native|Private|HasOutParms) // @ game+0x10b1440
};

// Class Mist.MistChairAnimInstance
// Size: 0x290 (Inherited: 0x280)
struct UMistChairAnimInstance : UMistMannedControlAnimInstance {
	int32_t AnimationIndex; // 0x278(0x04)
	int32_t ChairType; // 0x27c(0x04)
	bool bMale; // 0x280(0x01)
	char pad_289[0x7]; // 0x289(0x07)
};

// Class Mist.MistChairControlComponent
// Size: 0x340 (Inherited: 0x330)
struct UMistChairControlComponent : UMistMannedControlComponent {
	int32_t ChairType; // 0x330(0x04)
	int32_t AnimationCount; // 0x334(0x04)
	int32_t AnimationIndex; // 0x338(0x04)
	char pad_33C[0x4]; // 0x33c(0x04)

	void ServerChangeAnimationIndex(int32_t NewIndex); // Function Mist.MistChairControlComponent.ServerChangeAnimationIndex // (Net|Native|Event|Protected|NetServer) // @ game+0x10b1f00
	void MulticastAnimationIndexChanged(int32_t NewIndex); // Function Mist.MistChairControlComponent.MulticastAnimationIndexChanged // (Net|Native|Event|NetMulticast|Protected) // @ game+0x10b19e0
};

// Class Mist.MistCharacterCombatAnimNotify
// Size: 0x40 (Inherited: 0x38)
struct UMistCharacterCombatAnimNotify : UAnimNotify {
	enum class ECustomEventType EventType; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class Mist.MistMeleeActionEnded
// Size: 0x40 (Inherited: 0x40)
struct UMistMeleeActionEnded : UMistCharacterCombatAnimNotify {
};

// Class Mist.MistMeleeTransitionAnimEnded
// Size: 0x40 (Inherited: 0x40)
struct UMistMeleeTransitionAnimEnded : UMistCharacterCombatAnimNotify {
};

// Class Mist.MistMeleeAttackCancellablePoint
// Size: 0x40 (Inherited: 0x40)
struct UMistMeleeAttackCancellablePoint : UMistCharacterCombatAnimNotify {
};

// Class Mist.MistMeleeAttackReadyEnded
// Size: 0x40 (Inherited: 0x40)
struct UMistMeleeAttackReadyEnded : UMistCharacterCombatAnimNotify {
};

// Class Mist.MistThrowProjectile
// Size: 0x40 (Inherited: 0x40)
struct UMistThrowProjectile : UMistCharacterCombatAnimNotify {
};

// Class Mist.MistEquipItemNotify
// Size: 0x40 (Inherited: 0x40)
struct UMistEquipItemNotify : UMistCharacterCombatAnimNotify {
};

// Class Mist.MistUnequipItemNotify
// Size: 0x40 (Inherited: 0x40)
struct UMistUnequipItemNotify : UMistCharacterCombatAnimNotify {
};

// Class Mist.MistCharacterCombatAnimNotifyState
// Size: 0x38 (Inherited: 0x30)
struct UMistCharacterCombatAnimNotifyState : UAnimNotifyState {
	enum class ECustomStateType StateType; // 0x30(0x01)
	char pad_31[0x7]; // 0x31(0x07)
};

// Class Mist.MistCheckBlockState
// Size: 0x38 (Inherited: 0x38)
struct UMistCheckBlockState : UMistCharacterCombatAnimNotifyState {
};

// Class Mist.MistFeintAreaState
// Size: 0x38 (Inherited: 0x38)
struct UMistFeintAreaState : UMistCharacterCombatAnimNotifyState {
};

// Class Mist.MistCharacterCustomizationItem
// Size: 0x58 (Inherited: 0x30)
struct UMistCharacterCustomizationItem : UDataAsset {
	struct TSoftObjectPtr<UTexture2D> PreviewIcon; // 0x30(0x28)

	void Apply(struct AActor* Actor, struct FMistCharacterCustomizationValues& Values); // Function Mist.MistCharacterCustomizationItem.Apply // (Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x10b0c40
};

// Class Mist.MistCharacterCustomizationHair
// Size: 0xd0 (Inherited: 0x58)
struct UMistCharacterCustomizationHair : UMistCharacterCustomizationItem {
	struct FMistCharacterCustomizationStaticMesh Hair; // 0x58(0x78)
};

// Class Mist.MistCharacterCustomizationFacialHair
// Size: 0xd0 (Inherited: 0x58)
struct UMistCharacterCustomizationFacialHair : UMistCharacterCustomizationItem {
	struct FMistCharacterCustomizationStaticMesh FacialHair; // 0x58(0x78)
};

// Class Mist.MistCharacterCustomizationHairColor
// Size: 0x80 (Inherited: 0x58)
struct UMistCharacterCustomizationHairColor : UMistCharacterCustomizationItem {
	struct FLinearColor RootColor; // 0x58(0x10)
	struct FLinearColor TipColor; // 0x68(0x10)
	float Scatter; // 0x78(0x04)
	char pad_7C[0x4]; // 0x7c(0x04)
};

// Class Mist.MistCharacterCustomizationEyeColor
// Size: 0x68 (Inherited: 0x58)
struct UMistCharacterCustomizationEyeColor : UMistCharacterCustomizationItem {
	struct FLinearColor IrisColor; // 0x58(0x10)
};

// Class Mist.MistCharacterCustomizationClothingColor
// Size: 0x78 (Inherited: 0x58)
struct UMistCharacterCustomizationClothingColor : UMistCharacterCustomizationItem {
	struct FLinearColor PrimaryColor; // 0x58(0x10)
	struct FLinearColor SecondaryColor; // 0x68(0x10)
};

// Class Mist.MistCharacterCustomizationBodyDetail
// Size: 0xa8 (Inherited: 0x58)
struct UMistCharacterCustomizationBodyDetail : UMistCharacterCustomizationItem {
	struct TSoftObjectPtr<UTexture2D> DiffuseTexture; // 0x58(0x28)
	struct TSoftObjectPtr<UTexture2D> NormalTexture; // 0x80(0x28)
};

// Class Mist.MistCharacterCustomizationHeadDetail
// Size: 0xa8 (Inherited: 0x58)
struct UMistCharacterCustomizationHeadDetail : UMistCharacterCustomizationItem {
	struct TSoftObjectPtr<UTexture2D> DiffuseTexture; // 0x58(0x28)
	struct TSoftObjectPtr<UTexture2D> NormalTexture; // 0x80(0x28)
};

// Class Mist.MistCharacterCustomizationSet
// Size: 0x3a8 (Inherited: 0x58)
struct UMistCharacterCustomizationSet : UMistCharacterCustomizationItem {
	enum class EMistCharacterGender Gender; // 0x58(0x01)
	char pad_59[0x7]; // 0x59(0x07)
	struct FMistCharacterCustomizationSkeletalMesh Head; // 0x60(0x78)
	struct FMistCharacterCustomizationSkeletalMesh Body; // 0xd8(0x78)
	struct FMistCharacterCustomizationSkeletalMesh UpperClothing; // 0x150(0x78)
	struct FMistCharacterCustomizationSkeletalMesh LowerClothing; // 0x1c8(0x78)
	struct FMistCharacterCustomizationSkeletalMesh HandsClothing; // 0x240(0x78)
	struct FMistCharacterCustomizationSkeletalMesh FeetClothing; // 0x2b8(0x78)
	struct UTexture2D* ClothingMask; // 0x330(0x08)
	struct TArray<struct UMistCharacterCustomizationHair*> Hairs; // 0x338(0x10)
	struct TArray<struct UMistCharacterCustomizationFacialHair*> FacialHairs; // 0x348(0x10)
	struct TArray<struct UMistCharacterCustomizationHairColor*> HairColors; // 0x358(0x10)
	struct TArray<struct UMistCharacterCustomizationEyeColor*> EyeColors; // 0x368(0x10)
	struct TArray<struct UMistCharacterCustomizationClothingColor*> ClothingColors; // 0x378(0x10)
	struct TArray<struct UMistCharacterCustomizationBodyDetail*> BodyDetails; // 0x388(0x10)
	struct TArray<struct UMistCharacterCustomizationHeadDetail*> HeadDetails; // 0x398(0x10)
};

// Class Mist.MistCharacterCustomizationActor
// Size: 0x410 (Inherited: 0x3c0)
struct AMistCharacterCustomizationActor : AActor {
	struct USkeletalMeshComponent* BodyMeshComponent; // 0x3c0(0x08)
	struct USkeletalMeshComponent* UpperClothingMeshComponent; // 0x3c8(0x08)
	struct USkeletalMeshComponent* LowerClothingMeshComponent; // 0x3d0(0x08)
	struct USkeletalMeshComponent* HeadMeshComponent; // 0x3d8(0x08)
	struct UStaticMeshComponent* HairMeshComponent; // 0x3e0(0x08)
	struct UStaticMeshComponent* FacialHairMeshComponent; // 0x3e8(0x08)
	struct FVector DefaultClothingPrimaryColor; // 0x3f0(0x0c)
	struct FVector DefaultClothingSecondaryColor; // 0x3fc(0x0c)
	struct UTexture2D* DefaultClothingMaskMaterial; // 0x408(0x08)

	void OnNearCameraChanged(bool IsActive); // Function Mist.MistCharacterCustomizationActor.OnNearCameraChanged // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x163f1c0
};

// Class Mist.MistCharacterCustomizationItemGridWidget
// Size: 0x340 (Inherited: 0x2c0)
struct UMistCharacterCustomizationItemGridWidget : UMistUIWidget {
	struct FMulticastInlineDelegate OnItemSelected; // 0x2c0(0x10)
	struct FMulticastInlineDelegate OnSliderValueChanged; // 0x2d0(0x10)
	struct UWrapBox* WrapBoxWidget; // 0x2e0(0x08)
	struct UTextBlock* CategoryNameWidget; // 0x2e8(0x08)
	struct UVerticalBox* SliderBoxWidget; // 0x2f0(0x08)
	struct FText HeaderText; // 0x2f8(0x18)
	struct TArray<struct UMistCharacterCustomizationItem*> CustomizationItems; // 0x310(0x10)
	struct UMistCharacterCustomizationItem* SelectedItem; // 0x320(0x08)
	struct UMistCharacterCustomizationItemWidget* SelectedWidget; // 0x328(0x08)
	char pad_330[0x10]; // 0x330(0x10)

	void SliderValueChangedEvent__DelegateSignature(struct UMistCharacterCustomizationItemGridWidget* Sender, enum class EMistCharacterCustomizationValue Index, float Value); // DelegateFunction Mist.MistCharacterCustomizationItemGridWidget.SliderValueChangedEvent__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x163f1c0
	void ItemSelectedEvent__DelegateSignature(struct UMistCharacterCustomizationItemGridWidget* Sender, struct UMistCharacterCustomizationItem* Item); // DelegateFunction Mist.MistCharacterCustomizationItemGridWidget.ItemSelectedEvent__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x163f1c0
	void HandleSliderValueChanged(struct UMistCharacterCustomizationSliderWidget* Sender, enum class EMistCharacterCustomizationValue Index, float Value); // Function Mist.MistCharacterCustomizationItemGridWidget.HandleSliderValueChanged // (Final|Native|Private) // @ game+0x10b6400
	struct UWidget* HandleNavToNextRow(enum class EUINavigation Nav); // Function Mist.MistCharacterCustomizationItemGridWidget.HandleNavToNextRow // (Final|Native|Public|BlueprintCallable) // @ game+0x10b61f0
	void HandleItemClicked(struct UMistCharacterCustomizationItemWidget* Sender); // Function Mist.MistCharacterCustomizationItemGridWidget.HandleItemClicked // (Final|Native|Private) // @ game+0x10b5ed0
};

// Class Mist.MistCharacterCustomizationItemWidget
// Size: 0x2f0 (Inherited: 0x2c0)
struct UMistCharacterCustomizationItemWidget : UMistUIWidget {
	char pad_2C0[0x10]; // 0x2c0(0x10)
	struct UBorder* SelectionBorderWidget; // 0x2d0(0x08)
	struct UImage* ImageWidget; // 0x2d8(0x08)
	struct UMistCharacterCustomizationItem* CustomizationItem; // 0x2e0(0x08)
	char pad_2E8[0x8]; // 0x2e8(0x08)
};

// Class Mist.MistCharacterCustomizationScreen
// Size: 0x3d8 (Inherited: 0x3c0)
struct UMistCharacterCustomizationScreen : UMistUIDialog {
	struct UMistCharacterCustomizationWidget* CustomizationWidget; // 0x3c0(0x08)
	struct UMistBaseButtonWidget* CancelButtonWidget; // 0x3c8(0x08)
	struct UMistBaseButtonWidget* SaveButtonWidget; // 0x3d0(0x08)
};

// Class Mist.MistCharacterCustomizationSliderWidget
// Size: 0x300 (Inherited: 0x2c0)
struct UMistCharacterCustomizationSliderWidget : UMistUIWidget {
	char pad_2C0[0x10]; // 0x2c0(0x10)
	struct UTextBlock* NameWidget; // 0x2d0(0x08)
	struct USlider* SliderWidget; // 0x2d8(0x08)
	char pad_2E0[0x20]; // 0x2e0(0x20)

	void ValueChangedEvent__DelegateSignature(struct UMistCharacterCustomizationSliderWidget* Sender, enum class EMistCharacterCustomizationValue Index, float Value); // DelegateFunction Mist.MistCharacterCustomizationSliderWidget.ValueChangedEvent__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x163f1c0
	void HandleSliderValueChanged(float InValue); // Function Mist.MistCharacterCustomizationSliderWidget.HandleSliderValueChanged // (Final|Native|Private) // @ game+0x10b6510
};

// Class Mist.MistCharacterCustomizationWidget
// Size: 0x4c8 (Inherited: 0x2c0)
struct UMistCharacterCustomizationWidget : UMistUIWidget {
	struct UMistCharacterCustomizationItemGridWidget* SetsGridWidget; // 0x2c0(0x08)
	struct UMistCharacterCustomizationItemGridWidget* HairGridWidget; // 0x2c8(0x08)
	struct UMistCharacterCustomizationItemGridWidget* FacialHairGridWidget; // 0x2d0(0x08)
	struct UMistCharacterCustomizationItemGridWidget* HairColorGridWidget; // 0x2d8(0x08)
	struct UMistCharacterCustomizationItemGridWidget* EyeColorGridWidget; // 0x2e0(0x08)
	struct UMistCharacterCustomizationItemGridWidget* ClothingColorGridWidget; // 0x2e8(0x08)
	struct UMistCharacterCustomizationItemGridWidget* BodyDetailGridWidget; // 0x2f0(0x08)
	struct UMistCharacterCustomizationItemGridWidget* HeadDetailGridWidget; // 0x2f8(0x08)
	struct UMistUICharacterCustomizationCategory* ShowSetsWidget; // 0x300(0x08)
	struct UMistUICharacterCustomizationCategory* ShowHairWidget; // 0x308(0x08)
	struct UMistUICharacterCustomizationCategory* ShowFacialHairWidget; // 0x310(0x08)
	struct UMistUICharacterCustomizationCategory* ShowHairColorWidget; // 0x318(0x08)
	struct UMistUICharacterCustomizationCategory* ShowEyeColorWidget; // 0x320(0x08)
	struct UMistUICharacterCustomizationCategory* ShowClothingColorWidget; // 0x328(0x08)
	struct UMistUICharacterCustomizationCategory* ShowBodyDetailWidget; // 0x330(0x08)
	struct UMistUICharacterCustomizationCategory* ShowHeadDetailWidget; // 0x338(0x08)
	struct UButton* RandomizeButtonWidget; // 0x340(0x08)
	struct FViewTargetTransitionParams CameraTransitionParams; // 0x348(0x10)
	float GamepadPanScale; // 0x358(0x04)
	char pad_35C[0x24]; // 0x35c(0x24)
	struct TMap<struct UMistUICharacterCustomizationCategory*, struct UMistCharacterCustomizationItemGridWidget*> CategoryButtonsMap; // 0x380(0x50)
	struct TMap<struct UMistUIButton*, struct FName> CategoryCameraTags; // 0x3d0(0x50)
	struct TArray<struct UMistCharacterCustomizationSet*> Sets; // 0x420(0x10)
	struct AActor* PreviewActor; // 0x430(0x08)
	struct TMap<struct FName, struct AActor*> ViewTargetsByTag; // 0x438(0x50)
	struct TArray<struct UMistUICharacterCustomizationCategory*> CustomizationCategoryList; // 0x488(0x10)
	char pad_498[0x18]; // 0x498(0x18)
	struct UMistCharacterCustomizationSet* SelectedSet; // 0x4b0(0x08)
	struct UMistCharacterCustomizationItemGridWidget* ActiveGridWidget; // 0x4b8(0x08)
	struct UMistUIButton* ActiveCategoryButton; // 0x4c0(0x08)

	void OnCategoryActivated(struct UMistCharacterCustomizationItemGridWidget* GridWidget); // Function Mist.MistCharacterCustomizationWidget.OnCategoryActivated // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void OnCameraChanged(); // Function Mist.MistCharacterCustomizationWidget.OnCameraChanged // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void MouseUpAction(); // Function Mist.MistCharacterCustomizationWidget.MouseUpAction // (Final|Native|Private) // @ game+0x10b6760
	void MouseDownAction(); // Function Mist.MistCharacterCustomizationWidget.MouseDownAction // (Final|Native|Private) // @ game+0x10b6740
	void HandleRandomizeClicked(); // Function Mist.MistCharacterCustomizationWidget.HandleRandomizeClicked // (Final|Native|Private) // @ game+0x10b63c0
	void HandlePanCameraAxis(float Value); // Function Mist.MistCharacterCustomizationWidget.HandlePanCameraAxis // (Final|Native|Private) // @ game+0x10b6280
	struct UWidget* HandleNavToGrid(enum class EUINavigation Nav); // Function Mist.MistCharacterCustomizationWidget.HandleNavToGrid // (Final|Native|Public|BlueprintCallable) // @ game+0x10b6160
	struct UWidget* HandleNavToCategories(enum class EUINavigation Nav); // Function Mist.MistCharacterCustomizationWidget.HandleNavToCategories // (Final|Native|Public|BlueprintCallable) // @ game+0x10b60d0
	void HandleCustomizationSliderValueChanged(struct UMistCharacterCustomizationItemGridWidget* Sender, enum class EMistCharacterCustomizationValue Index, float Value); // Function Mist.MistCharacterCustomizationWidget.HandleCustomizationSliderValueChanged // (Final|Native|Private) // @ game+0x10b5be0
	void HandleCustomizationItemSelected(struct UMistCharacterCustomizationItemGridWidget* Sender, struct UMistCharacterCustomizationItem* Item); // Function Mist.MistCharacterCustomizationWidget.HandleCustomizationItemSelected // (Final|Native|Private) // @ game+0x10b5b20
	void HandleCategoryVisibilityChanged(struct UMistUIButton* Sender); // Function Mist.MistCharacterCustomizationWidget.HandleCategoryVisibilityChanged // (Final|Native|Private) // @ game+0x10b5980
	void HandleCategoryHovered(struct UMistUIButton* Sender); // Function Mist.MistCharacterCustomizationWidget.HandleCategoryHovered // (Final|Native|Private) // @ game+0x10b5900
	void CustomizationCameraFartherAction(); // Function Mist.MistCharacterCustomizationWidget.CustomizationCameraFartherAction // (Final|Native|Private) // @ game+0x10b57e0
	void CustomizationCameraCloserAction(); // Function Mist.MistCharacterCustomizationWidget.CustomizationCameraCloserAction // (Final|Native|Private) // @ game+0x10b57c0
};

// Class Mist.MistCharacterExperienceWidget
// Size: 0x330 (Inherited: 0x2e0)
struct UMistCharacterExperienceWidget : UMistHUDWidget {
	struct UTextBlock* LevelTextWidget; // 0x2e0(0x08)
	struct UTextBlock* StatPtTextWidget; // 0x2e8(0x08)
	struct UTextBlock* TechPtTextWidget; // 0x2f0(0x08)
	struct UTextBlock* PerkPtTextWidget; // 0x2f8(0x08)
	struct UMistUICircularProgressBar* ExpProgressBar; // 0x300(0x08)
	struct UWidget* StatUnspentWidget; // 0x308(0x08)
	struct UWidget* TechUnspentWidget; // 0x310(0x08)
	struct UWidget* PerkUnspentWidget; // 0x318(0x08)
	float ReminderInterval; // 0x320(0x04)
	char pad_324[0xc]; // 0x324(0x0c)

	void ReceiveVisibilityChange(struct UWidget* Widget, enum class ESlateVisibility NewVisibility); // Function Mist.MistCharacterExperienceWidget.ReceiveVisibilityChange // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void ReceiveTechUnspentReminder(); // Function Mist.MistCharacterExperienceWidget.ReceiveTechUnspentReminder // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void ReceiveStatUnspentReminder(); // Function Mist.MistCharacterExperienceWidget.ReceiveStatUnspentReminder // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void ReceivePerkUnspentReminder(); // Function Mist.MistCharacterExperienceWidget.ReceivePerkUnspentReminder // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void HandleTechPtUpdated(struct AMistOasisPlayerState* Sender, int32_t NewValue); // Function Mist.MistCharacterExperienceWidget.HandleTechPtUpdated // (Final|Native|Private) // @ game+0x10b6650
	void HandleStatPtUpdated(struct AMistOasisPlayerState* Sender, int32_t NewValue); // Function Mist.MistCharacterExperienceWidget.HandleStatPtUpdated // (Final|Native|Private) // @ game+0x10b6590
	void HandleReminderTimer(); // Function Mist.MistCharacterExperienceWidget.HandleReminderTimer // (Final|Native|Private) // @ game+0x10b63e0
	void HandlePerkPtUpdated(struct AMistOasisPlayerState* Sender, int32_t NewValue); // Function Mist.MistCharacterExperienceWidget.HandlePerkPtUpdated // (Final|Native|Private) // @ game+0x10b6300
	void HandleLevelUpdated(struct AMistOasisPlayerState* Sender, int32_t NewValue); // Function Mist.MistCharacterExperienceWidget.HandleLevelUpdated // (Final|Native|Private) // @ game+0x10b5f50
	void HandleExpUpdated(struct AMistOasisPlayerState* Sender, uint64_t NewValue); // Function Mist.MistCharacterExperienceWidget.HandleExpUpdated // (Final|Native|Private) // @ game+0x10b5cf0
};

// Class Mist.MistCharacterFXManagerComponent
// Size: 0x310 (Inherited: 0xf0)
struct UMistCharacterFXManagerComponent : UActorComponent {
	struct FMistComponentReference MistSkeletalMeshRef; // 0xf0(0x28)
	struct TArray<struct FMistCharacterVFXSystem> FXSystemTemplates; // 0x118(0x10)
	struct FMistCharacterVFXSystem DefaultFXSystemTemplate; // 0x128(0x90)
	struct TMap<struct FName, struct FName> NotifyNameToBoneNameMap; // 0x1b8(0x50)
	char pad_208[0x58]; // 0x208(0x58)
	struct TMap<struct FName, struct UFXSystemComponent*> BoneToParticleSystemMap; // 0x260(0x50)
	struct TMap<struct FName, struct UFXSystemComponent*> BoneToDirectionChangeParticleSystemMap; // 0x2b0(0x50)
	char pad_300[0x10]; // 0x300(0x10)
};

// Class Mist.MistCharacterGridComponent
// Size: 0x128 (Inherited: 0xf0)
struct UMistCharacterGridComponent : UActorComponent {
	char pad_F0[0x38]; // 0xf0(0x38)
};

// Class Mist.MistHealthComponent
// Size: 0x138 (Inherited: 0xf0)
struct UMistHealthComponent : UActorComponent {
	char pad_F0[0x20]; // 0xf0(0x20)
	float MaxHealth; // 0x110(0x04)
	float Health; // 0x114(0x04)
	struct UMistDamageOverrideTable* DamageOverride; // 0x118(0x08)
	struct FMulticastInlineDelegate OnHealthChanged; // 0x120(0x10)
	char pad_130[0x8]; // 0x130(0x08)

	void OnRep_Health(float PrevHealth); // Function Mist.MistHealthComponent.OnRep_Health // (Native|Protected) // @ game+0x110cff0
	void MulticastSetHealth(int32_t InHealth, float InMaxHealth); // Function Mist.MistHealthComponent.MulticastSetHealth // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x110c910
	void HealthChangedEvent__DelegateSignature(struct UMistHealthComponent* Sender, float PrevHealth, float NewHealth); // DelegateFunction Mist.MistHealthComponent.HealthChangedEvent__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x163f1c0
	void HandleAnyDamage(struct AActor* DamagedActor, float Damage, struct UDamageType* DamageType, struct FDamageSource& DamageSource); // Function Mist.MistHealthComponent.HandleAnyDamage // (Native|Protected|HasOutParms) // @ game+0x110bcf0
};

// Class Mist.MistCharacterHealthComponent
// Size: 0x150 (Inherited: 0x138)
struct UMistCharacterHealthComponent : UMistHealthComponent {
	float HealingPerSecond; // 0x138(0x04)
	float HealingDelay; // 0x13c(0x04)
	struct AMistPlayer* PlayerOwner; // 0x140(0x08)
	char pad_148[0x8]; // 0x148(0x08)

	void HandleHealTimer(); // Function Mist.MistCharacterHealthComponent.HandleHealTimer // (Final|Native|Private) // @ game+0x10b5db0
};

// Class Mist.MistCharacterHealthWidget
// Size: 0x338 (Inherited: 0x2e0)
struct UMistCharacterHealthWidget : UMistHUDWidget {
	struct UMistUICircularProgressBar* HealthBarWidget; // 0x2e0(0x08)
	struct UMistUICircularProgressBar* HealingBarWidget; // 0x2e8(0x08)
	struct UMistUICircularProgressBar* DamageBarWidget; // 0x2f0(0x08)
	struct UTexture2D* HealthTexture; // 0x2f8(0x08)
	struct UTexture2D* HealingTexture; // 0x300(0x08)
	float DamageBarShowTime; // 0x308(0x04)
	float DamageBarShrinkingTime; // 0x30c(0x04)
	struct UTextBlock* CurrentHealthWidget; // 0x310(0x08)
	struct UTextBlock* MaxHealthWidget; // 0x318(0x08)
	char pad_320[0x18]; // 0x320(0x18)

	void HandleHealthChanged(struct UMistHealthComponent* HealthComponent, float PrevHealth, float NewHealth); // Function Mist.MistCharacterHealthWidget.HandleHealthChanged // (Final|Native|Private) // @ game+0x10b5dd0
	void HandleActiveStatusEffectUpdated(struct UMistStatusEffectPlayerComponent* InSender, struct FMistActiveStatusEffect& EffectInstance); // Function Mist.MistCharacterHealthWidget.HandleActiveStatusEffectUpdated // (Final|Native|Private|HasOutParms) // @ game+0x10b5800
};

// Class Mist.MistCharacterLevelUpWidget
// Size: 0x320 (Inherited: 0x2e0)
struct UMistCharacterLevelUpWidget : UMistHUDWidget {
	struct UTextBlock* LevelTextWidget; // 0x2e0(0x08)
	struct UTextBlock* StatPtTextWidget; // 0x2e8(0x08)
	struct UBorder* StatPtBorderWidget; // 0x2f0(0x08)
	struct UTextBlock* TechPtTextWidget; // 0x2f8(0x08)
	struct UBorder* TechPtBorderWidget; // 0x300(0x08)
	struct UTextBlock* PerkPtTextWidget; // 0x308(0x08)
	struct UBorder* PerkPtBorderWidget; // 0x310(0x08)
	int32_t LevelPopupLifetime; // 0x318(0x04)
	char pad_31C[0x4]; // 0x31c(0x04)

	void ReceiveVisibilityChange(struct UWidget* Widget, enum class ESlateVisibility NewVisibility); // Function Mist.MistCharacterLevelUpWidget.ReceiveVisibilityChange // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void HandleLevelUpdated(struct AMistOasisPlayerState* Sender, int32_t NewValue); // Function Mist.MistCharacterLevelUpWidget.HandleLevelUpdated // (Final|Native|Private) // @ game+0x10b6010
};

// Class Mist.MistCharacterLevelWidget
// Size: 0x2c8 (Inherited: 0x2c0)
struct UMistCharacterLevelWidget : UMistUIWidget {
	struct UTextBlock* LevelWidget; // 0x2c0(0x08)
};

// Class Mist.MistCharacterMannequin
// Size: 0x5b0 (Inherited: 0x410)
struct AMistCharacterMannequin : AMistCharacterCustomizationActor {
	struct UBoxComponent* CustomBoundsComponent; // 0x410(0x08)
	struct UMeshComponent* SlotMeshes[0xc]; // 0x418(0x60)
	struct FMistEquipmentItem SlotItems[0xc]; // 0x478(0x120)
	char pad_598[0x18]; // 0x598(0x18)
};

// Class Mist.MistCharacterMovementBudgeterComponent
// Size: 0x120 (Inherited: 0x108)
struct UMistCharacterMovementBudgeterComponent : UMistPlayerControllerComponent {
	int32_t NumGuaranteedTickedComponents; // 0x108(0x04)
	float FrameBudgetTime; // 0x10c(0x04)
	char pad_110[0x10]; // 0x110(0x10)
};

// Class Mist.MistCharacterMovementComponent
// Size: 0xc70 (Inherited: 0x680)
struct UMistCharacterMovementComponent : UCharacterMovementComponent {
	char pad_680[0x3c]; // 0x680(0x3c)
	float LimitVelocityBonusFromAnimation; // 0x6bc(0x04)
	struct UCurveFloat* AngleBasedMaxSpeedMultiplier; // 0x6c0(0x08)
	struct UCurveFloat* WeightBasedMaxSpeedMultiplier; // 0x6c8(0x08)
	struct FStaminaMovementValues StaminaValues; // 0x6d0(0x90)
	float DefaultRotationRate; // 0x760(0x04)
	float GrapplingRotationRate; // 0x764(0x04)
	bool bShowDebugInfo; // 0x768(0x01)
	bool bFullLogAutonomousProxy; // 0x769(0x01)
	char pad_76A[0x6]; // 0x76a(0x06)
	float LedgeTopMargin; // 0x770(0x04)
	float ClimbingCancelWindowStart; // 0x774(0x04)
	float ClimbingCancelWindowEnd; // 0x778(0x04)
	float ClimbingCooldownAfterStarted; // 0x77c(0x04)
	float ClimbingCooldownAfterCanceled; // 0x780(0x04)
	float ClimbingCooldownAfterJump; // 0x784(0x04)
	float StartClimbingWallDistance; // 0x788(0x04)
	char pad_78C[0x4]; // 0x78c(0x04)
	struct TArray<struct FTransform> ClimbingSweepOffsets; // 0x790(0x10)
	int32_t RegularClimbRetriesNum; // 0x7a0(0x04)
	int32_t TetheredClimbRetriesNum; // 0x7a4(0x04)
	float ClimbingSweepDistance; // 0x7a8(0x04)
	float ClimbingFootRadius; // 0x7ac(0x04)
	float RegrappleVelocityFactor; // 0x7b0(0x04)
	float RegrappleReachFactor; // 0x7b4(0x04)
	float RegrappleMaxReach; // 0x7b8(0x04)
	char pad_7BC[0x4]; // 0x7bc(0x04)
	struct TMap<enum class ECombatAction, float> CombatRotationRates; // 0x7c0(0x50)
	char pad_810[0x10]; // 0x810(0x10)
	float PushToSwingArcMaxSize; // 0x820(0x04)
	float AccelerationFactor; // 0x824(0x04)
	float GrapplingDragCoefficient; // 0x828(0x04)
	float GrapplingFrictionCoefficient; // 0x82c(0x04)
	struct FMistGrapplingStateParams GrapplingState; // 0x830(0x1a0)
	char pad_9D0[0x10]; // 0x9d0(0x10)
	struct UCurveFloat* AccelerationBySpeedCurve; // 0x9e0(0x08)
	bool bSwitchOffSeparateFrictionWhileJumping; // 0x9e8(0x01)
	char pad_9E9[0x3]; // 0x9e9(0x03)
	float MaxDepenetrationEscalate; // 0x9ec(0x04)
	float MaxDepenetrationEscalateAsProxy; // 0x9f0(0x04)
	char pad_9F4[0x4]; // 0x9f4(0x04)
	struct UMistPlayerStaminaComponent* CachedStaminaComponent; // 0x9f8(0x08)
	struct UMistMeleeCombatComponent* CachedCombatComponent; // 0xa00(0x08)
	struct UMistTetherMasterComponent* TetherComponent; // 0xa08(0x08)
	struct FTransform LocalClimbingLedgeTransform; // 0xa10(0x30)
	char pad_A40[0x124]; // 0xa40(0x124)
	float CollisionEscapeForceInAirFactor; // 0xb64(0x04)
	struct AActor* EscapeActor; // 0xb68(0x08)
	char pad_B70[0x98]; // 0xb70(0x98)
	struct UCurveFloat* TickRateByDistanceFactorCurve; // 0xc08(0x08)
	float MaxVariableDeltaTime; // 0xc10(0x04)
	char pad_C14[0x5c]; // 0xc14(0x5c)

	void ServerStopClimbing(); // Function Mist.MistCharacterMovementComponent.ServerStopClimbing // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10b7360
	void ServerStartDodge(struct FMistDisplacementTrackParams InParams); // Function Mist.MistCharacterMovementComponent.ServerStartDodge // (Net|Native|Event|Public|NetServer) // @ game+0x10b72a0
	void ServerStartClimbing(struct FTransform ClimbStartTransform, struct FTransform ClimbPointTransform, struct UPrimitiveComponent* Component, int32_t ItemIndex, struct FName BoneName, struct UAnimationAsset* ClimbingAnim, float AnimPosition, enum class ECMM_EventTag ClimbType, bool bRepToAutonomous); // Function Mist.MistCharacterMovementComponent.ServerStartClimbing // (Net|NetReliableNative|Event|Public|NetServer|HasDefaults) // @ game+0x10b6fa0
	void ServerForceServerSideMovement(); // Function Mist.MistCharacterMovementComponent.ServerForceServerSideMovement // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x10b6f80
	void ServerFinishDisplacement(); // Function Mist.MistCharacterMovementComponent.ServerFinishDisplacement // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10b6f60
	void ServerFinishClimbing(); // Function Mist.MistCharacterMovementComponent.ServerFinishClimbing // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10b6f40
	void OnEquipmentSlotUpdate(struct UMistEquipmentComponent* Sender, enum class EEquipmentSlot Slot); // Function Mist.MistCharacterMovementComponent.OnEquipmentSlotUpdate // (Final|Native|Protected) // @ game+0x10b6e80
	void OnCombatActionChanged(enum class ECombatAction CurrentAction, enum class ECombatAction PreviousAction); // Function Mist.MistCharacterMovementComponent.OnCombatActionChanged // (Final|Native|Protected) // @ game+0x10b6dc0
	void MulticastStartDodge(struct FMistDisplacementTrackParams InParams); // Function Mist.MistCharacterMovementComponent.MulticastStartDodge // (Net|Native|Event|NetMulticast|Public) // @ game+0x10b6d00
	void MulticastStartDisplacement(struct FMistDisplacementTrackParams InParams); // Function Mist.MistCharacterMovementComponent.MulticastStartDisplacement // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x10b6c40
	void MulticastStartClimbing(struct FTransform ClimbStartTransform, struct FTransform ClimbPointTransform, struct UPrimitiveComponent* NewBase, int32_t ItemIndex, struct FName BoneName, struct FMistRootMotionCorrectionData CorrectionData, bool bTeleport, bool bRepToAutonomous); // Function Mist.MistCharacterMovementComponent.MulticastStartClimbing // (Net|NetReliableNative|Event|NetMulticast|Public|HasDefaults) // @ game+0x10b6940
	void MulticastReverseClimbing(); // Function Mist.MistCharacterMovementComponent.MulticastReverseClimbing // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x10b6920
	void MulticastPlayClimbing(struct UAnimationAsset* ClimbingAnim, float AnimPosition, enum class EClimbingState ClimbType, bool bRepToAutonomous); // Function Mist.MistCharacterMovementComponent.MulticastPlayClimbing // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x10b67e0
	void MulticastFinishDisplacement(); // Function Mist.MistCharacterMovementComponent.MulticastFinishDisplacement // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x10b67c0
	void MulticastFinishClimbing(); // Function Mist.MistCharacterMovementComponent.MulticastFinishClimbing // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x10b67a0
	void MulticastCancelClimbing(); // Function Mist.MistCharacterMovementComponent.MulticastCancelClimbing // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x10b6780
	bool IsClimbing(); // Function Mist.MistCharacterMovementComponent.IsClimbing // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x10b6710
	void HandleClimbedStructurePartInstanceRemoved(struct FTransform& Transform, int32_t ItemIndex); // Function Mist.MistCharacterMovementComponent.HandleClimbedStructurePartInstanceRemoved // (Final|Native|Private|HasOutParms|HasDefaults) // @ game+0x10b5a00
	void ClientCancelClimbing(); // Function Mist.MistCharacterMovementComponent.ClientCancelClimbing // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x10b57a0
};

// Class Mist.MistCharacterStateWidget
// Size: 0x2f0 (Inherited: 0x2e0)
struct UMistCharacterStateWidget : UMistHUDWidget {
	struct UTextBlock* ThirstPenalty; // 0x2e0(0x08)
	struct FTimerHandle ThirstPenaltyTimerHandle; // 0x2e8(0x08)

	void ReceiveStaminaUsageStarted(); // Function Mist.MistCharacterStateWidget.ReceiveStaminaUsageStarted // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void ReceiveStaminaUsageEnded(); // Function Mist.MistCharacterStateWidget.ReceiveStaminaUsageEnded // (Event|Public|BlueprintEvent) // @ game+0x163f1c0
	void HandleThirstPenaltyTimerUpdate(); // Function Mist.MistCharacterStateWidget.HandleThirstPenaltyTimerUpdate // (Final|Native|Protected) // @ game+0x10c0e10
	void HandleStaminaUsageStarted(); // Function Mist.MistCharacterStateWidget.HandleStaminaUsageStarted // (Final|Native|Protected) // @ game+0x10c0df0
	void HandleStaminaUsageEnded(); // Function Mist.MistCharacterStateWidget.HandleStaminaUsageEnded // (Final|Native|Protected) // @ game+0x10c0dd0
};

// Class Mist.MistChatMessageLogContentWidget
// Size: 0x2d8 (Inherited: 0x2c0)
struct UMistChatMessageLogContentWidget : UMistMessageLogContentWidget {
	struct URichTextBlock* SenderTextWidget; // 0x2c0(0x08)
	struct UTextBlock* MessageTextWidget; // 0x2c8(0x08)
	struct UMistChatMessageData* Data; // 0x2d0(0x08)
};

// Class Mist.MistMapChatMessageLogContentWidget
// Size: 0x2d8 (Inherited: 0x2d8)
struct UMistMapChatMessageLogContentWidget : UMistChatMessageLogContentWidget {
};

// Class Mist.MistClanChatMessageLogContentWidget
// Size: 0x2d8 (Inherited: 0x2d8)
struct UMistClanChatMessageLogContentWidget : UMistChatMessageLogContentWidget {
};

// Class Mist.MistMessageLogMenuWidget
// Size: 0x2c8 (Inherited: 0x2c0)
struct UMistMessageLogMenuWidget : UMistUIWidget {
	struct UMistMessageLogItemWidget* Owner; // 0x2c0(0x08)
};

// Class Mist.MistChatMessageLogMenuWidget
// Size: 0x2f8 (Inherited: 0x2c8)
struct UMistChatMessageLogMenuWidget : UMistMessageLogMenuWidget {
	struct UTextBlock* ActionNameWidget; // 0x2c8(0x08)
	struct UTextBlock* SenderNameWidget; // 0x2d0(0x08)
	struct UButton* ConfirmButtonWidget; // 0x2d8(0x08)
	struct UButton* CancelButtonWidget; // 0x2e0(0x08)
	struct UMistChatMessageData* Data; // 0x2e8(0x08)
	char pad_2F0[0x8]; // 0x2f0(0x08)

	void HandleConfirmClicked(); // Function Mist.MistChatMessageLogMenuWidget.HandleConfirmClicked // (Final|Native|Private) // @ game+0x10c0db0
	void HandleCancelClicked(); // Function Mist.MistChatMessageLogMenuWidget.HandleCancelClicked // (Final|Native|Private) // @ game+0x10c0d90
};

// Class Mist.MistCheatingComponent
// Size: 0x358 (Inherited: 0xf0)
struct UMistCheatingComponent : UActorComponent {
	struct TSoftClassPtr<UObject> TensionDamageType; // 0xf0(0x28)
	struct FMistAdminData AdminData; // 0x118(0xa0)
	char pad_1B8[0x38]; // 0x1b8(0x38)
	struct TSoftClassPtr<UObject> MonkeyToSpawn; // 0x1f0(0x28)
	struct TSoftClassPtr<UObject> MonkeyAIController; // 0x218(0x28)
	struct TSoftClassPtr<UObject> CombatBotToSpawn; // 0x240(0x28)
	struct TSoftClassPtr<UObject> CombatBotAIController; // 0x268(0x28)
	struct TSoftClassPtr<UObject> WalkerToSpawn; // 0x290(0x28)
	struct TSoftClassPtr<UObject> SandstormFogToSpawn; // 0x2b8(0x28)
	struct TSoftClassPtr<UObject> FightClubWeaponRack; // 0x2e0(0x28)
	struct AMistPlayer* OriginalPlayer; // 0x308(0x08)
	struct UMistOffMapLobby2Screen* OffMapLobby2Screen; // 0x310(0x08)
	struct UMistTradeStationScreen* TradeStationScreen; // 0x318(0x08)
	struct UMistJoinQueueScreen* JoinQueueScreen; // 0x320(0x08)
	struct UMistJoinRealmSearchScreen* JoinRealmSearchScreen; // 0x328(0x08)
	struct UMistJoinRealmScreen* JoinRealmScreen; // 0x330(0x08)
	struct UMistCreateCharacterScreen* CreateCharacterScreen; // 0x338(0x08)
	struct UMistInputDebugWidget* InputMappingsDebugWidget; // 0x340(0x08)
	struct UMistInputHistoryDebugWidget* InputHistoryDebugWidget; // 0x348(0x08)
	struct UMistInputFocusDebugWidget* InputFocusDebugWidget; // 0x350(0x08)

	void UseServerSideMovement(float Duration); // Function Mist.MistCheatingComponent.UseServerSideMovement // (Final|Exec|Native|Public) // @ game+0x10c7f60
	void UseIcVoucherShopItem(struct FName ShopItemId, int32_t Amount); // Function Mist.MistCheatingComponent.UseIcVoucherShopItem // (Final|Exec|Native|Public) // @ game+0x10c0bf0
	void UpgradeWalkerStage(); // Function Mist.MistCheatingComponent.UpgradeWalkerStage // (Final|Exec|Native|Public) // @ game+0x10c7f40
	void UnpauseWeather(); // Function Mist.MistCheatingComponent.UnpauseWeather // (Final|Exec|Native|Public) // @ game+0x10c7f20
	void UnlockTechTree(); // Function Mist.MistCheatingComponent.UnlockTechTree // (Final|Exec|Native|Public) // @ game+0x10c7f00
	void UnlockTech(struct FString TechName); // Function Mist.MistCheatingComponent.UnlockTech // (Final|Exec|Native|Public) // @ game+0x10c7e60
	void UnlockPerks(); // Function Mist.MistCheatingComponent.UnlockPerks // (Final|Exec|Native|Public) // @ game+0x10c7e40
	void UnlockAchievement(struct FString AchievementName); // Function Mist.MistCheatingComponent.UnlockAchievement // (Final|Exec|Native|Public) // @ game+0x10c7da0
	void ToggleStatusEffectsDebug(); // Function Mist.MistCheatingComponent.ToggleStatusEffectsDebug // (Final|Exec|Native|Public) // @ game+0x10c7d80
	void TogglePlayerNames(); // Function Mist.MistCheatingComponent.TogglePlayerNames // (Final|Exec|Native|Public) // @ game+0x10c7d60
	void ToggleInvincibility(); // Function Mist.MistCheatingComponent.ToggleInvincibility // (Final|Exec|Native|Public) // @ game+0x10c7d40
	void ToggleIdle(); // Function Mist.MistCheatingComponent.ToggleIdle // (Final|Exec|Native|Public) // @ game+0x10c7d20
	void ToggleGUI(); // Function Mist.MistCheatingComponent.ToggleGUI // (Final|Exec|Native|Public) // @ game+0x10c7d00
	void ToggleClimbingDebug(); // Function Mist.MistCheatingComponent.ToggleClimbingDebug // (Final|Exec|Native|Public) // @ game+0x10bfca0
	void ToggleCheatingOverlay(); // Function Mist.MistCheatingComponent.ToggleCheatingOverlay // (Final|Exec|Native|Public) // @ game+0x10c7ce0
	void ToggleChatLogSpam(); // Function Mist.MistCheatingComponent.ToggleChatLogSpam // (Final|Exec|Native|Public) // @ game+0x10c7cc0
	void TestVivox(); // Function Mist.MistCheatingComponent.TestVivox // (Final|Exec|Native|Public) // @ game+0x10c7ca0
	void TeleportWalkerTo(float X, float Y); // Function Mist.MistCheatingComponent.TeleportWalkerTo // (Final|Exec|Native|Public) // @ game+0x10c7be0
	void TeleportToPlayer(struct FString PlayerName); // Function Mist.MistCheatingComponent.TeleportToPlayer // (Final|Exec|Native|Public) // @ game+0x10c7b40
	void TeleportTo3D(float X, float Y, float Z); // Function Mist.MistCheatingComponent.TeleportTo3D // (Final|Exec|Native|Public) // @ game+0x10c7970
	void TeleportTo(float X, float Y); // Function Mist.MistCheatingComponent.TeleportTo // (Final|Exec|Native|Public) // @ game+0x10c7a80
	void TeleportPlayerToMe(struct FString PlayerName); // Function Mist.MistCheatingComponent.TeleportPlayerToMe // (Final|Exec|Native|Public) // @ game+0x10c78d0
	void TeleportEveryoneToMe(); // Function Mist.MistCheatingComponent.TeleportEveryoneToMe // (Final|Exec|Native|Public) // @ game+0x10c78b0
	void Teleport(float Distance); // Function Mist.MistCheatingComponent.Teleport // (Final|Exec|Native|Public) // @ game+0x10c7830
	void TakeItems(struct FString Name, int32_t Count, bool bBestEffort); // Function Mist.MistCheatingComponent.TakeItems // (Final|Exec|Native|Public) // @ game+0x10c7710
	void StripWorm(); // Function Mist.MistCheatingComponent.StripWorm // (Final|Exec|Native|Public) // @ game+0x10c76f0
	void StopWorm(bool Value); // Function Mist.MistCheatingComponent.StopWorm // (Final|Exec|Native|Public) // @ game+0x10c7660
	void StopSpectating(); // Function Mist.MistCheatingComponent.StopSpectating // (Final|Exec|Native|Public) // @ game+0x10c7640
	void StartSpectating(bool bShowAllNametags); // Function Mist.MistCheatingComponent.StartSpectating // (Final|Exec|Native|Public) // @ game+0x10c75b0
	void StartCineTimer(float Time, struct FString Message); // Function Mist.MistCheatingComponent.StartCineTimer // (Final|Exec|Native|Public) // @ game+0x10c74d0
	void SpeedUpClaims(bool bEnable); // Function Mist.MistCheatingComponent.SpeedUpClaims // (Final|Exec|Native|Public) // @ game+0x10c7440
	void SpectatePlayer(struct FString PlayerName); // Function Mist.MistCheatingComponent.SpectatePlayer // (Final|Exec|Native|Public) // @ game+0x10c7360
	void SpawnWorm(float Distance); // Function Mist.MistCheatingComponent.SpawnWorm // (Final|Exec|Native|Public) // @ game+0x10c72e0
	void SpawnWalkerQuality(struct FString walkerName, int32_t WalkerQuality); // Function Mist.MistCheatingComponent.SpawnWalkerQuality // (Final|Exec|Native|Public) // @ game+0x10c7200
	void SpawnWalker(struct FString walkerName); // Function Mist.MistCheatingComponent.SpawnWalker // (Final|Exec|Native|Public) // @ game+0x10c7160
	void SpawnSandstorm(); // Function Mist.MistCheatingComponent.SpawnSandstorm // (Final|Exec|Native|Public) // @ game+0x10c7140
	void SpawnProtectWalker(); // Function Mist.MistCheatingComponent.SpawnProtectWalker // (Final|Exec|Native|Public) // @ game+0x10c7120
	void SpawnPoi(); // Function Mist.MistCheatingComponent.SpawnPoi // (Final|Exec|Native|Public) // @ game+0x10c7100
	void SpawnMultipleMobs(struct FString MobName, float Distance, int32_t Amount); // Function Mist.MistCheatingComponent.SpawnMultipleMobs // (Final|Exec|Native|Public) // @ game+0x10c6fe0
	void SpawnMonkey(float Distance, int32_t Amount); // Function Mist.MistCheatingComponent.SpawnMonkey // (Final|Exec|Native|Public) // @ game+0x10c6f10
	void SpawnMobInDistance(struct FString MobName, float Distance); // Function Mist.MistCheatingComponent.SpawnMobInDistance // (Final|Exec|Native|Public) // @ game+0x10c6e30
	void SpawnMob(struct FString MobName); // Function Mist.MistCheatingComponent.SpawnMob // (Final|Exec|Native|Public) // @ game+0x10c6d90
	void SpawnFightClubWeaponRack(struct FString ItemSetName, bool bUseOncePerRespawn); // Function Mist.MistCheatingComponent.SpawnFightClubWeaponRack // (Final|Exec|Native|Public) // @ game+0x10c6cb0
	void SpawnEventAsteroid(); // Function Mist.MistCheatingComponent.SpawnEventAsteroid // (Final|Exec|Native|Public) // @ game+0x10c6c90
	void SpawnCreature(struct FString Name, float Distance); // Function Mist.MistCheatingComponent.SpawnCreature // (Final|Exec|Native|Public) // @ game+0x10c6bb0
	void SpawnCombatBot(float Distance, int32_t CombatAction, float HeavyAttackPower); // Function Mist.MistCheatingComponent.SpawnCombatBot // (Final|Exec|Native|Public) // @ game+0x10c6aa0
	void SpawnActor(struct FString ActorName, float Distance); // Function Mist.MistCheatingComponent.SpawnActor // (Final|Exec|Native|Public) // @ game+0x10c69c0
	void SpamMessageLog(int32_t Num); // Function Mist.MistCheatingComponent.SpamMessageLog // (Final|Exec|Native|Public) // @ game+0x10c6940
	void SlomoEx(float NewTimeDilation, bool bServer, bool bClient); // Function Mist.MistCheatingComponent.SlomoEx // (Final|Exec|Native|Public) // @ game+0x10c6830
	void Slomo(float NewTimeDilation); // Function Mist.MistCheatingComponent.Slomo // (Final|Exec|Native|Public) // @ game+0x10c67b0
	void SimulateTravelWalker(); // Function Mist.MistCheatingComponent.SimulateTravelWalker // (Final|Exec|Native|Public) // @ game+0x10c6790
	void SimulateRedeployPenalty(); // Function Mist.MistCheatingComponent.SimulateRedeployPenalty // (Final|Exec|Native|Public) // @ game+0x10c6770
	void SimulateAsteroidImpact(float Distance); // Function Mist.MistCheatingComponent.SimulateAsteroidImpact // (Final|Exec|Native|Public) // @ game+0x10c66f0
	void SignOutFirstPlayer(); // Function Mist.MistCheatingComponent.SignOutFirstPlayer // (Final|Exec|Native|Public) // @ game+0x10c66d0
	void ShowInputMappings(struct FString KeyFilter); // Function Mist.MistCheatingComponent.ShowInputMappings // (Final|Exec|Native|Public) // @ game+0x10c6630
	void ShowInputHistory(struct FString KeyFilter); // Function Mist.MistCheatingComponent.ShowInputHistory // (Final|Exec|Native|Public) // @ game+0x10c6590
	void ShowInputFocus(bool bValue); // Function Mist.MistCheatingComponent.ShowInputFocus // (Final|Exec|Native|Public) // @ game+0x10c6500
	void SetWeather(int32_t Index); // Function Mist.MistCheatingComponent.SetWeather // (Final|Exec|Native|Public) // @ game+0x10c6480
	void SetWalkerStage(int32_t NewStage); // Function Mist.MistCheatingComponent.SetWalkerStage // (Final|Exec|Native|Public) // @ game+0x10c6400
	void SetWalkerSandiness(float Sandiness); // Function Mist.MistCheatingComponent.SetWalkerSandiness // (Final|Exec|Native|Public) // @ game+0x10c6380
	void SetWalkerKinematic(bool bValue); // Function Mist.MistCheatingComponent.SetWalkerKinematic // (Final|Exec|Native|Public) // @ game+0x10c62f0
	void SetWalkerCraftingSkill(struct FString WalkerType, int32_t Level); // Function Mist.MistCheatingComponent.SetWalkerCraftingSkill // (Final|Exec|Native|Public) // @ game+0x10c6210
	void SetSlotReservations(int32_t TotalSlots, int64_t Clan1Id, int32_t Clan1Slots, int64_t Clan2Id, int32_t Clan2Slots); // Function Mist.MistCheatingComponent.SetSlotReservations // (Final|Exec|Native|Public) // @ game+0x10c6090
	void SetServerTime(float Time); // Function Mist.MistCheatingComponent.SetServerTime // (Final|Exec|Native|Public) // @ game+0x10c6010
	void SetRealmTileDecay(float DecayInSeconds); // Function Mist.MistCheatingComponent.SetRealmTileDecay // (Final|Exec|Native|Public) // @ game+0x10c5f90
	void SetRealmStatus(float ShutdownTimeSeconds, struct FString Status); // Function Mist.MistCheatingComponent.SetRealmStatus // (Final|Exec|Native|Public) // @ game+0x10c5eb0
	void SetPresentationMode(bool bInIsEnabled); // Function Mist.MistCheatingComponent.SetPresentationMode // (Final|Exec|Native|Public) // @ game+0x10c5e20
	void SetPlayerTier(enum class EMistAccountTier InTier); // Function Mist.MistCheatingComponent.SetPlayerTier // (Final|Exec|Native|Public) // @ game+0x10c5da0
	void SetPlayerStat(int32_t Amount, struct FString StatName); // Function Mist.MistCheatingComponent.SetPlayerStat // (Final|Exec|Native|Public) // @ game+0x10c5cc0
	void SetPlayerIds(int32_t CharacterId, int32_t ClanId); // Function Mist.MistCheatingComponent.SetPlayerIds // (Final|Exec|Native|Public) // @ game+0x10c5c00
	void SetPingInterval(int32_t Interval); // Function Mist.MistCheatingComponent.SetPingInterval // (Final|Exec|Native|Public) // @ game+0x10c5b80
	void SetMultipliers(float Experience, float HarvestQuantity); // Function Mist.MistCheatingComponent.SetMultipliers // (Final|Exec|Native|Public) // @ game+0x10c5ac0
	void SetMaxServerFps(float InFpsCap); // Function Mist.MistCheatingComponent.SetMaxServerFps // (Final|Exec|Native|Public) // @ game+0x10c5a40
	void SetMaxHealth(float Health, float MaxHealth); // Function Mist.MistCheatingComponent.SetMaxHealth // (Final|Exec|Native|Public) // @ game+0x10c5980
	void SetLookatOwnership(int64_t ClanId); // Function Mist.MistCheatingComponent.SetLookatOwnership // (Final|Exec|Native|Public) // @ game+0x10c5900
	void SetHealth(float Health); // Function Mist.MistCheatingComponent.SetHealth // (Final|Exec|Native|Public) // @ game+0x10c5880
	void SetClanRankVeteran(); // Function Mist.MistCheatingComponent.SetClanRankVeteran // (Final|Exec|Native|Public) // @ game+0x10c5860
	void SetClanRankOfficer(); // Function Mist.MistCheatingComponent.SetClanRankOfficer // (Final|Exec|Native|Public) // @ game+0x10c5840
	void SetClanRankMember(); // Function Mist.MistCheatingComponent.SetClanRankMember // (Final|Exec|Native|Public) // @ game+0x10c5820
	void SetClanRankLeader(); // Function Mist.MistCheatingComponent.SetClanRankLeader // (Final|Exec|Native|Public) // @ game+0x10c5800
	void SetClanPermission(int32_t Permission, bool bValue); // Function Mist.MistCheatingComponent.SetClanPermission // (Final|Exec|Native|Public) // @ game+0x10c5740
	void SetClaim(int64_t CharacterId, int64_t ClanId); // Function Mist.MistCheatingComponent.SetClaim // (Final|Exec|Native|Public) // @ game+0x10c5680
	void SetActorHealth(float Value); // Function Mist.MistCheatingComponent.SetActorHealth // (Final|Exec|Native|Public) // @ game+0x10c5600
	void SetAchievementStat(struct FString AchievementStatName, int32_t Value); // Function Mist.MistCheatingComponent.SetAchievementStat // (Final|Exec|Native|Public) // @ game+0x10c5520
	void ServerUseServerSideMovement(float Duration); // Function Mist.MistCheatingComponent.ServerUseServerSideMovement // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c5410
	void ServerUseItem(struct UMistItemTemplate* Item); // Function Mist.MistCheatingComponent.ServerUseItem // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c5380
	void ServerUpgradeWalkerStage(); // Function Mist.MistCheatingComponent.ServerUpgradeWalkerStage // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c5360
	void ServerUnlockTechTree(); // Function Mist.MistCheatingComponent.ServerUnlockTechTree // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c5340
	void ServerUnlockTech(struct UMistUnlockableTreeItem* TechTreeItem); // Function Mist.MistCheatingComponent.ServerUnlockTech // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c52b0
	void ServerUnlockPerks(); // Function Mist.MistCheatingComponent.ServerUnlockPerks // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c5290
	void ServerToggleStatusEffectsDebug(struct AMistPlayer* Player); // Function Mist.MistCheatingComponent.ServerToggleStatusEffectsDebug // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c5200
	void ServerToggleInvincibility(); // Function Mist.MistCheatingComponent.ServerToggleInvincibility // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x109c850
	void ServerToggleIdle(); // Function Mist.MistCheatingComponent.ServerToggleIdle // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c51e0
	void ServerTeleportWalkerTo(float X, float Y); // Function Mist.MistCheatingComponent.ServerTeleportWalkerTo // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c5110
	void ServerTeleportToPlayer(struct FString PlayerName); // Function Mist.MistCheatingComponent.ServerTeleportToPlayer // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c5070
	void ServerTeleportTo(struct FVector Location, bool bAdjustToGround); // Function Mist.MistCheatingComponent.ServerTeleportTo // (Net|NetReliableNative|Event|Public|NetServer|HasDefaults) // @ game+0x10c4f90
	void ServerTeleportPlayerToMe(struct FString PlayerName); // Function Mist.MistCheatingComponent.ServerTeleportPlayerToMe // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c4ef0
	void ServerTeleportEveryoneToMe(); // Function Mist.MistCheatingComponent.ServerTeleportEveryoneToMe // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c4ed0
	void ServerTeleport(float Distance); // Function Mist.MistCheatingComponent.ServerTeleport // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c4e50
	void ServerTakeItems(struct FString Name, int32_t Count, bool bBestEffort); // Function Mist.MistCheatingComponent.ServerTakeItems // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c4d30
	void ServerStripWorm(); // Function Mist.MistCheatingComponent.ServerStripWorm // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c4d10
	void ServerStopWorm(bool Value); // Function Mist.MistCheatingComponent.ServerStopWorm // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c4c80
	void ServerStopSpectating(); // Function Mist.MistCheatingComponent.ServerStopSpectating // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c4c60
	void ServerStartSpectating(bool bShowAllNametags); // Function Mist.MistCheatingComponent.ServerStartSpectating // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c4bd0
	void ServerStartCineTimer(float Time, struct FString Message); // Function Mist.MistCheatingComponent.ServerStartCineTimer // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c4af0
	void ServerSpawnWalker(struct AMistWalker* InWalkerToSpawn, int32_t WalkerQuality); // Function Mist.MistCheatingComponent.ServerSpawnWalker // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c4a20
	void ServerSpawnSandstorm(struct FTransform Transform); // Function Mist.MistCheatingComponent.ServerSpawnSandstorm // (Net|NetReliableNative|Event|Public|NetServer|HasDefaults) // @ game+0x10c4930
	void ServerSpawnProtectWalker(); // Function Mist.MistCheatingComponent.ServerSpawnProtectWalker // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c4910
	void ServerSpawnPoi(); // Function Mist.MistCheatingComponent.ServerSpawnPoi // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x108bfd0
	void ServerSpawnMonkey(float Distance, int32_t Amount); // Function Mist.MistCheatingComponent.ServerSpawnMonkey // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c4840
	void ServerSpawnMob(struct AActor* InMobToSpawn, float Distance, int32_t Amount); // Function Mist.MistCheatingComponent.ServerSpawnMob // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c4740
	void ServerSpawnFightClubWeaponRack(struct FString ItemSetName, bool bUseOncePerRespawn, struct TArray<struct UMistItemTemplate*> Items, struct TArray<int32_t> Quantities); // Function Mist.MistCheatingComponent.ServerSpawnFightClubWeaponRack // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c45c0
	void ServerSpawnEventAsteroid(); // Function Mist.MistCheatingComponent.ServerSpawnEventAsteroid // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c45a0
	void ServerSpawnCreatures(struct AMistPhysicalMob* Creature, struct AMistMobController* CreatureController, float Distance); // Function Mist.MistCheatingComponent.ServerSpawnCreatures // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c44a0
	void ServerSpawnCombatBot(float Distance, int32_t CombatAction, float HeavyAttackPower); // Function Mist.MistCheatingComponent.ServerSpawnCombatBot // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c43a0
	void ServerSpawnActor(struct AActor* ActorClass, float Distance); // Function Mist.MistCheatingComponent.ServerSpawnActor // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c42d0
	void ServerSlomo(float NewTimeDilation); // Function Mist.MistCheatingComponent.ServerSlomo // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c4250
	void ServerSimulateTravelWalker(); // Function Mist.MistCheatingComponent.ServerSimulateTravelWalker // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c4230
	void ServerSimulateRedeployPenalty(); // Function Mist.MistCheatingComponent.ServerSimulateRedeployPenalty // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c4210
	void ServerSimulateAsteroidImpact(float Distance); // Function Mist.MistCheatingComponent.ServerSimulateAsteroidImpact // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x1096cd0
	void ServerSetWeather(int32_t Index); // Function Mist.MistCheatingComponent.ServerSetWeather // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c4180
	void ServerSetWalkerStage(int32_t NewStage); // Function Mist.MistCheatingComponent.ServerSetWalkerStage // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c40f0
	void ServerSetWalkerSandiness(float Sandiness); // Function Mist.MistCheatingComponent.ServerSetWalkerSandiness // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c4070
	void ServerSetWalkerKinematic(bool bValue); // Function Mist.MistCheatingComponent.ServerSetWalkerKinematic // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c3fe0
	void ServerSetWalkerCraftingSkill(enum class EMistWalkerType WalkerType, int32_t Level); // Function Mist.MistCheatingComponent.ServerSetWalkerCraftingSkill // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c3f10
	void ServerSetSlotReservations(int32_t TotalSlots, int64_t Clan1Id, int32_t Clan1Slots, int64_t Clan2Id, int32_t Clan2Slots); // Function Mist.MistCheatingComponent.ServerSetSlotReservations // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c3d90
	void ServerSetServerTime(float Time); // Function Mist.MistCheatingComponent.ServerSetServerTime // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c3d10
	void ServerSetRealmTileDecay(float DecayInSeconds); // Function Mist.MistCheatingComponent.ServerSetRealmTileDecay // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c3c90
	void ServerSetRealmStatus(float ShutdownTimeSeconds, struct FString Status); // Function Mist.MistCheatingComponent.ServerSetRealmStatus // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c3bb0
	void ServerSetPresentationMode(bool bInIsEnabled); // Function Mist.MistCheatingComponent.ServerSetPresentationMode // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c3b20
	void ServerSetPlayerTier(enum class EMistAccountTier InTier); // Function Mist.MistCheatingComponent.ServerSetPlayerTier // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c3aa0
	void ServerSetPlayerStat(int32_t Amount, struct FString StatName); // Function Mist.MistCheatingComponent.ServerSetPlayerStat // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c39c0
	void ServerSetPlayerIds(int64_t CharacterId, int64_t ClanId); // Function Mist.MistCheatingComponent.ServerSetPlayerIds // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c38f0
	void ServerSetPingInterval(int32_t Interval); // Function Mist.MistCheatingComponent.ServerSetPingInterval // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c3860
	void ServerSetMultipliers(float Experience, float HarvestQuantity); // Function Mist.MistCheatingComponent.ServerSetMultipliers // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c3790
	void ServerSetMaxServerFps(float InFpsCap); // Function Mist.MistCheatingComponent.ServerSetMaxServerFps // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c3710
	void ServerSetLookatOwnership(int64_t ClanId); // Function Mist.MistCheatingComponent.ServerSetLookatOwnership // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c3680
	void ServerSetHealth(float Health, float MaxHealth); // Function Mist.MistCheatingComponent.ServerSetHealth // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c35b0
	void ServerSetClanPermission(int32_t Permission, bool bValue); // Function Mist.MistCheatingComponent.ServerSetClanPermission // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c34e0
	void ServerSetClaim(int64_t CharacterId, int64_t ClanId); // Function Mist.MistCheatingComponent.ServerSetClaim // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c3410
	void ServerSetCheatEnabled(struct FName InCheat, bool bEnable); // Function Mist.MistCheatingComponent.ServerSetCheatEnabled // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c3340
	void ServerSetCharacterState(enum class EMistCharacterState State); // Function Mist.MistCheatingComponent.ServerSetCharacterState // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c32c0
	void ServerSetActorHealth(float Value); // Function Mist.MistCheatingComponent.ServerSetActorHealth // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c3240
	void ServerSendTrashReliable(struct TArray<int32_t> TrashArray); // Function Mist.MistCheatingComponent.ServerSendTrashReliable // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c31a0
	void ServerSendTrash(struct TArray<int32_t> TrashArray); // Function Mist.MistCheatingComponent.ServerSendTrash // (Net|Native|Event|Public|NetServer) // @ game+0x10c3100
	void ServerSaveLocalWorld(struct FString SaveName); // Function Mist.MistCheatingComponent.ServerSaveLocalWorld // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c3060
	void ServerRestartTutorial(); // Function Mist.MistCheatingComponent.ServerRestartTutorial // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c3040
	void ServerRemoveWaypoint(int32_t Index); // Function Mist.MistCheatingComponent.ServerRemoveWaypoint // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c2fb0
	void ServerRemoveSandstorm(); // Function Mist.MistCheatingComponent.ServerRemoveSandstorm // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c2f90
	void ServerRemoveMarkers(); // Function Mist.MistCheatingComponent.ServerRemoveMarkers // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c2f70
	void ServerRegenerateFlotillaQuests(int32_t Number); // Function Mist.MistCheatingComponent.ServerRegenerateFlotillaQuests // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c2ee0
	void ServerPersistServer(bool bWithCleanup); // Function Mist.MistCheatingComponent.ServerPersistServer // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c2e50
	void ServerNoClip(bool bEnable); // Function Mist.MistCheatingComponent.ServerNoClip // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c2dc0
	void ServerNextQuest(int32_t Quantity); // Function Mist.MistCheatingComponent.ServerNextQuest // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c2d30
	void ServerNetActor(struct AMistNetProjectile* NetClass); // Function Mist.MistCheatingComponent.ServerNetActor // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c2ca0
	void ServerModifyEquipmentWear(float WearDelta); // Function Mist.MistCheatingComponent.ServerModifyEquipmentWear // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x109d030
	void ServerLocalFreeBuilding(bool bEnable); // Function Mist.MistCheatingComponent.ServerLocalFreeBuilding // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c2c10
	void ServerLoadLocalWorld(struct FString SaveName); // Function Mist.MistCheatingComponent.ServerLoadLocalWorld // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c2b70
	void ServerLeaveClan(); // Function Mist.MistCheatingComponent.ServerLeaveClan // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10a3cd0
	void ServerKillWorm(); // Function Mist.MistCheatingComponent.ServerKillWorm // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c2b50
	void ServerKillAllMonkeys(); // Function Mist.MistCheatingComponent.ServerKillAllMonkeys // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c2b30
	void ServerKillAllMobs(); // Function Mist.MistCheatingComponent.ServerKillAllMobs // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c2b10
	void ServerKillAllFoliage(); // Function Mist.MistCheatingComponent.ServerKillAllFoliage // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c2af0
	void ServerKickMe(); // Function Mist.MistCheatingComponent.ServerKickMe // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c2ad0
	void ServerGrantShopItem(struct FName ShopItemId, int32_t Amount); // Function Mist.MistCheatingComponent.ServerGrantShopItem // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c2a00
	void ServerGrantLocalShopItem(struct FName ShopItemId, int32_t Amount); // Function Mist.MistCheatingComponent.ServerGrantLocalShopItem // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c2930
	void ServerGiveMoney(int32_t Amount); // Function Mist.MistCheatingComponent.ServerGiveMoney // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c28a0
	void ServerGiveItem(struct FMistItem Item, int32_t Count); // Function Mist.MistCheatingComponent.ServerGiveItem // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c27b0
	void ServerGiveIc(int32_t Amount, bool bFromQuests); // Function Mist.MistCheatingComponent.ServerGiveIc // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c26e0
	void ServerGiveExp(int32_t Amount, bool IsShared); // Function Mist.MistCheatingComponent.ServerGiveExp // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c2610
	void ServerGetPresentationMode(); // Function Mist.MistCheatingComponent.ServerGetPresentationMode // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10a41d0
	void ServerGetPlayerTier(); // Function Mist.MistCheatingComponent.ServerGetPlayerTier // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10a4190
	void ServerGetClanRank(); // Function Mist.MistCheatingComponent.ServerGetClanRank // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10a4130
	void ServerGenerateRandomAuction(); // Function Mist.MistCheatingComponent.ServerGenerateRandomAuction // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c25f0
	void ServerFreeShopItems(bool bEnable); // Function Mist.MistCheatingComponent.ServerFreeShopItems // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c2560
	void ServerForceSendStatistics(); // Function Mist.MistCheatingComponent.ServerForceSendStatistics // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c2540
	void ServerEquipItem(struct UMistEquipmentItemTemplate* ItemClass); // Function Mist.MistCheatingComponent.ServerEquipItem // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c24b0
	void ServerEnterMarkersMode(); // Function Mist.MistCheatingComponent.ServerEnterMarkersMode // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c2490
	void ServerEnableRupu(); // Function Mist.MistCheatingComponent.ServerEnableRupu // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c2470
	void ServerDyeAllItems(int32_t PrimaryDyeId, int32_t SecondaryDyeId); // Function Mist.MistCheatingComponent.ServerDyeAllItems // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c23b0
	void ServerDumpPhysicsComplexity(); // Function Mist.MistCheatingComponent.ServerDumpPhysicsComplexity // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c2390
	void ServerDisableRupu(); // Function Mist.MistCheatingComponent.ServerDisableRupu // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c2370
	void ServerDestroyObject(); // Function Mist.MistCheatingComponent.ServerDestroyObject // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c2350
	void ServerDebugFoliageQualityValue(struct FString GroupNameFilter, float X, float Y); // Function Mist.MistCheatingComponent.ServerDebugFoliageQualityValue // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c2230
	void ServerDamageWalker(float Damage, struct UDamageType* DamageType); // Function Mist.MistCheatingComponent.ServerDamageWalker // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c2160
	void ServerCustomizeCharacter(struct FMistCharacterCustomizationValues CustomizationValues); // Function Mist.MistCheatingComponent.ServerCustomizeCharacter // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c20b0
	void ServerCreateClan(struct FString InName, int32_t ColorIndex, int32_t EmblemIndex); // Function Mist.MistCheatingComponent.ServerCreateClan // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c1f90
	void ServerCrash(int32_t CrashType, bool bPersistServer); // Function Mist.MistCheatingComponent.ServerCrash // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c1ec0
	void ServerClearInventory(); // Function Mist.MistCheatingComponent.ServerClearInventory // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c1ea0
	void ServerClearClaim(); // Function Mist.MistCheatingComponent.ServerClearClaim // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c1e80
	void ServerClapperBoard(float Delay); // Function Mist.MistCheatingComponent.ServerClapperBoard // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c1e00
	void ServerChangeToClan(int64_t ClanId); // Function Mist.MistCheatingComponent.ServerChangeToClan // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c1d70
	void ServerAdvanceAuctions(); // Function Mist.MistCheatingComponent.ServerAdvanceAuctions // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c1d50
	void ServerAdminOpenEverything(bool bEnable); // Function Mist.MistCheatingComponent.ServerAdminOpenEverything // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c1cc0
	void ServerAddWaypoint(int32_t Index, struct FString Designation, struct FColor Color, struct FVector Location); // Function Mist.MistCheatingComponent.ServerAddWaypoint // (Net|NetReliableNative|Event|Public|NetServer|HasDefaults) // @ game+0x10c1b70
	void ServerAddRandomTradeStationVaultContent(int32_t Money, int32_t NumItems, struct FString ItemNameFilter); // Function Mist.MistCheatingComponent.ServerAddRandomTradeStationVaultContent // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c1a50
	void ServerAddRandomTradeStationOrders(int32_t NumOrders, struct FString ItemNameFilter); // Function Mist.MistCheatingComponent.ServerAddRandomTradeStationOrders // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c1970
	void ServerActivateVitamin(struct UMistVitaminItemTemplate* ItemClass); // Function Mist.MistCheatingComponent.ServerActivateVitamin // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c18e0
	void Server_RegenerateIcOrdersWithOffest(int32_t InOffset); // Function Mist.MistCheatingComponent.Server_RegenerateIcOrdersWithOffest // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x10c5490
	void SendTrashToServer(int32_t Amount, int32_t Size, bool bReliable); // Function Mist.MistCheatingComponent.SendTrashToServer // (Final|Exec|Native|Public) // @ game+0x10c17e0
	void SaveLocalWorld(struct FString SaveName); // Function Mist.MistCheatingComponent.SaveLocalWorld // (Final|Exec|Native|Public) // @ game+0x10c1740
	void Revive(); // Function Mist.MistCheatingComponent.Revive // (Final|Exec|Native|Public) // @ game+0x10c1720
	void RestartTutorial(); // Function Mist.MistCheatingComponent.RestartTutorial // (Final|Exec|Native|Public) // @ game+0x10c1700
	void ResetAchievements(); // Function Mist.MistCheatingComponent.ResetAchievements // (Final|Exec|Native|Public) // @ game+0x10c16e0
	void RemoveSandstorm(); // Function Mist.MistCheatingComponent.RemoveSandstorm // (Final|Exec|Native|Public) // @ game+0x10c16c0
	void RemoveMarkers(); // Function Mist.MistCheatingComponent.RemoveMarkers // (Final|Exec|Native|Public) // @ game+0x10c16a0
	void RemoveHudCountdown(struct FString Identifier); // Function Mist.MistCheatingComponent.RemoveHudCountdown // (Final|Exec|Native|Public) // @ game+0x10c1600
	void RegenerateIcOrdersWithOffset(int32_t InOffset); // Function Mist.MistCheatingComponent.RegenerateIcOrdersWithOffset // (Final|Exec|Native|Public) // @ game+0x10c1580
	void RegenerateFlotillaQuests(int32_t Number); // Function Mist.MistCheatingComponent.RegenerateFlotillaQuests // (Final|Exec|Native|Public) // @ game+0x10c1500
	void ReceiveInvite(); // Function Mist.MistCheatingComponent.ReceiveInvite // (Final|Exec|Native|Public) // @ game+0x10c14e0
	void PrintStatusEffects(); // Function Mist.MistCheatingComponent.PrintStatusEffects // (Final|Exec|Native|Public) // @ game+0x10c14c0
	void PersistServerWithCleanup(); // Function Mist.MistCheatingComponent.PersistServerWithCleanup // (Final|Exec|Native|Public) // @ game+0x10c14a0
	void PersistServer(); // Function Mist.MistCheatingComponent.PersistServer // (Final|Exec|Native|Public) // @ game+0x10c1480
	void PauseWeather(); // Function Mist.MistCheatingComponent.PauseWeather // (Final|Exec|Native|Public) // @ game+0x10c1460
	void OffMapLobby2Stub(); // Function Mist.MistCheatingComponent.OffMapLobby2Stub // (Final|Exec|Native|Public) // @ game+0x10c1440
	void NoClip(bool bEnable); // Function Mist.MistCheatingComponent.NoClip // (Final|Exec|Native|Public) // @ game+0x10c13b0
	void NextQuest(int32_t Quantity); // Function Mist.MistCheatingComponent.NextQuest // (Final|Exec|Native|Public) // @ game+0x10c1330
	void NetActor(struct FString NetClassName); // Function Mist.MistCheatingComponent.NetActor // (Final|Exec|Native|Public) // @ game+0x10c1290
	void ModifyEquipmentWear(float WearDelta); // Function Mist.MistCheatingComponent.ModifyEquipmentWear // (Final|Exec|Native|Public) // @ game+0x10c1210
	void LocalFreeBuilding(bool bEnable); // Function Mist.MistCheatingComponent.LocalFreeBuilding // (Final|Exec|Native|Public) // @ game+0x10c1180
	void LoadLocalWorld(struct FString SaveName); // Function Mist.MistCheatingComponent.LoadLocalWorld // (Final|Exec|Native|Public) // @ game+0x10c10e0
	void LeaveMarkersMode(); // Function Mist.MistCheatingComponent.LeaveMarkersMode // (Final|Exec|Native|Public) // @ game+0x10c10c0
	void LeaveClan(); // Function Mist.MistCheatingComponent.LeaveClan // (Final|Exec|Native|Public) // @ game+0x10c10a0
	void KnockOut(); // Function Mist.MistCheatingComponent.KnockOut // (Final|Exec|Native|Public) // @ game+0x10c1080
	void KillWorm(); // Function Mist.MistCheatingComponent.KillWorm // (Final|Exec|Native|Public) // @ game+0x10c1060
	void KillAllMonkeys(); // Function Mist.MistCheatingComponent.KillAllMonkeys // (Final|Exec|Native|Public) // @ game+0x10c1040
	void KillAllMobs(); // Function Mist.MistCheatingComponent.KillAllMobs // (Final|Exec|Native|Public) // @ game+0x10c1020
	void KillAllFoliage(); // Function Mist.MistCheatingComponent.KillAllFoliage // (Final|Exec|Native|Public) // @ game+0x10c1000
	void Kill(); // Function Mist.MistCheatingComponent.Kill // (Final|Exec|Native|Public) // @ game+0x10c0fe0
	void KickMe(); // Function Mist.MistCheatingComponent.KickMe // (Final|Exec|Native|Public) // @ game+0x10c0fc0
	void JoinRealmStub(); // Function Mist.MistCheatingComponent.JoinRealmStub // (Final|Exec|Native|Public) // @ game+0x10c0fa0
	void JoinRealmSearchStub(); // Function Mist.MistCheatingComponent.JoinRealmSearchStub // (Final|Exec|Native|Public) // @ game+0x10c0f80
	void JoinQueueStub(); // Function Mist.MistCheatingComponent.JoinQueueStub // (Final|Exec|Native|Public) // @ game+0x10c0f60
	void InstantConstruction(bool bEnable); // Function Mist.MistCheatingComponent.InstantConstruction // (Final|Exec|Native|Public) // @ game+0x10c0ed0
	void IncrementAchievementStat(struct FString AchievementStatName); // Function Mist.MistCheatingComponent.IncrementAchievementStat // (Final|Exec|Native|Public) // @ game+0x10c0e30
	void HACK_EnableGameplayDebuggingInput(); // Function Mist.MistCheatingComponent.HACK_EnableGameplayDebuggingInput // (Final|Exec|Native|Public) // @ game+0x10c0d70
	void GroundQualityDebugArea(float DebugLifeTime, float Radius); // Function Mist.MistCheatingComponent.GroundQualityDebugArea // (Final|Exec|Native|Public) // @ game+0x10c0cb0
	void GrantShopItem(struct FName ShopItemId, int32_t Amount); // Function Mist.MistCheatingComponent.GrantShopItem // (Final|Exec|Native|Public) // @ game+0x10c0bf0
	void GrantLocalShopItem(struct FName ShopItemId, int32_t Amount); // Function Mist.MistCheatingComponent.GrantLocalShopItem // (Final|Exec|Native|Public) // @ game+0x10c0bf0
	void GiveMoney(int32_t Amount); // Function Mist.MistCheatingComponent.GiveMoney // (Final|Exec|Native|Public) // @ game+0x10c0b70
	void GiveItemSkin(struct FString Name, int32_t Skin, int32_t Count); // Function Mist.MistCheatingComponent.GiveItemSkin // (Final|Exec|Native|Public) // @ game+0x10c0900
	void GiveItemsFor(struct FString Name, int32_t Count); // Function Mist.MistCheatingComponent.GiveItemsFor // (Final|Exec|Native|Public) // @ game+0x10c0a50
	void GiveItemSet(struct FString NameFilter); // Function Mist.MistCheatingComponent.GiveItemSet // (Final|Exec|Native|Public) // @ game+0x10c0820
	void GiveItemQuality(struct FString Name, int32_t Quality, int32_t Count); // Function Mist.MistCheatingComponent.GiveItemQuality // (Final|Exec|Native|Public) // @ game+0x10c06d0
	void GiveItem(struct FString Name, int32_t Count); // Function Mist.MistCheatingComponent.GiveItem // (Final|Exec|Native|Public) // @ game+0x10c05b0
	void GiveIc(int32_t Amount, bool bFromQuests); // Function Mist.MistCheatingComponent.GiveIc // (Final|Exec|Native|Public) // @ game+0x10c04f0
	void GiveExp(int32_t Amount, bool IsShared); // Function Mist.MistCheatingComponent.GiveExp // (Final|Exec|Native|Public) // @ game+0x10c0430
	void GetPresentationMode(); // Function Mist.MistCheatingComponent.GetPresentationMode // (Final|Exec|Native|Public) // @ game+0x10c0410
	void GetPlayerTier(); // Function Mist.MistCheatingComponent.GetPlayerTier // (Final|Exec|Native|Public) // @ game+0x10c03f0
	void GetPlayerIds(); // Function Mist.MistCheatingComponent.GetPlayerIds // (Final|Exec|Native|Public) // @ game+0x10c03d0
	void GetClanRank(); // Function Mist.MistCheatingComponent.GetClanRank // (Final|Exec|Native|Public) // @ game+0x10c03b0
	void GenerateRandomAuction(); // Function Mist.MistCheatingComponent.GenerateRandomAuction // (Final|Exec|Native|Public) // @ game+0x10c0390
	void FreeShopItems(bool bEnable); // Function Mist.MistCheatingComponent.FreeShopItems // (Final|Exec|Native|Public) // @ game+0x10c0300
	void FreeBuilding(bool bEnable); // Function Mist.MistCheatingComponent.FreeBuilding // (Final|Exec|Native|Public) // @ game+0x10c0270
	void ForceSendStatistics(); // Function Mist.MistCheatingComponent.ForceSendStatistics // (Final|Exec|Native|Public) // @ game+0x10c0250
	void FoliageDebugArea(float DebugLifeTime, float Radius); // Function Mist.MistCheatingComponent.FoliageDebugArea // (Final|Exec|Native|Public) // @ game+0x10c0190
	void ExecuteCommands(struct FString CommandsKey); // Function Mist.MistCheatingComponent.ExecuteCommands // (Final|Exec|Native|Public) // @ game+0x10c00f0
	void ExecuteAdminCommand(struct FString CommandsKey); // Function Mist.MistCheatingComponent.ExecuteAdminCommand // (Final|Exec|Native|Public) // @ game+0x10c0050
	void EquipItemSet(struct FString NameFilter); // Function Mist.MistCheatingComponent.EquipItemSet // (Final|Exec|Native|Public) // @ game+0x10bff70
	void EquipItem(struct FString Name); // Function Mist.MistCheatingComponent.EquipItem // (Final|Exec|Native|Public) // @ game+0x10bfe90
	void EnterMarkersMode(); // Function Mist.MistCheatingComponent.EnterMarkersMode // (Final|Exec|Native|Public) // @ game+0x10bfe70
	void EnableRupu(); // Function Mist.MistCheatingComponent.EnableRupu // (Final|Exec|Native|Public) // @ game+0x10bfe50
	void DyeAllItems(int32_t PrimaryDyeId, int32_t SecondaryDyeId); // Function Mist.MistCheatingComponent.DyeAllItems // (Final|Exec|Native|Public) // @ game+0x10bfd90
	void DumpPhysicsComplexity(bool bServer); // Function Mist.MistCheatingComponent.DumpPhysicsComplexity // (Final|Exec|Native|Public) // @ game+0x10bfd00
	void DumpCurrentWeatherData(); // Function Mist.MistCheatingComponent.DumpCurrentWeatherData // (Final|Exec|Native|Public) // @ game+0x10bfca0
	void DisableRupu(); // Function Mist.MistCheatingComponent.DisableRupu // (Final|Exec|Native|Public) // @ game+0x10bfce0
	void DestroyObject(); // Function Mist.MistCheatingComponent.DestroyObject // (Final|Exec|Native|Public) // @ game+0x10bfcc0
	void DebugWeathers(); // Function Mist.MistCheatingComponent.DebugWeathers // (Final|Exec|Native|Public) // @ game+0x10bfca0
	void DebugLocomotion(); // Function Mist.MistCheatingComponent.DebugLocomotion // (Final|Exec|Native|Public) // @ game+0x10bfca0
	void DebugFoliageType(); // Function Mist.MistCheatingComponent.DebugFoliageType // (Final|Exec|Native|Public) // @ game+0x10bfc80
	void DebugFoliageQualityValue(struct FString GroupNameFilter, float X, float Y); // Function Mist.MistCheatingComponent.DebugFoliageQualityValue // (Final|Exec|Native|Public) // @ game+0x10bfb60
	void DebugAnimationBudgeting(bool bOnlyWithTickEnabled); // Function Mist.MistCheatingComponent.DebugAnimationBudgeting // (Final|Exec|Native|Public) // @ game+0x10bfad0
	void DamageWalker(float Damage, struct FString DamageTypeName); // Function Mist.MistCheatingComponent.DamageWalker // (Final|Exec|Native|Public) // @ game+0x10bf9f0
	void CustomizeCharacter(); // Function Mist.MistCheatingComponent.CustomizeCharacter // (Final|Exec|Native|Public) // @ game+0x10bf9d0
	void CreateClan(struct FString InName, int32_t ColorIndex, int32_t EmblemIndex); // Function Mist.MistCheatingComponent.CreateClan // (Final|Exec|Native|Public) // @ game+0x10bf8c0
	void CreateCharacterStub(); // Function Mist.MistCheatingComponent.CreateCharacterStub // (Final|Exec|Native|Public) // @ game+0x10bf8a0
	void CrashServer(int32_t CrashType, bool bPersistServer); // Function Mist.MistCheatingComponent.CrashServer // (Final|Exec|Native|Public) // @ game+0x10bf7e0
	void Crash(int32_t CrashType); // Function Mist.MistCheatingComponent.Crash // (Final|Exec|Native|Public) // @ game+0x10bf760
	void ClearInventory(); // Function Mist.MistCheatingComponent.ClearInventory // (Final|Exec|Native|Public) // @ game+0x10bf740
	void ClearClaim(); // Function Mist.MistCheatingComponent.ClearClaim // (Final|Exec|Native|Public) // @ game+0x10bf720
	void ClapperBoard(float Delay); // Function Mist.MistCheatingComponent.ClapperBoard // (Final|Exec|Native|Public) // @ game+0x10bf6a0
	void CheckRootOrientation(struct FString WeaponTypeName, struct FString LocomotionTypeName); // Function Mist.MistCheatingComponent.CheckRootOrientation // (Final|Exec|Native|Public) // @ game+0x10bf530
	void CheckCombatAnimations(struct FString Name, bool bPrintSweetspots); // Function Mist.MistCheatingComponent.CheckCombatAnimations // (Final|Exec|Native|Public) // @ game+0x10bf400
	void CheatUnlockAll(); // Function Mist.MistCheatingComponent.CheatUnlockAll // (Final|Exec|Native|Public) // @ game+0x10bf3e0
	void CharacterStopMedidating(); // Function Mist.MistCheatingComponent.CharacterStopMedidating // (Final|Exec|Native|Public) // @ game+0x10bf3c0
	void CharacterStartMedidating(); // Function Mist.MistCheatingComponent.CharacterStartMedidating // (Final|Exec|Native|Public) // @ game+0x10bf3a0
	void CharacterMovementFullLog(bool bValue); // Function Mist.MistCheatingComponent.CharacterMovementFullLog // (Final|Exec|Native|Public) // @ game+0x10bf310
	void ChangeToClan(int64_t ClanId); // Function Mist.MistCheatingComponent.ChangeToClan // (Final|Exec|Native|Public) // @ game+0x10bf290
	void AdvanceAuctions(); // Function Mist.MistCheatingComponent.AdvanceAuctions // (Final|Exec|Native|Public) // @ game+0x10bf270
	void AdminOpenEverything(bool bEnable); // Function Mist.MistCheatingComponent.AdminOpenEverything // (Final|Exec|Native|Public) // @ game+0x10bf1e0
	void AddRandomTradeStationVaultContent(int32_t Money, int32_t NumItems, struct FString ItemNameFilter); // Function Mist.MistCheatingComponent.AddRandomTradeStationVaultContent // (Final|Exec|Native|Public) // @ game+0x10bf090
	void AddRandomTradeStationOrders(int32_t NumOrders, struct FString ItemNameFilter); // Function Mist.MistCheatingComponent.AddRandomTradeStationOrders // (Final|Exec|Native|Public) // @ game+0x10bef70
	void AddHudMessage(struct FText& MessageText, bool bRequiresConfirmation); // Function Mist.MistCheatingComponent.AddHudMessage // (Final|Exec|Native|Public|HasOutParms) // @ game+0x10bee50
	void AddHudLog(struct FName& Type, struct FText& TextOverride); // Function Mist.MistCheatingComponent.AddHudLog // (Final|Exec|Native|Public|HasOutParms) // @ game+0x10bed20
	void AddHudCountdown(struct FText& Text, float Seconds, float HideAfterSeconds, bool bKeep, bool bRemoveOnBind, struct FString Identifier, struct FText& Description); // Function Mist.MistCheatingComponent.AddHudCountdown // (Final|Exec|Native|Public|HasOutParms) // @ game+0x10bea60
};

// Class Mist.MistCheatingOverlayWidget
// Size: 0x2c8 (Inherited: 0x2c0)
struct UMistCheatingOverlayWidget : UMistUIWidget {
	struct UVerticalBox* CheatTextHolderVerticalBox; // 0x2c0(0x08)
};

// Class Mist.MistCheatingTextBlockWidget
// Size: 0x320 (Inherited: 0x2c0)
struct UMistCheatingTextBlockWidget : UMistUIWidget {
	struct UTextBlock* CheatTextBlock; // 0x2c0(0x08)
	char pad_2C8[0x58]; // 0x2c8(0x58)

	void HandleCheatLogUpdated(struct FCheatLog DataCheatLog); // Function Mist.MistCheatingTextBlockWidget.HandleCheatLogUpdated // (Final|Native|Private) // @ game+0x10cc5a0
};

// Class Mist.MistStructurePart
// Size: 0x5b8 (Inherited: 0x508)
struct AMistStructurePart : AMistBaseStructurePart {
	char pad_508[0x20]; // 0x508(0x20)
	struct UMistNettableComponent* NettableComponent; // 0x528(0x08)
	float Health; // 0x530(0x04)
	bool bFoundationWalkerCore; // 0x534(0x01)
	char pad_535[0x3]; // 0x535(0x03)
	struct FString CustomName; // 0x538(0x10)
	char pad_548[0x20]; // 0x548(0x20)
	struct FConnectedNodesSet ConnectedNodes; // 0x568(0x50)

	void StructureHealthChangedEvent__DelegateSignature(struct AMistStructurePart* Sender, float PrevHealth, float NewHealth); // DelegateFunction Mist.MistStructurePart.StructureHealthChangedEvent__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x163f1c0
	void OnRep_Health(float PrevHealth); // Function Mist.MistStructurePart.OnRep_Health // (Native|Protected) // @ game+0x11a9560
	void OnRep_ConnectedNodes(); // Function Mist.MistStructurePart.OnRep_ConnectedNodes // (Final|Native|Private) // @ game+0x11a9500
	void MulticastSetCustomName(struct FString InCustomName); // Function Mist.MistStructurePart.MulticastSetCustomName // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x11a9280
	void HandleNetAttached(); // Function Mist.MistStructurePart.HandleNetAttached // (Final|Native|Private) // @ game+0x11a87d0
};

// Class Mist.MistSteeringLevers
// Size: 0x5c8 (Inherited: 0x5b8)
struct AMistSteeringLevers : AMistStructurePart {
	struct UMistMannedWalkerControlComponent* ControlComponent; // 0x5b8(0x08)
	struct UMistInteractableComponent* SelectSpawnpointComponent; // 0x5c0(0x08)

	void HandleSelectSpawnpointQuery(struct UMistInteractableComponent* Sender, struct FMistInteraction& Interaction, bool& bInOutCanInteract, struct FMistInteractableProperties& Properties, struct FMistInteractionQuery& Query); // Function Mist.MistSteeringLevers.HandleSelectSpawnpointQuery // (Final|Native|Private|HasOutParms) // @ game+0x11a8a50
	void HandleSelectSpawnpointInteract(struct UMistInteractableComponent* Sender, struct FMistInteraction& Interaction); // Function Mist.MistSteeringLevers.HandleSelectSpawnpointInteract // (Final|Native|Private|HasOutParms) // @ game+0x11a8970
};

// Class Mist.MistCheatingLevers
// Size: 0x5c8 (Inherited: 0x5c8)
struct AMistCheatingLevers : AMistSteeringLevers {
};

// Class Mist.MistCheatingWalkerControlComponent
// Size: 0x648 (Inherited: 0x600)
struct UMistCheatingWalkerControlComponent : UMistMannedWalkerControlComponent {
	struct UMistProjectileItemTemplate* BoltItemTemplate; // 0x600(0x08)
	struct UMistProjectileItemTemplate* HarpoonItemTemplate1; // 0x608(0x08)
	struct UMistProjectileItemTemplate* HarpoonItemTemplate2; // 0x610(0x08)
	struct UMistProjectileItemTemplate* HarpoonItemTemplate3; // 0x618(0x08)
	struct UMistProjectileItemTemplate* TetherHarpoonItemTemplate1; // 0x620(0x08)
	struct UMistProjectileItemTemplate* TetherHarpoonItemTemplate2; // 0x628(0x08)
	struct UMistProjectileItemTemplate* TetherHarpoonItemTemplate3; // 0x630(0x08)
	float DebugLastShot; // 0x638(0x04)
	int32_t DebugAmmoSelection; // 0x63c(0x04)
	bool bDebugIsShooting; // 0x640(0x01)
	char pad_641[0x7]; // 0x641(0x07)

	void DebugShoot(int32_t Item, struct FVector Location, struct FRotator Rotation, bool Additional); // Function Mist.MistCheatingWalkerControlComponent.DebugShoot // (Final|Net|NetReliableNative|Event|Private|NetServer|HasDefaults) // @ game+0x10cc1d0
};

// Class Mist.MistCheckBox
// Size: 0x780 (Inherited: 0x770)
struct UMistCheckBox : UCheckBox {
	struct UMistBaseToolTipWidget* ToolTipWidgetClass; // 0x770(0x08)
	struct FMistCheckBoxStyle CheckBoxStyle; // 0x778(0x08)

	struct UWidget* CreateToolTipWidget(); // Function Mist.MistCheckBox.CreateToolTipWidget // (Native|Protected) // @ game+0x10b1050
};

// Class Mist.MistCinematicActor
// Size: 0x410 (Inherited: 0x410)
struct AMistCinematicActor : AMistCharacterCustomizationActor {
};

// Class Mist.MistCinematicSettings
// Size: 0xd0 (Inherited: 0x38)
struct UMistCinematicSettings : UMistSettingsObject {
	struct TSoftClassPtr<UObject> IntroSceneController; // 0x38(0x28)
	struct TSoftObjectPtr<ULevelSequence> IntroSceneLevelSequence; // 0x60(0x28)
	struct TArray<struct FMistIntroSceneAllowedMap> IntroSceneAllowedMaps; // 0x88(0x10)
	struct TSoftObjectPtr<UAnimMontage> IntroSceneTransitionAnimMontage; // 0x98(0x28)
	bool bUseFixedRotation; // 0xc0(0x01)
	char pad_C1[0x3]; // 0xc1(0x03)
	struct FRotator FixedRotation; // 0xc4(0x0c)
};

// Class Mist.MistClaimContenderPopupWidget
// Size: 0x2f0 (Inherited: 0x2c0)
struct UMistClaimContenderPopupWidget : UMistUIWidget {
	struct UTextBlock* NameWidget; // 0x2c0(0x08)
	struct UTextBlock* ActivationStatusWidget; // 0x2c8(0x08)
	struct UTextBlock* ActivationTimerWidget; // 0x2d0(0x08)
	struct UTextBlock* ClanWidget; // 0x2d8(0x08)
	char pad_2E0[0x10]; // 0x2e0(0x10)

	void HandleActivationTimer(); // Function Mist.MistClaimContenderPopupWidget.HandleActivationTimer // (Final|Native|Protected) // @ game+0x10cc500
};

// Class Mist.MistClaimingWalkerComponent
// Size: 0x2c0 (Inherited: 0xf0)
struct UMistClaimingWalkerComponent : UActorComponent {
	char pad_F0[0x20]; // 0xf0(0x20)
	bool bIsBlockedByTradeStationZone; // 0x110(0x01)
	char pad_111[0x1f]; // 0x111(0x1f)
	struct FMistComponentReference DeployInteractable; // 0x130(0x28)
	struct FMistComponentReference DirtyWaterContainer; // 0x158(0x28)
	struct FMistComponentReference PureWaterContainer; // 0x180(0x28)
	struct FMistComponentReference InventoryInteractable; // 0x1a8(0x28)
	struct FMistComponentReference PurifierInteractable; // 0x1d0(0x28)
	struct FMistComponentReference Purifier; // 0x1f8(0x28)
	struct FMistComponentReference NoBuildAreaRef; // 0x220(0x28)
	struct FMistComponentReference NoEnemyBuildAreaRef; // 0x248(0x28)
	struct FDateTime CreatedDate; // 0x270(0x08)
	float DeployAngleTolerance; // 0x278(0x04)
	char pad_27C[0x4]; // 0x27c(0x04)
	enum class EMistClaimingWalkerStatus ClaimingWalkerStatus; // 0x280(0x01)
	bool bDeploymentInProgress; // 0x281(0x01)
	char pad_282[0x6]; // 0x282(0x06)
	struct AMistWalker* CachedWalkerOwner; // 0x288(0x08)
	char pad_290[0x30]; // 0x290(0x30)

	void OnRep_ClaimingWalkerStatus(); // Function Mist.MistClaimingWalkerComponent.OnRep_ClaimingWalkerStatus // (Final|Native|Private) // @ game+0x10cceb0
	void HandleDeployQuery(struct UMistInteractableComponent* Sender, struct FMistInteraction& Interaction, bool& bInOutCanInteract, struct FMistInteractableProperties& Properties, struct FMistInteractionQuery& Query); // Function Mist.MistClaimingWalkerComponent.HandleDeployQuery // (Final|Native|Private|HasOutParms) // @ game+0x10cc860
	void HandleDeployInteraction(struct UMistInteractableComponent* Sender, struct FMistInteraction& Interaction); // Function Mist.MistClaimingWalkerComponent.HandleDeployInteraction // (Final|Native|Private|HasOutParms) // @ game+0x10cc780
	void ActivateClaim(); // Function Mist.MistClaimingWalkerComponent.ActivateClaim // (Final|Native|Private) // @ game+0x10cc190
};

// Class Mist.MistClanOwnershipComponent
// Size: 0x1f8 (Inherited: 0xf0)
struct UMistClanOwnershipComponent : UActorComponent {
	char pad_F0[0x80]; // 0xf0(0x80)
	struct FMistClanInfo OwnerClan; // 0x170(0x20)
	struct FMistOwnershipCharacter OwnerCharacter; // 0x190(0x30)
	bool bCanShareOwnership; // 0x1c0(0x01)
	bool bMustShareOwnership; // 0x1c1(0x01)
	bool bCanTransferOwnership; // 0x1c2(0x01)
	char pad_1C3[0x5]; // 0x1c3(0x05)
	int64_t OpaqueOwnerId; // 0x1c8(0x08)
	bool bSharedOwnership; // 0x1d0(0x01)
	char pad_1D1[0x27]; // 0x1d1(0x27)

	void OnRep_OwnerClan(struct FMistClanInfo& PrevClan); // Function Mist.MistClanOwnershipComponent.OnRep_OwnerClan // (Final|Native|Private|HasOutParms) // @ game+0x10d19c0
	void OnRep_OwnerCharacter(struct FMistOwnershipCharacter& PrevCharacter); // Function Mist.MistClanOwnershipComponent.OnRep_OwnerCharacter // (Final|Native|Private|HasOutParms) // @ game+0x10d1900
	void MulticastSetSharedOwnership(bool bShared); // Function Mist.MistClanOwnershipComponent.MulticastSetSharedOwnership // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x10d1870
	void MulticastSetOwnership(struct FMistClanInfo InClan, struct FMistOwnershipCharacter InCharacter); // Function Mist.MistClanOwnershipComponent.MulticastSetOwnership // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x10d16d0
	void MulticastSetActive(bool bActive); // Function Mist.MistClanOwnershipComponent.MulticastSetActive // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x10d1640
};

// Class Mist.MistClaimManagerComponent
// Size: 0x3b0 (Inherited: 0x1f8)
struct UMistClaimManagerComponent : UMistClanOwnershipComponent {
	struct AActor* ClaimActor; // 0x1f8(0x08)
	struct UMistMapIconComponent* IconComponent; // 0x200(0x08)
	bool bIsClaimed; // 0x208(0x01)
	enum class EMistRealmMapTileClaimability Claimability; // 0x209(0x01)
	char pad_20A[0x2]; // 0x20a(0x02)
	struct FVector ClaimLocation; // 0x20c(0x0c)
	struct FDateTime CreatedDate; // 0x218(0x08)
	struct TArray<struct FMistClaimContenderInfo> ClaimContenders; // 0x220(0x10)
	struct TMap<struct FMistItem, int32_t> StoredHarvestedResources; // 0x230(0x50)
	char pad_280[0x90]; // 0x280(0x90)
	struct FTimerHandle ClaimMurderIconCleanupTimer; // 0x310(0x08)
	struct TArray<struct FMistClaimMurderInfo> ClaimMurders; // 0x318(0x10)
	struct TArray<struct UMistPoachingComponent*> ActivePoachingComponents; // 0x328(0x10)
	struct TArray<struct FMistTrackingHutData> TrackingHuts; // 0x338(0x10)
	char pad_348[0x68]; // 0x348(0x68)

	void OnRep_ClaimStatus(); // Function Mist.MistClaimManagerComponent.OnRep_ClaimStatus // (Final|Native|Private) // @ game+0x10cce90
	void OnRep_ClaimContenders(); // Function Mist.MistClaimManagerComponent.OnRep_ClaimContenders // (Final|Native|Private) // @ game+0x10cce70
	void MulticastSetClaim(struct FVector InClaimLocation, struct FDateTime InCreatedDate); // Function Mist.MistClaimManagerComponent.MulticastSetClaim // (Final|Net|NetReliableNative|Event|NetMulticast|Private|HasDefaults) // @ game+0x10ccda0
	void MulticastRemoveContender(int32_t ContenderId); // Function Mist.MistClaimManagerComponent.MulticastRemoveContender // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x10ccd10
	void MulticastClearClaim(); // Function Mist.MistClaimManagerComponent.MulticastClearClaim // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x10cccf0
	void MulticastAddMurder(struct FMistClaimMurderInfo Murder); // Function Mist.MistClaimManagerComponent.MulticastAddMurder // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x10ccc60
	void MulticastAddContender(struct FMistClaimContenderInfo Contender); // Function Mist.MistClaimManagerComponent.MulticastAddContender // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x10ccba0
	void ClaimMurderIconCleanup(); // Function Mist.MistClaimManagerComponent.ClaimMurderIconCleanup // (Final|Native|Public) // @ game+0x10cc1b0
};

// Class Mist.MistClaimMapAsset
// Size: 0x30 (Inherited: 0x30)
struct UMistClaimMapAsset : UDataAsset {
};

// Class Mist.MistClaimMurderReportMessageLogContentWidget
// Size: 0x320 (Inherited: 0x2c0)
struct UMistClaimMurderReportMessageLogContentWidget : UMistMessageLogContentWidget {
	struct URichTextBlock* TextWidget; // 0x2c0(0x08)
	struct UMistClaimMurderReportMessageData* Data; // 0x2c8(0x08)
	struct TMap<enum class EMistWorldCardinalDirection, struct FText> AreaText; // 0x2d0(0x50)
};

// Class Mist.MistClaimPopupWidget
// Size: 0x2f0 (Inherited: 0x2c0)
struct UMistClaimPopupWidget : UMistUIWidget {
	struct UTextBlock* NameWidget; // 0x2c0(0x08)
	struct UTextBlock* ProtectionStatusWidget; // 0x2c8(0x08)
	struct UTextBlock* ProtectionExpirationWidget; // 0x2d0(0x08)
	struct UTextBlock* PlayerWidget; // 0x2d8(0x08)
	struct UTextBlock* ClanWidget; // 0x2e0(0x08)
	char pad_2E8[0x8]; // 0x2e8(0x08)

	void HandleUpdateNeeded(); // Function Mist.MistClaimPopupWidget.HandleUpdateNeeded // (Final|Native|Protected) // @ game+0x10cc500
};

// Class Mist.MistClaimSettings
// Size: 0x50 (Inherited: 0x38)
struct UMistClaimSettings : UMistSettingsObject {
	int32_t VulnerabilityDuration; // 0x38(0x04)
	int32_t ProtectionDuration; // 0x3c(0x04)
	int32_t ActivationDuration; // 0x40(0x04)
	int32_t CooldownBeforeDeploy; // 0x44(0x04)
	int32_t Radius; // 0x48(0x04)
	int32_t NoBonusAfterMurderDuration; // 0x4c(0x04)
};

// Class Mist.MistClanAsset
// Size: 0xd0 (Inherited: 0x30)
struct UMistClanAsset : UDataAsset {
	struct TMap<struct FString, struct UTexture2D*> RankIcons; // 0x30(0x50)
	struct TMap<enum class EMistClanPermission, struct FString> PermissionDisplayTexts; // 0x80(0x50)
};

// Class Mist.MistClanBankBalanceData
// Size: 0x158 (Inherited: 0x28)
struct UMistClanBankBalanceData : UObject {
	char pad_28[0xa0]; // 0x28(0xa0)
	struct UMistBackendHttpClient* BackendClient; // 0xc8(0x08)
	char pad_D0[0x88]; // 0xd0(0x88)
};

// Class Mist.MistClanColorComponent
// Size: 0x210 (Inherited: 0xf0)
struct UMistClanColorComponent : UActorComponent {
	struct FMistComponentReference ComponentRef; // 0xf0(0x28)
	bool bCacheMeshesOnBeginPlay; // 0x118(0x01)
	char pad_119[0x7]; // 0x119(0x07)
	struct FMistAttachmentMonitor AttachmentMonitor; // 0x120(0x80)
	struct FMistClanOwnershipMonitor OwnershipMonitor; // 0x1a0(0x60)
	struct TArray<struct UMeshComponent*> MeshComponents; // 0x200(0x10)

	struct FLinearColor GetClanColor(); // Function Mist.MistClanColorComponent.GetClanColor // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x10cc310
};

// Class Mist.MistClanColorSelectionWidget
// Size: 0x2f0 (Inherited: 0x2c0)
struct UMistClanColorSelectionWidget : UMistUIWidget {
	char pad_2C0[0x10]; // 0x2c0(0x10)
	struct UBorder* SelectionBorderWidget; // 0x2d0(0x08)
	struct UImage* ImageWidget; // 0x2d8(0x08)
	struct UMistUIButton* Button; // 0x2e0(0x08)
	char pad_2E8[0x8]; // 0x2e8(0x08)

	void HandleButtonClicked(struct UMistUIButton* Sender); // Function Mist.MistClanColorSelectionWidget.HandleButtonClicked // (Final|Native|Private) // @ game+0x10cc520
	void ClickedEvent__DelegateSignature(struct UMistClanColorSelectionWidget* Sender); // DelegateFunction Mist.MistClanColorSelectionWidget.ClickedEvent__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x163f1c0
};

// Class Mist.MistClanConfigData
// Size: 0x110 (Inherited: 0x28)
struct UMistClanConfigData : UObject {
	char pad_28[0x88]; // 0x28(0x88)
	struct UMistBackendHttpClient* BackendClient; // 0xb0(0x08)
	char pad_B8[0x58]; // 0xb8(0x58)
};

// Class Mist.MistUIInputDialog
// Size: 0x430 (Inherited: 0x3c0)
struct UMistUIInputDialog : UMistUIDialog {
	struct UTextBlock* DescriptionTextWidget; // 0x3c0(0x08)
	struct UEditableTextBox* InputWidget; // 0x3c8(0x08)
	struct UButton* OKButtonWidget; // 0x3d0(0x08)
	struct UButton* CancelButtonWidget; // 0x3d8(0x08)
	struct FText Description; // 0x3e0(0x18)
	struct FText Hint; // 0x3f8(0x18)
	struct FText Input; // 0x410(0x18)
	bool bAllowEmpty; // 0x428(0x01)
	bool bDisableOKIfInvalid; // 0x429(0x01)
	char pad_42A[0x6]; // 0x42a(0x06)

	void HandleOKButtonClicked(); // Function Mist.MistUIInputDialog.HandleOKButtonClicked // (Final|Native|Private) // @ game+0x11c4df0
	void HandleInputTextCommitted(struct FText& Text, enum class ETextCommit CommitMethod); // Function Mist.MistUIInputDialog.HandleInputTextCommitted // (Final|Native|Private|HasOutParms) // @ game+0x11c4cb0
	void HandleInputTextChanged(struct FText& Text); // Function Mist.MistUIInputDialog.HandleInputTextChanged // (Final|Native|Private|HasOutParms) // @ game+0x11c4be0
	void HandleCancelButtonClicked(); // Function Mist.MistUIInputDialog.HandleCancelButtonClicked // (Final|Native|Private) // @ game+0x11c4a70
};

// Class Mist.MistClanCreateDialog
// Size: 0x4b0 (Inherited: 0x430)
struct UMistClanCreateDialog : UMistUIInputDialog {
	struct UWidget* NameValidationPanelWidget; // 0x430(0x08)
	struct UTextBlock* NameValidationTextWidget; // 0x438(0x08)
	struct UImage* ColorImageWidget; // 0x440(0x08)
	struct UScrollBox* ColorsScrollWidget; // 0x448(0x08)
	struct UHorizontalBox* ColorsListWidget; // 0x450(0x08)
	struct UScrollBox* EmblemsScrollWidget; // 0x458(0x08)
	struct UHorizontalBox* EmblemsListWidget; // 0x460(0x08)
	char pad_468[0x8]; // 0x468(0x08)
	struct FSlateSound ColorClickedSound; // 0x470(0x18)
	struct FSlateSound EmblemClickedSound; // 0x488(0x18)
	struct UMistClanColorSelectionWidget* SelectedColorWidget; // 0x4a0(0x08)
	struct UMistClanEmblemSelectionWidget* SelectedEmblemWidget; // 0x4a8(0x08)

	void HandleEmblemWidgetClicked(struct UMistClanEmblemSelectionWidget* Sender); // Function Mist.MistClanCreateDialog.HandleEmblemWidgetClicked // (Final|Native|Private) // @ game+0x10ccb20
	void HandleColorWidgetClicked(struct UMistClanColorSelectionWidget* Sender); // Function Mist.MistClanCreateDialog.HandleColorWidgetClicked // (Final|Native|Private) // @ game+0x10cc700
	struct UWidget* GetOkButtonWidget(enum class EUINavigation Nav); // Function Mist.MistClanCreateDialog.GetOkButtonWidget // (Final|Native|Public|BlueprintCallable) // @ game+0x10cc470
	struct UWidget* GetCurrentSelectedEmblemWidget(enum class EUINavigation Nav); // Function Mist.MistClanCreateDialog.GetCurrentSelectedEmblemWidget // (Final|Native|Public|BlueprintCallable) // @ game+0x10cc3e0
	struct UWidget* GetCurrentSelectedColorWidget(enum class EUINavigation Nav); // Function Mist.MistClanCreateDialog.GetCurrentSelectedColorWidget // (Final|Native|Public|BlueprintCallable) // @ game+0x10cc350
};

// Class Mist.MistClanDataManager
// Size: 0xd8 (Inherited: 0x28)
struct UMistClanDataManager : UObject {
	struct UMistBackendHttpClient* BackendClient; // 0x28(0x08)
	struct UMistDataManager* DataManager; // 0x30(0x08)
	struct TMap<struct FMistApiRealmCharacterIdentifier, struct UMistClanBankBalanceData*> BankBalanceItems; // 0x38(0x50)
	struct TMap<struct FMistApiRealmCharacterIdentifier, struct UMistClanConfigData*> ConfigItems; // 0x88(0x50)
};

// Class Mist.MistClanDepositFlotsWidget
// Size: 0x2f0 (Inherited: 0x2c0)
struct UMistClanDepositFlotsWidget : UMistUIWidget {
	struct UButton* DepositFlotsButton; // 0x2c0(0x08)
	struct UButton* CancelButton; // 0x2c8(0x08)
	struct UTextBlock* PlayerFundsTextWidget; // 0x2d0(0x08)
	struct UMistNumberSliderWidget* DepositSliderWidget; // 0x2d8(0x08)
	struct UMistNumberInputWidget* DepositNumberInputWidget; // 0x2e0(0x08)
	struct UVerticalBox* ActionsVerticalBox; // 0x2e8(0x08)

	void HandleMoneyUpdated(struct AMistOasisPlayerState* InSender, uint64_t InMoney); // Function Mist.MistClanDepositFlotsWidget.HandleMoneyUpdated // (Final|Native|Private) // @ game+0x10d1420
	void HandleDepositSliderValueChanged(); // Function Mist.MistClanDepositFlotsWidget.HandleDepositSliderValueChanged // (Final|Native|Private) // @ game+0x10d1040
	void HandleDepositInputValueChanged(); // Function Mist.MistClanDepositFlotsWidget.HandleDepositInputValueChanged // (Final|Native|Private) // @ game+0x10d1020
	void HandleDepositFlotsButtonClicked(); // Function Mist.MistClanDepositFlotsWidget.HandleDepositFlotsButtonClicked // (Final|Native|Private) // @ game+0x10d0fe0
	void HandleCancelButtonClicked(); // Function Mist.MistClanDepositFlotsWidget.HandleCancelButtonClicked // (Final|Native|Private) // @ game+0x10d0ee0
};

// Class Mist.MistClanEmblemSelectionWidget
// Size: 0x2f0 (Inherited: 0x2c0)
struct UMistClanEmblemSelectionWidget : UMistUIWidget {
	char pad_2C0[0x10]; // 0x2c0(0x10)
	struct UBorder* SelectionBorderWidget; // 0x2d0(0x08)
	struct UImage* ImageWidget; // 0x2d8(0x08)
	struct UMistUIButton* Button; // 0x2e0(0x08)
	char pad_2E8[0x8]; // 0x2e8(0x08)

	void HandleButtonClicked(struct UMistUIButton* Sender); // Function Mist.MistClanEmblemSelectionWidget.HandleButtonClicked // (Final|Native|Private) // @ game+0x10cc520
	void ClickedEvent__DelegateSignature(struct UMistClanEmblemSelectionWidget* Sender); // DelegateFunction Mist.MistClanEmblemSelectionWidget.ClickedEvent__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x163f1c0
};

// Class Mist.MistClanInformationWidget
// Size: 0x368 (Inherited: 0x2c0)
struct UMistClanInformationWidget : UMistUIWidget {
	struct UButton* LeaveClanButton; // 0x2c0(0x08)
	struct UButton* DepositFlotsButton; // 0x2c8(0x08)
	struct UVerticalBox* ActionsBox; // 0x2d0(0x08)
	struct UMistClanDepositFlotsWidget* DepositFlotsWidget; // 0x2d8(0x08)
	char pad_2E0[0x88]; // 0x2e0(0x88)

	void HandleLeaveButtonClicked(); // Function Mist.MistClanInformationWidget.HandleLeaveButtonClicked // (Final|Native|Private) // @ game+0x10d13a0
	void HandleDepositFlotsButtonClicked(); // Function Mist.MistClanInformationWidget.HandleDepositFlotsButtonClicked // (Final|Native|Private) // @ game+0x10d1000
	struct UWidget* GetWidgetClosestToPoint(struct FVector2D AbsolutePoint); // Function Mist.MistClanInformationWidget.GetWidgetClosestToPoint // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x10d0d10
};

// Class Mist.MistClanInviteWidget
// Size: 0x328 (Inherited: 0x2c0)
struct UMistClanInviteWidget : UMistUIWidget {
	struct UTextBlock* ClanNameTextWidget; // 0x2c0(0x08)
	struct UButton* AcceptButtonWidget; // 0x2c8(0x08)
	struct UButton* RejectButtonWidget; // 0x2d0(0x08)
	char pad_2D8[0x50]; // 0x2d8(0x50)

	void HandleRejectClicked(); // Function Mist.MistClanInviteWidget.HandleRejectClicked // (Final|Native|Private) // @ game+0x10d1600
	void HandleAcceptClicked(); // Function Mist.MistClanInviteWidget.HandleAcceptClicked // (Final|Native|Private) // @ game+0x10d0ec0
};

// Class Mist.MistClanJoinCooldownMessageWidget
// Size: 0x2c8 (Inherited: 0x2c0)
struct UMistClanJoinCooldownMessageWidget : UMistUIWidget {
	struct UTextBlock* MessageWidget; // 0x2c0(0x08)
};

// Class Mist.MistClanlessMiniWidget
// Size: 0x308 (Inherited: 0x2c0)
struct UMistClanlessMiniWidget : UMistUIWidget {
	struct UButton* CreateButtonWidget; // 0x2c0(0x08)
	struct UVerticalBox* InviteListWidget; // 0x2c8(0x08)
	char pad_2D0[0x38]; // 0x2d0(0x38)

	void HandleCreateButtonClicked(); // Function Mist.MistClanlessMiniWidget.HandleCreateButtonClicked // (Final|Native|Private) // @ game+0x10d0fc0
};

// Class Mist.MistClanlessWidget
// Size: 0x310 (Inherited: 0x2c0)
struct UMistClanlessWidget : UMistUIWidget {
	struct UButton* CreateButtonWidget; // 0x2c0(0x08)
	struct UVerticalBox* InviteListWidget; // 0x2c8(0x08)
	struct UButton* MinimizeButton; // 0x2d0(0x08)
	char pad_2D8[0x38]; // 0x2d8(0x38)

	void HandleMinimizeClicked(); // Function Mist.MistClanlessWidget.HandleMinimizeClicked // (Final|Native|Private) // @ game+0x10d1400
	void HandleCreateButtonClicked(); // Function Mist.MistClanlessWidget.HandleCreateButtonClicked // (Final|Native|Private) // @ game+0x10d0fc0
};

// Class Mist.MistClanOverviewMiniWidget
// Size: 0x380 (Inherited: 0x2c0)
struct UMistClanOverviewMiniWidget : UMistUIWidget {
	struct UImage* ColorImageWidget; // 0x2c0(0x08)
	struct UTextBlock* ClanNameWidget; // 0x2c8(0x08)
	struct UMistClanRosterWidget* RosterWidget; // 0x2d0(0x08)
	struct UMistClanRecruitmentWidget* RecruitmentWidget; // 0x2d8(0x08)
	struct UMistClanInformationWidget* InformationWidget; // 0x2e0(0x08)
	struct UButton* MaximizeButton; // 0x2e8(0x08)
	struct UMistUITabControl* TabControl; // 0x2f0(0x08)
	char pad_2F8[0x88]; // 0x2f8(0x88)

	void HandleMaximizeClicked(); // Function Mist.MistClanOverviewMiniWidget.HandleMaximizeClicked // (Final|Native|Private) // @ game+0x10d13c0
};

// Class Mist.MistClanOverviewWidget
// Size: 0x378 (Inherited: 0x2c0)
struct UMistClanOverviewWidget : UMistUIWidget {
	struct UImage* ColorImageWidget; // 0x2c0(0x08)
	struct UTextBlock* ClanNameWidget; // 0x2c8(0x08)
	struct UMistClanRosterWidget* RosterWidget; // 0x2d0(0x08)
	struct UMistClanRecruitmentWidget* RecruitmentWidget; // 0x2d8(0x08)
	struct UMistClanInformationWidget* InformationWidget; // 0x2e0(0x08)
	struct UButton* MinimizeButton; // 0x2e8(0x08)
	char pad_2F0[0x88]; // 0x2f0(0x88)

	void HandleMinimizeClicked(); // Function Mist.MistClanOverviewWidget.HandleMinimizeClicked // (Final|Native|Private) // @ game+0x10d13e0
	struct UWidget* GetRosterWidgetClosestToPoint(enum class EUINavigation Nav); // Function Mist.MistClanOverviewWidget.GetRosterWidgetClosestToPoint // (Final|Native|Public|BlueprintCallable) // @ game+0x10d0c80
	struct UWidget* GetRecruitmentWidgetClosestToPoint(enum class EUINavigation Nav); // Function Mist.MistClanOverviewWidget.GetRecruitmentWidgetClosestToPoint // (Final|Native|Public|BlueprintCallable) // @ game+0x10d0bf0
	struct UWidget* GetInformationWidgetClosestToPoint(enum class EUINavigation Nav); // Function Mist.MistClanOverviewWidget.GetInformationWidgetClosestToPoint // (Final|Native|Public|BlueprintCallable) // @ game+0x10d0b60
};

// Class Mist.MistClanPermissionComponent
// Size: 0x118 (Inherited: 0xf0)
struct UMistClanPermissionComponent : UActorComponent {
	char pad_F0[0x20]; // 0xf0(0x20)
	enum class EMistClanPermission Permission; // 0x110(0x01)
	bool bCanBeDisabled; // 0x111(0x01)
	char pad_112[0x6]; // 0x112(0x06)

	void MulticastSetPermission(enum class EMistClanPermission NewPermission); // Function Mist.MistClanPermissionComponent.MulticastSetPermission // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x10d17f0
	void MulticastSetActive(bool bActive); // Function Mist.MistClanPermissionComponent.MulticastSetActive // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x10d1640
};

// Class Mist.MistClanPlayerWidget
// Size: 0x3f8 (Inherited: 0x2c0)
struct UMistClanPlayerWidget : UMistUIWidget {
	char pad_2C0[0x8]; // 0x2c0(0x08)
	struct URichTextBlock* PlayerNameTextWidget; // 0x2c8(0x08)
	struct UButton* RemoveButtonWidget; // 0x2d0(0x08)
	struct UImage* StatusImageWidget; // 0x2d8(0x08)
	struct UImage* OfflineStatusImageWidget; // 0x2e0(0x08)
	struct UMistClanRankButton* RankButtonWidget; // 0x2e8(0x08)
	struct UButton* PlayerButtonWidget; // 0x2f0(0x08)
	struct UTextBlock* NewRankTextWidget; // 0x2f8(0x08)
	struct UWidget* NewRankContainerWidget; // 0x300(0x08)
	struct UHorizontalBox* NewRanksIconsBox; // 0x308(0x08)
	struct UMistClanAsset* ClanAsset; // 0x310(0x08)
	struct UMistUIButton* IconButtonClass; // 0x318(0x08)
	bool bOnline; // 0x320(0x01)
	char pad_321[0xcf]; // 0x321(0xcf)
	struct UMistClanMemberDataObject* Data; // 0x3f0(0x08)

	void HandleRemoveClicked(); // Function Mist.MistClanPlayerWidget.HandleRemoveClicked // (Final|Native|Private) // @ game+0x10d1620
	void HandleRankClicked(struct UMistUIButton* Sender); // Function Mist.MistClanPlayerWidget.HandleRankClicked // (Final|Native|Private) // @ game+0x10d1580
	void HandlePlayerClicked(); // Function Mist.MistClanPlayerWidget.HandlePlayerClicked // (Final|Native|Private) // @ game+0x10d1560
	void HandleNewRankClicked(struct UMistUIButton* Sender); // Function Mist.MistClanPlayerWidget.HandleNewRankClicked // (Final|Native|Private) // @ game+0x10d14e0
};

// Class Mist.MistUIButton
// Size: 0x5e0 (Inherited: 0x2c0)
struct UMistUIButton : UMistUIWidget {
	struct UButton* ButtonWidget; // 0x2c0(0x08)
	struct UTextBlock* TextWidget; // 0x2c8(0x08)
	struct FText Text; // 0x2d0(0x18)
	struct FButtonStyle ButtonStyle; // 0x2e8(0x278)
	struct FSlateFontInfo TextFont; // 0x560(0x50)
	struct FMulticastInlineDelegate OnClick; // 0x5b0(0x10)
	struct FMulticastInlineDelegate OnHover; // 0x5c0(0x10)
	struct FMulticastInlineDelegate OnUnhover; // 0x5d0(0x10)

	void HandleButtonUnhover(); // Function Mist.MistUIButton.HandleButtonUnhover // (Final|Native|Private) // @ game+0x11c4a30
	void HandleButtonHover(); // Function Mist.MistUIButton.HandleButtonHover // (Final|Native|Private) // @ game+0x11c4a10
	void HandleButtonClick(); // Function Mist.MistUIButton.HandleButtonClick // (Final|Native|Private) // @ game+0x11c49b0
